#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: Modeler Common
# *
# * (C) Copyright IBM Corp. 1994, 2011
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_ALL

#cognosImporter=Cognos Import
#cognosExporter=Cognos Export

# Property resources key
cognos_server_url=URL du serveur Cognos
cognos_login_mode=Mode
cognos_namespace=Espace de nom
cognos_user_name=Nom d''utilisateur
cognos_password=Mot de passe

#Components common errors & warnings
unknownErrorMsg.LABEL=Erreur interne (inconnue)
initErrMsg.LABEL=Echec de l''initialisation
inputErrMsg.LABEL=Erreur lors de la lecture des donn\u00e9es d''entr\u00e9e
internalErrMsg.LABEL=Erreur interne
invalidMetadataErrMsg.LABEL=M\u00e9tadonn\u00e9es (dans les champs entr\u00e9e/sortie) non valides
fileNotExistErrorMsg.LABEL=Le fichier de donn\u00e9es n''existe pas
storageNotSupportErrorMsg.LABEL=L''int\u00e9gration ne prend pas en charge ce type de stockage de donn\u00e9es
invalidTargetErrorMsg.LABEL=Param\u00e8tre de variable cible non valide
invalidTarResponseErrorMsg.LABEL=Param\u00e8tre de variable de r\u00e9ponse cible non valide
predictorsEmptyErrMsg.LABEL=Le param\u00e8tre des pr\u00e9dicteurs ne doit pas \u00eatre vide
targetAsInputErrorMsg.LABEL=Le champ cible ne peut pas \u00eatre une entr\u00e9e
invalidFrequencyErrorMsg.LABEL=Le champ de fr\u00e9quence ne peut pas \u00eatre une entr\u00e9e
invalidTargetResponseErrorMsg.LABEL=Le champ de r\u00e9ponse cible ne peut pas \u00eatre une entr\u00e9e
invlidResponseCatErrorMsg.LABEL=La variable de r\u00e9ponse cible doit \u00eatre un indicateur.
noFrequencyErrorMsg.LABEL=Aucun champ de fr\u00e9quence s\u00e9lectionn\u00e9
noTargetErrorMsg.LABEL=Aucune valeur de champ cible n''a \u00e9t\u00e9 sp\u00e9cifi\u00e9e
invalidtarValueMsg.LABEL=Valeur de champ cible sp\u00e9cifi\u00e9e non valide
getfilePathMsg.LABEL=Erreur interne (obtention du fichier)
creationAlgorithmMsg.LABEL=Erreur interne (algorithme)
buildModelErrorMsg.LABEL=Erreur interne (cr\u00e9ation du composant)
assessModelErrorMsg.LABEL=Erreur interne (\u00e9valuation du composant)
exportPMLLErrorMsg.LABEL=Erreur interne (exportation PMML du composant)
getDataFieldErrorMsg.LABEL=Erreur interne (obtention du mod\u00e8le de donn\u00e9es)
tarResIsSameErrorMsg.LABEL=La variable cible, la variable de r\u00e9ponse cible, la variable de pond\u00e9ration et la variable de partition doivent \u00eatre diff\u00e9rentes
NoTargetFieldErrorMsg.LABEL=Aucun champ cible s\u00e9lectionn\u00e9
NoTargetResFieldErrorMsg.LABEL=Aucun champ de r\u00e9ponse cible s\u00e9lectionn\u00e9
targetResTrueErrorMsg.LABEL=La valeur vraie du param\u00e8tre de r\u00e9ponse cible n''est pas valide
PMMLNotExistErrorMsg.LABEL=Erreur interne (PMML manquant)
PMMLIsInvalidErrorMsg.LABEL=Erreur interne (PMML non valide)
NoPredVarInPMMLErrorMsg.LABEL=Erreur interne (aucune variable de pr\u00e9dicteur dans le fichier PMML)
PMMLNotMatchDataErrorMsg.LABEL=Erreur interne (R\u00e9pertoire PMML)
getDataSourceErrorMsg.LABEL=Erreur interne (Obtention de la source de donn\u00e9es)
dataFileISValidErrorMsg.LABEL=Les donn\u00e9es d''entr\u00e9e n''incluent pas les champs pr\u00e9dicteurs requis par le mod\u00e8le
TarFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d''entr\u00e9e n''incluent pas le champ cible requis par le mod\u00e8le
TRFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d''entr\u00e9e n''incluent pas le champ de r\u00e9ponse cible requis par le mod\u00e8le
FreFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d''entr\u00e9e n''incluent pas le champ d''effectif requis par le mod\u00e8le
InputFieldNOTMatchMsg.LABEL=Les donn\u00e9es d''entr\u00e9es n''incluent pas les champs requis par le mod\u00e8le
NoValidRecordsMsg.LABEL=Il n''y a pas d''enregistrement valide pour la cr\u00e9ation du mod\u00e8le
NoRecordsScoringMsg.LABEL=Il n''y a pas d''enregistrement valide pour le scoring
PartionInValidMsg.LABEL=Le champ de partition doit \u00eatre diff\u00e9rent des autres champs pr\u00e9dictifs
InputFieldConstantMsg.LABEL=Un des champs pr\u00e9dicteurs contient une seule valeur.
InvalidSettingsErrorMsg.LABEL=Param\u00e8tres d''algorithme du composant non valides
NoValidFieldValuesErrorMsg.LABEL=Les champs des m\u00e9tadonn\u00e9es n''ont pas d\u00e9fini de valeurs valides
PreparedDataHandleMsg.LABEL=Pr\u00e9paration du traitement des donn\u00e9es termin\u00e9e
HandleDataProcessMsg.LABEL=Processus de traitement des donn\u00e9es\u00a0: {0 } %
HandleDataProcessEndMsg.LABEL=Processus de traitement des donn\u00e9es\u00a0termin\u00e9
ExportPmmlProgressMsg.LABEL=Exportation du mod\u00e8le vers le fichier PMML termin\u00e9e
kMCCANCEL.LABEL=L''analyse a \u00e9t\u00e9 abandonn\u00e9e suite \u00e0 une demande d''annulation.
kMC_IO_ERROR.LABEL=Une erreur E/S s''est produite.
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=La limite de m\u00e9moire a \u00e9t\u00e9 d\u00e9pass\u00e9e.
kMC_INVALID_SAVE_STATE.LABEL=La commande saveState() a \u00e9t\u00e9 lanc\u00e9e \u00e0 un moment o\u00f9 elle ne pouvait pas \u00eatre ex\u00e9cut\u00e9e. Essayez de la lancer \u00e0 un meilleur moment.
kMC_FAILED_RESTART.LABEL=Le red\u00e9marrage a \u00e9chou\u00e9 pour une raison inconnue. Impossible d''effectuer une action quelconque pour le moment
kMC_WRONG_STATE.LABEL=Une commande (autre que saveState) a \u00e9t\u00e9 lanc\u00e9e \u00e0 un moment inappropri\u00e9. Ce n''est g\u00e9n\u00e9ralement pas fatal. Essayez de lancer les commandes dans le bon ordre. 
#Cognos specific errors & warnings
#Connect and Login error,ErrorCode = [1-100]
kCOGNOS_Connection_Failed.LABEL=Echec de la connexion au serveur Cognos Analytics.
kCOGNOS_Connection_Maleformed_URL.LABEL=Une URL malform\u00e9e a \u00e9t\u00e9 utilis\u00e9e pour acc\u00e9der au serveur Cognos Analytics. 
kCOGNOS_Logon_Failed.LABEL=Echec de la connexion au serveur Cognos Analytics. 
kCOGNOS_Connection_Invalid_ID.LABEL=Un ID de connexion non valide a \u00e9t\u00e9 utilis\u00e9.
kCOGNOS_Anonymous_Access_Deny.LABEL=Acc\u00e8s anonyme refus\u00e9.
kCOGNOS_Server_URL_Error.LABEL=Une URL non valide a \u00e9t\u00e9 utilis\u00e9e pour acc\u00e9der au serveur Cognos Analytics.
kCOGNOS_Host_Not_Found.LABEL=Impossible de trouver l''h\u00f4te.
kCOGNOS_Connect_Refused.LABEL=Connexion refus\u00e9e. Veuillez v\u00e9rifier l''URI du serveur Cognos.
kCOGNOS_Invalid_Namespace.LABEL=Espace de nom sp\u00e9cifi\u00e9 non valide.
kCOGNOS_Invalid_Credential.LABEL=Nom d''utilisateur inconnu ou mot de passe incorrect.
	
#Query Cognos server content error
kCOGNOS_Invalid_Package_Name.LABEL=Nom de pack non valide, car il contient \u00e0 la fois des guillemets (\") et une apostrophe ('').
kCOGNOS_Invalid_Type.LABEL=L''objet s\u00e9lectionn\u00e9 n''est pas un pack ni un dossier.
kCOGNOS_Invalid_Path.LABEL=Le pack ou le dossier s\u00e9lectionn\u00e9 n''existe pas.
kCOGNOS_Query_Object_Fail.LABEL=\u00c9chec du stockage du contenu de la requ\u00eate. \n{0}
kCOGNOS_Construct_Dom_Fail.LABEL=Echec de construction de l''objet Dom.

#Render report error
kCOGNOS_Render_Report_Failed.LABEL=\u00c9chec de la restitution des sp\u00e9cifications du rapport.
kCOGNOS_Get_Metadata_Failed.LABEL=Impossible d''obtenir les m\u00e9tadonn\u00e9es du pack s\u00e9lectionn\u00e9.
kCOGNOS_Missing_Parameter.LABEL=L''importation a \u00e9chou\u00e9 : aucune valeur valide n''a \u00e9t\u00e9 fournie pour le param\u00e8tre {0}
kCOGNOS_Invalid_Parameter_Value.LABEL=L''importation a \u00e9chou\u00e9 : le type valide pour le param\u00e8tre {0} est {1}
kCOGNOS_Get_Report_Output_Fail.LABEL=Impossible d''obtenir la sortie du rapport aupr\u00e8s du serveur Cognos Analytics.
kCOGNOS_Param_Input_Not_Enough.LABEL=L''importation a \u00e9chou\u00e9, certains param\u00e8tres sont manquants et les valeurs de certains param\u00e8tre sont non valides.
kCOGNOS_Create_Report_Fail.LABEL=\u00c9chec de la cr\u00e9ation des sp\u00e9cifications du rapport.
kCOGNOS_Render_Response_Fail.LABEL=Impossible de restituer la r\u00e9ponse renvoy\u00e9e par le serveur Cognos Analytics.
kCOGNOS_Query_Report_Spec_Fail.LABEL=Impossible d''interroger les sp\u00e9cifications du rapport sur le serveur Cognos Analytics.
kCOGNOS_Read_Data_Fail.LABEL=Echec de lecture des donn\u00e9es dans le fichier joint. \n{0}
kCOGNOS_Get_Parameters_Fail.LABEL=Echec d''obtention des param\u00e8tres. \n{0}
kCOGNOS_Unknown_Output_Format.LABEL=Format inconnu pour le fichier joint.
kCOGNOS_Incorrect_Parameter.LABEL=L''importation a \u00e9chou\u00e9 - les valeurs \u00e9taient incorrectes pour les param\u00e8tres {0}.

#Publish package error
kCOGNOS_Publish_Package_Fail.LABEL=\u00c9chec de la publication du pack.
kCOGNOS_Data_Source_Error.LABEL=Erreur de la source de donn\u00e9es Cognos, v\u00e9rifiez les param\u00e8tres de connexion de la source de donn\u00e9es du serveur Cognos Analytics.
kCOGNOS_Access_Data_Fail.LABEL=La source de donn\u00e9es Cognos ne peut pas trouver la table export\u00e9e. \n V\u00e9rifiez que les donn\u00e9es d''identification et la base de donn\u00e9es sp\u00e9cifi\u00e9es dans la source de donn\u00e9es ODBC sont identiques \u00e0 celles qui se trouvent dans la source de donn\u00e9es Cognos s\u00e9lectionn\u00e9e.

#Get metadata error
kCOGNOS_Get_Report_Metadata_Fail.LABEL=Echec d''obtention des m\u00e9tadonn\u00e9es du rapport.
kCOGNOS_Parse_Metadata_Fail.LABEL=Les \u00e9l\u00e9ments s\u00e9lectionn\u00e9s par l''utilisateur sont introuvables. \n{0}

#Common error
kCOGNOS_Parse_Xml_Fail.LABEL=Echec d''analyse des m\u00e9tadonn\u00e9es du rapport. \n{0}
kCOGNOS_Get_Datasource_Fail.LABEL=Echec d''obtention des sources de donn\u00e9es du serveur Cognos Analytics. \n{0}
kCOGNOS_Construct_XML_FROM_DOM_Fail.LABEL=Echec de la construction de la cha\u00eene XML \u00e0 partir du mod\u00e8le DOM. \n{0}
kCOGNOS_Unknown_Error.LABEL=Erreur inconnue. {0}

#JVM error
kCOGNOS_Open_JVM_Fail.LABEL=Erreur interne. Impossible d''ouvrir Java VM.
kCOGNOS_Close_JVM_Fail.LABEL=Erreur interne. Echec de fermeture de la machine virtuelle Java.
kCOGNOS_Invalid_Class_Path.LABEL=Erreur interne. Chemin de classe sp\u00e9cifi\u00e9 non valide.
kCOGNOS_Miss_Classloader.LABEL=Erreur interne. Impossible de trouver le chargeur de classe requis.
kCOGNOS_Load_Classloader_Fail.LABEL=Erreur interne. \u00c9chec du chargement du chargeur de classe.
kCOGNOS_Init_Classloader_Fail.LABEL=Erreur interne. Echec de l''initialisation du chargeur de classe.
kCOGNOS_Miss_Java_Interface.LABEL=Erreur interne. Impossible de trouver l''interface Java requise.
kCOGNOS_Load_Java_Interface_Fail.LABEL=Erreur interne. \u00c9chec du chargement de l''interface Java.
kCOGNOS_Init_Java_Interface_Fail.LABEL=Erreur interne. \u00c9chec de l''initialisation de l''interface Java.
kCOGNOS_Miss_Interface_Method.LABEL=Erreur interne. La m\u00e9thode {0} est introuvable.
