#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: Modeler Common
# *
# * (C) Copyright IBM Corp. 1994, 2011
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_ALL

#cognosImporter=Cognos Import
#cognosExporter=Cognos Export

# Property resources key
cognos_server_url=URL de servidor de Cognos
cognos_login_mode=Modo
cognos_namespace=Espacio de nombres
cognos_user_name=Nombre de usuario
cognos_password=Contrase\u00f1a

#Components common errors & warnings
unknownErrorMsg.LABEL=Error interno (desconocido)
initErrMsg.LABEL=Error de inicializaci\u00f3n
inputErrMsg.LABEL=Error al leer los datos de entrada
internalErrMsg.LABEL=Error interno
invalidMetadataErrMsg.LABEL=Metadatos (en campos de entrada/salida) no v\u00e1lidos
fileNotExistErrorMsg.LABEL=El archivo de datos no existe
storageNotSupportErrorMsg.LABEL=La integraci\u00f3n no admite este tipo de almacenamiento de datos
invalidTargetErrorMsg.LABEL=Ajuste de variable de objetivo no v\u00e1lido
invalidTarResponseErrorMsg.LABEL=Ajuste de variable de respuesta de objetivo no v\u00e1lido
predictorsEmptyErrMsg.LABEL=El ajuste de los predictores no debe estar vac\u00edo
targetAsInputErrorMsg.LABEL=El campo de objetivo no puede ser una entrada
invalidFrequencyErrorMsg.LABEL=El campo de frecuencia no puede ser una entrada
invalidTargetResponseErrorMsg.LABEL=El campo de respuesta de objetivo no puede ser una entrada
invlidResponseCatErrorMsg.LABEL=La variable de respuesta de objetivo debe ser una marca
noFrequencyErrorMsg.LABEL=No se ha seleccionado ning\u00fan campo de frecuencia
noTargetErrorMsg.LABEL=No se han especificado valores de campo de objetivo
invalidtarValueMsg.LABEL=Se ha especificado un valor de campo de objetivo no v\u00e1lido
getfilePathMsg.LABEL=Error interno (obtener archivo)
creationAlgorithmMsg.LABEL=Error interno (algoritmo)
buildModelErrorMsg.LABEL=Error interno (creaci\u00f3n de componente)
assessModelErrorMsg.LABEL=Error interno (evaluaci\u00f3n de componente)
exportPMLLErrorMsg.LABEL=Error interno (exportaci\u00f3n PMML de componente)
getDataFieldErrorMsg.LABEL=Error interno (obtener modelo de datos)
tarResIsSameErrorMsg.LABEL=La variable de objetivo, la variable de respuesta de objetivo, la variable de ponderaci\u00f3n y la variable de partici\u00f3n deben ser diferentes
NoTargetFieldErrorMsg.LABEL=No se ha seleccionado ning\u00fan campo de objetivo
NoTargetResFieldErrorMsg.LABEL=No se ha seleccionado ning\u00fan campo de respuesta de objetivo
targetResTrueErrorMsg.LABEL=El ajuste del valor de respuesta de objetivo verdadero no es v\u00e1lido
PMMLNotExistErrorMsg.LABEL=Error interno (falta PMML)
PMMLIsInvalidErrorMsg.LABEL=Error interno (PMML no v\u00e1lido)
NoPredVarInPMMLErrorMsg.LABEL=Error interno (no hay ninguna variable predictora en el archivo PMML)
PMMLNotMatchDataErrorMsg.LABEL=Error interno (directorio PMML)
getDataSourceErrorMsg.LABEL=Error interno (obtener origen de datos)
dataFileISValidErrorMsg.LABEL=Los datos de entrada no incluyen los campos de predictor que requiere el modelo
TarFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen un campo de objetivo que requiere el modelo
TRFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen un campo de respuesta de objetivo que requiere el modelo
FreFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen un campo de frecuencia que requiere el modelo
InputFieldNOTMatchMsg.LABEL=Los datos de entrada no incluyen campos que requiere el modelo
NoValidRecordsMsg.LABEL=No hay registros v\u00e1lidos para la creaci\u00f3n del modelo
NoRecordsScoringMsg.LABEL=No hay registros v\u00e1lidos para la puntuaci\u00f3n
PartionInValidMsg.LABEL=El campo de partici\u00f3n debe ser diferente del resto de campos predictivos
InputFieldConstantMsg.LABEL=Uno de los campos de predictor contiene un solo valor
InvalidSettingsErrorMsg.LABEL=Ajustes de algoritmo de componente no v\u00e1lidos
NoValidFieldValuesErrorMsg.LABEL=Los campos de los metadatos no defin\u00edan valores v\u00e1lidos
PreparedDataHandleMsg.LABEL=Preparaci\u00f3n de gesti\u00f3n de datos completada
HandleDataProcessMsg.LABEL=Proceso de datos de identificaci\u00f3n : {0 } %
HandleDataProcessEndMsg.LABEL=Proceso de gesti\u00f3n de datos completado
ExportPmmlProgressMsg.LABEL=Exportaci\u00f3n de modelo a archivo PMML completado
kMCCANCEL.LABEL=Se cancel\u00f3 el an\u00e1lisis tras una solicitud de cancelaci\u00f3n
kMC_IO_ERROR.LABEL=Se ha producido un error de E/S
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Se ha sobrepasado el l\u00edmite de memoria
kMC_INVALID_SAVE_STATE.LABEL=El comando saveState() se introdujo cuando no se pod\u00eda ejecutar. Pruebe a introducirlo en otro momento.
kMC_FAILED_RESTART.LABEL=Error de reinicio por alguna raz\u00f3n. No se puede hacer nada al respecto ahora.
kMC_WRONG_STATE.LABEL=Un comando (diferente a saveState) se introdujo en un momento no adecuado. Esto no es insalvable habitualmente. Intente introducir los comandos en el orden adecuado. 
#Cognos specific errors & warnings
#Connect and Login error,ErrorCode = [1-100]
kCOGNOS_Connection_Failed.LABEL=No se ha podido conectar al servidor Cognos Analytics.
kCOGNOS_Connection_Maleformed_URL.LABEL=Se ha utilizado un URL malformado para acceder al servidor Cognos Analytics. 
kCOGNOS_Logon_Failed.LABEL=No se ha podido iniciar sesi\u00f3n en Cognos Analytics Server. 
kCOGNOS_Connection_Invalid_ID.LABEL=Se ha usado una ID de conexi\u00f3n no v\u00e1lida.
kCOGNOS_Anonymous_Access_Deny.LABEL=Se ha denegado un acceso an\u00f3nimo.
kCOGNOS_Server_URL_Error.LABEL=Se ha utilizado un URL no v\u00e1lido para acceder al servidor Cognos Analytics.
kCOGNOS_Host_Not_Found.LABEL=No se puede encontrar el host.
kCOGNOS_Connect_Refused.LABEL=Conexi\u00f3n rechazada. Compruebe la URI del servidor de Cognos.
kCOGNOS_Invalid_Namespace.LABEL=Espacio de nombre especificado no v\u00e1lido.
kCOGNOS_Invalid_Credential.LABEL=Nombre de usuario desconocido o contrase\u00f1a err\u00f3nea.
	
#Query Cognos server content error
kCOGNOS_Invalid_Package_Name.LABEL=Nombre de paquete no v\u00e1lido, ya que contiene tanto una comilla (\") como un ap\u00f3strofo ('').
kCOGNOS_Invalid_Type.LABEL=El objeto seleccionado no es un paquete o una carpeta.
kCOGNOS_Invalid_Path.LABEL=El paquete o la carpeta seleccionados no existen.
kCOGNOS_Query_Object_Fail.LABEL=Error al consultar el almac\u00e9n de contenido. \n{0}
kCOGNOS_Construct_Dom_Fail.LABEL=Error al crear el objeto Dom.

#Render report error
kCOGNOS_Render_Report_Failed.LABEL=Error al representar la especificaci\u00f3n de informe.
kCOGNOS_Get_Metadata_Failed.LABEL=No se han podido obtener los metadatos del paquete seleccionado.
kCOGNOS_Missing_Parameter.LABEL=Error de importaci\u00f3n. No se ha proporcionado un valor(s) v\u00e1lido para el par\u00e1metro {0}
kCOGNOS_Invalid_Parameter_Value.LABEL=Error de importaci\u00f3n. El tipo v\u00e1lido del par\u00e1metro {0} es {1}
kCOGNOS_Get_Report_Output_Fail.LABEL=No se puede obtener una salida de informe del servidor Cognos Analytics.
kCOGNOS_Param_Input_Not_Enough.LABEL=Error de importaci\u00f3n. Faltan algunos par\u00e1metros y algunos de los valores del par\u00e1metro no son v\u00e1lidos
kCOGNOS_Create_Report_Fail.LABEL=Error al crear las especificaciones del informe.
kCOGNOS_Render_Response_Fail.LABEL=No se puede representar la respuesta devuelta del servidor Cognos Analytics.
kCOGNOS_Query_Report_Spec_Fail.LABEL=No se puede consultar la especificaci\u00f3n del informe en el servidor Cognos Analytics.
kCOGNOS_Read_Data_Fail.LABEL=Error de lectura de datos del archivo adjunto. \n{0}
kCOGNOS_Get_Parameters_Fail.LABEL=Error al obtener los par\u00e1metros. \n{0}
kCOGNOS_Unknown_Output_Format.LABEL=Archivo adjunto con formato desconocido.
kCOGNOS_Incorrect_Parameter.LABEL=Error de importaci\u00f3n - Valores incorrectos para los par\u00e1metros {0}

#Publish package error
kCOGNOS_Publish_Package_Fail.LABEL=Error al publicar el paquete.
kCOGNOS_Data_Source_Error.LABEL=Error de origen de datos Cognos, compruebe la configuraci\u00f3n de la conexi\u00f3n del origen de datos del servidor Cognos Analytics.
kCOGNOS_Access_Data_Fail.LABEL=El origen de datos de Cognos no puede encontrar la tabla exportada. \n Compruebe que tanto las credenciales como la base de datos en el origen de datos ODBC son las mismas que en el origen de datos de Cognos seleccionado.

#Get metadata error
kCOGNOS_Get_Report_Metadata_Fail.LABEL=Error al obtener los metadatos del informe.
kCOGNOS_Parse_Metadata_Fail.LABEL=Error al encontrar los elementos seleccionados del usuario. \n{0}

#Common error
kCOGNOS_Parse_Xml_Fail.LABEL=Error al analizar los metadatos del informe.\n{0}
kCOGNOS_Get_Datasource_Fail.LABEL=No se han podido obtener or\u00edgenes de datos del servidor Cognos Analytics.\n{0}
kCOGNOS_Construct_XML_FROM_DOM_Fail.LABEL=Error al crear la cadena XML a partir de DOM.\n{0}
kCOGNOS_Unknown_Error.LABEL=Error desconocido. {0}

#JVM error
kCOGNOS_Open_JVM_Fail.LABEL=Error interno. No se ha podido abrir Java VM.
kCOGNOS_Close_JVM_Fail.LABEL=Error interno. Error al cerrar Java VM.
kCOGNOS_Invalid_Class_Path.LABEL=Error interno. Ruta de clase especificada no v\u00e1lida.
kCOGNOS_Miss_Classloader.LABEL=Error interno. No se encuentra el cargador de clases solicitado.
kCOGNOS_Load_Classloader_Fail.LABEL=Error interno. Error al cargar el cargador de clase.
kCOGNOS_Init_Classloader_Fail.LABEL=Error interno. Error al inicializar el cargador de clases.
kCOGNOS_Miss_Java_Interface.LABEL=Error interno. No se puede encontrar la interfaz de Java obligatoria.
kCOGNOS_Load_Java_Interface_Fail.LABEL=Error interno. Error al cargar la interfaz de Java.
kCOGNOS_Init_Java_Interface_Fail.LABEL=Error interno. Error al inicializar la interfaz de Java.
kCOGNOS_Miss_Interface_Method.LABEL=Error interno. No se ha encontrado el m\u00e9todo {0}.
