#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: Modeler Common
# *
# * (C) Copyright IBM Corp. 1994, 2013
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_NONE

#tm1Importer=TM1 Import
#tm1Exporter=TM1 Export

# Property resources key
tm1_admin_host_name=Nome do Host Administrativo
tm1_server_name=Nome do TM1 Server
tm1_use_namespace=Usar Namespace
tm1_login_mode=Modo
tm1_namespace=Namespace
tm1_user_name=Nome de usu\u00e1rio
tm1_password=Senha

#TM1 specific errors & warnings
kTM1_Invalid_Module_Handle.LABEL
kTM1_Invalid_JNI_Handle.LABEL
kTM1_Empty_DataModel.LABEL
kTM1_Create_Tempfile_Failed.LABEL=Falha ao criar arquivo tempor\u00e1rio.
kTM1_Remove_Tempfile_Failed.LABEL=Falha ao remover arquivo tempor\u00e1rio.
kTM1_Missing_Coordinator.LABEL=Todas as dimens\u00f5es sem medida no cubo de destino devem ser mapeadas para o campo SPSS ou ter uma fatia de membro definida.
kTM1_Missing_Elements.LABEL=Deve-se mapear pelo menos um campo SPSS para um elemento existente ou de nova medida no cubo de destino.
kTM1_No_Element_Selected.LABEL=Nenhuma medida realmente selecionada.
kTM1_Unsupported_Element_Type.LABEL=O campo {0} possui um tipo inv\u00e1lido {1} para exportar para o TM1, somente sequ\u00eancia de caracteres e n\u00fameros s\u00e3o v\u00e1lidos no TM1.
kTM1_Novalue_Received.LABEL=Nenhum valor recebido para exportar para o TM1.
kTM1_Allvalue_Excluded.LABEL=Todos os valores foram exclu\u00eddos antes da exporta\u00e7\u00e3o para o TM1.
kTM1_Illegal_URL.LABEL=A URL usada para conectar ao sistema PM est\u00e1 incorreta.
kTM1_Http_Exception.LABEL=Ocorreu uma exce\u00e7\u00e3o de HTTP ao acessar {0}, erro detalhado: {1}
kTM1_Connect_Exception.LABEL=Ocorreu uma exce\u00e7\u00e3o de rede ao acessar {0}, erro detalhado: {1}
kTM1_Moved_Permanently.LABEL=O recurso {0} n\u00e3o pode ser localizado, erro detalhado: {1}
kTM1_See_Other.LABEL=O recurso {0} n\u00e3o pode ser localizado, erro detalhado: {1}
kTM1_Not_Modified.LABEL=O recurso {0} n\u00e3o pode ser localizado, erro detalhado: {1}
kTM1_Temporary_Redirect.LABEL=O recurso {0} n\u00e3o pode ser localizado, erro detalhado: {1}
kTM1_Bad_Request.LABEL=Erro interno, solicita\u00e7\u00e3o inv\u00e1lida para o recurso {0}, erro detalhado: {1}
kTM1_Unauthorized.LABEL=Nome de usu\u00e1rio ou senha inv\u00e1lida.
kTM1_Forbidden.LABEL=O acesso ao recurso {0} \u00e9 proibido, erro detalhado: {1}
kTM1_Not_Found.LABEL=O recurso {0} n\u00e3o foi localizado, erro detalhado: {1}
kTM1_Method_Not_Allowed.LABEL=Erro interno, as opera\u00e7\u00f5es solicitadas para o recurso {0} n\u00e3o s\u00e3o permitidas, erro detalhado: {1}
kTM1_Conflict.LABEL=Erro interno, o recurso {0} existe, erro detalhado: {1}
kTM1_Internal_Server_Error.LABEL=Erro relatado pelo TM1 ao acessar o recurso {0}, erro detalhado: {1}
kTM1_Not_Implemented.LABEL=A opera\u00e7\u00e3o necess\u00e1ria no recurso {0} n\u00e3o foi implementada, erro detalhado: {1}
kTM1_Bad_Gateway.LABEL=Gateway inv\u00e1lido usado ao acessar o TM1, erro detalhado: {1}
kTM1_Login_Info_Error.LABEL=Erro interno, falha ao construir credencial de login, erro detalhado: {1}
kTM1_Parse_Property_Error.LABEL=Erro interno, falha ao analisar propriedades para o recurso {0}, erro detalhado: {1}
kTM1_Resource_Property_Exception.LABEL=Erro interno, falha ao serializar as propriedades do recurso, erro detalhado: {0}
kTM1_Column_Count_Error.LABEL=Mais de uma dimens\u00e3o da coluna foi especificada para a visualiza\u00e7\u00e3o {0}. Somente uma dimens\u00e3o da coluna \u00e9 permitida para importar.
kTM1_Not_Connected.LABEL=Erro interno, n\u00e3o conectado ao hub do TM1 PM.
kTM1_Server_Not_Found.LABEL=Servidor {0} n\u00e3o localizado. Atualize a lista de servidores.
kTM1_Cube_Not_Found.LABEL=Cubo {0} n\u00e3o localizado. Atualize a lista de visualiza\u00e7\u00e3o do cubo.
kTM1_Dimension_Not_Found.LABEL=Dimens\u00e3o {0} n\u00e3o localizada.
kTM1_View_Not_Found.LABEL=Visualiza\u00e7\u00e3o {0} n\u00e3o localizada. Atualize a lista de visualiza\u00e7\u00e3o do cubo.
kTM1_Process_Not_Found.LABEL=Erro interno, processo {0} n\u00e3o localizado. Entre em contato com o administrador do TM1 para obter ajuda.
kTM1_Subset_Not_Found.LABEL=Subconjunto {0} n\u00e3o localizado.
kTM1_Hierarchy_Not_Found.LABEL=Hierarquia {0} n\u00e3o localizada.
kTM1_Element_Not_Found.LABEL=Elemento {0} n\u00e3o localizado.
kTM1_File_Not_Found.LABEL=Erro interno, arquivo {0} n\u00e3o localizado.
kTM1_Namespace_Not_Found.LABEL=Namespace do servidor {0} n\u00e3o localizado.
kTM1_Protocol_Exception.LABEL=N\u00e3o foi poss\u00edvel conectar ao host especificado na URL do PM System.
kTM1_PMSystem_Exception.LABEL=A conex\u00e3o com o servidor do PM System falhou.
kTM1_PMSystem_Not_Found.LABEL=O PM System especificado n\u00e3o foi localizado no servidor especificado.
kTM1_String_Parse_Failed.LABEL=Valores de sequ\u00eancia de caracteres de c\u00e9lulas que n\u00e3o puderam ser convertidos para um valor num\u00e9rico foram importados como o valor omisso do sistema.
kTM1_Process_Has_Minor_Errors.LABEL=A execu\u00e7\u00e3o do processo falhou parcialmente. Verifique a mensagem de erro no servidor do TM1.

#JVM error
kTM1_Open_JVM_Fail.LABEL=Erro interno. Falha em abrir a VM Java.
kTM1_Close_JVM_Fail.LABEL=Erro interno. Falha em fechar a VM Java.
kTM1_Invalid_Class_Path.LABEL=Erro interno. Caminho de classe inv\u00e1lido especificado.
kTM1_Miss_Classloader.LABEL=Erro interno. N\u00e3o \u00e9 poss\u00edvel encontrar o carregador de classes solicitado.
kTM1_Load_Classloader_Fail.LABEL=Erro interno. Falha em carregar o carregador de classes.
kTM1_Init_Classloader_Fail.LABEL=Erro interno. Falha em inicializar o carregador de classes.
kTM1_Miss_Java_Interface.LABEL=Erro interno. N\u00e3o \u00e9 poss\u00edvel encontrar a interface de Java solicitada.
kTM1_Load_Java_Interface_Fail.LABEL=Erro interno. Falha em carregar a interface de Java.
kTM1_Init_Java_Interface_Fail.LABEL=Erro interno. Falha em inicializar a interface de Java.
kTM1_Miss_Interface_Method.LABEL=Erro interno. N\u00e3o \u00e9 poss\u00edvel encontrar um m\u00e9todo {0}.
kTM1_Miss_Diminfo_Interface.LABEL=Erro interno. Falha em carregar a interface DimensionInfo.
kTM1_Miss_Dimelement_Interface.LABEL=Erro interno. Falha em carregar a interface ElementInfo.
kTM1_Miss_Diminfo_Method.LABEL=Erro interno. Falha em localizar o m\u00e9todo DimensionInfo.{0}.
kTM1_Get_DimName_Failed.LABEL=Erro interno. Falha ao obter o nome da dimens\u00e3o.
kTM1_Get_DimElements_Failed.LABEL=Erro interno. Falha ao obter os elementos de dimens\u00e3o.
kTM1_Miss_DimElement_Method.LABEL=Erro interno. Falha em localizar o m\u00e9todo ElementInfo.{0}.
kTM1_Get_ElementName_Failed.LABEL=Erro interno. Falha ao obter o nome de elemento.

kTM1_System_Exception.LABEL=Erro interno. Detalhe do erro : {0}
kTM1_Unknow.LABEL=Erro desconhecido. Detalhe do erro : {0}
