#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: Modeler Common
# *
# * (C) Copyright IBM Corp. 1994, 2013
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
# NLS_ENCODING=UNICODE
# NLS_MESSAGEFORMAT_NONE

#tm1Importer=TM1 Import
#tm1Exporter=TM1 Export

# Property resources key
tm1_admin_host_name=Nom d'h\u00f4te admin
tm1_server_name=Nom du serveur TM1
tm1_use_namespace=Utiliser un espace de nom
tm1_login_mode=Mode
tm1_namespace=Espace de nom
tm1_user_name=Nom d'utilisateur
tm1_password=Mot de passe

#TM1 specific errors & warnings
kTM1_Invalid_Module_Handle.LABEL
kTM1_Invalid_JNI_Handle.LABEL
kTM1_Empty_DataModel.LABEL
kTM1_Create_Tempfile_Failed.LABEL=Echec de la cr\u00e9ation du fichier temporaire.
kTM1_Remove_Tempfile_Failed.LABEL=Echec de la suppression du fichier temporaire.
kTM1_Missing_Coordinator.LABEL=Toutes les dimensions autres que de type mesure dans le cube cible doivent \u00eatre mapp\u00e9es vers le champ SPSS ou avoir une limite de membres d\u00e9finie.
kTM1_Missing_Elements.LABEL=Vous devez mapper au moins un champ SPSS vers un \u00e9l\u00e9ment de mesure nouveau ou existant dans le cube cible.
kTM1_No_Element_Selected.LABEL=Aucune mesure s\u00e9lectionn\u00e9e.
kTM1_Unsupported_Element_Type.LABEL=Le type {1} du champ {0} n'est pas valide pour une exportation vers TM1 ; seules les cha\u00eenes et les valeurs num\u00e9riques sont admises dans TM1.
kTM1_Novalue_Received.LABEL=Aucune valeur re\u00e7ue pour une exportation vers TM1.
kTM1_Allvalue_Excluded.LABEL=Toutes les valeurs ont \u00e9t\u00e9 exclues avant l'exportation vers TM1.
kTM1_Illegal_URL.LABEL=L'URL utilis\u00e9e pour la connexion au syst\u00e8me PM est incorrecte.
kTM1_Http_Exception.LABEL=Une exception HTTP s'est produite lors de l'acc\u00e8s \u00e0 {0}. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Connect_Exception.LABEL=Une exception de r\u00e9seau s'est produite lors de l'acc\u00e8s \u00e0 {0}. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Moved_Permanently.LABEL=La ressource {0} est introuvable. Erreur d\u00e9taill\u00e9e : {1}
kTM1_See_Other.LABEL=La ressource {0} est introuvable. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Not_Modified.LABEL=La ressource {0} est introuvable. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Temporary_Redirect.LABEL=La ressource {0} est introuvable. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Bad_Request.LABEL=Erreur interne, demande incorrecte envoy\u00e9e \u00e0 la ressource {0}. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Unauthorized.LABEL=Nom d'utilisateur ou mot de passe non valide.
kTM1_Forbidden.LABEL=L'acc\u00e8s \u00e0 la ressource {0} est interdit. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Not_Found.LABEL=La ressource {0} est introuvable. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Method_Not_Allowed.LABEL=Erreur interne, les op\u00e9rations demand\u00e9es pour la ressource {0} ne sont pas autoris\u00e9es. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Conflict.LABEL=Erreur interne, la ressource {0} existe. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Internal_Server_Error.LABEL=Erreur signal\u00e9e par TM1 lors de l'acc\u00e8s \u00e0 la ressource {0}. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Not_Implemented.LABEL=L'op\u00e9ration requise sur la ressource {0} n'est pas mise en oeuvre. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Bad_Gateway.LABEL=Une passerelle incorrecte a \u00e9t\u00e9 utilis\u00e9e lors de l'acc\u00e8s \u00e0 TM1. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Login_Info_Error.LABEL=Erreur interne, \u00e9chec de la cr\u00e9ation des donn\u00e9es d'identification et de connexion. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Parse_Property_Error.LABEL=Erreur interne, \u00e9chec de l'analyse des propri\u00e9t\u00e9s pour la ressource {0}. Erreur d\u00e9taill\u00e9e : {1}
kTM1_Resource_Property_Exception.LABEL=Erreur interne, \u00e9chec de la s\u00e9rialisation des propri\u00e9t\u00e9s de ressource. Erreur d\u00e9taill\u00e9e : {0}
kTM1_Column_Count_Error.LABEL=Plusieurs dimensions de colonne sont indiqu\u00e9es pour la vue {0}. Une seule dimension de colonne est autoris\u00e9e pour l'importation.
kTM1_Not_Connected.LABEL=Erreur interne, pas de connexion au hub PM TM1.
kTM1_Server_Not_Found.LABEL=Serveur {0} introuvable. Actualisez la liste des serveurs.
kTM1_Cube_Not_Found.LABEL=Cube {0} introuvable. Actualisez la liste des vues de cube.
kTM1_Dimension_Not_Found.LABEL=Dimension {0} introuvable.
kTM1_View_Not_Found.LABEL=Vue {0} introuvable. Actualisez la liste des vues de cube.
kTM1_Process_Not_Found.LABEL=Erreur interne, processus {0} introuvable. Contactez l'administrateur TM1 si vous avez besoin d'aide.
kTM1_Subset_Not_Found.LABEL=Sous-ensemble {0} introuvable.
kTM1_Hierarchy_Not_Found.LABEL=Hi\u00e9rarchie {0} introuvable.
kTM1_Element_Not_Found.LABEL=El\u00e9ment {0} introuvable.
kTM1_File_Not_Found.LABEL=Erreur interne, fichier {0} introuvable.
kTM1_Namespace_Not_Found.LABEL=Espace de nom du serveur {0} introuvable.
kTM1_Protocol_Exception.LABEL=Impossible de se connecter \u00e0 l'h\u00f4te sp\u00e9cifi\u00e9 dans l'URL du syst\u00e8me PM.
kTM1_PMSystem_Exception.LABEL=La connexion au serveur du syst\u00e8me PM a \u00e9chou\u00e9.
kTM1_PMSystem_Not_Found.LABEL=Le syst\u00e8me PM est introuvable sur le serveur sp\u00e9cifi\u00e9.
kTM1_String_Parse_Failed.LABEL=Les valeurs de cha\u00eenes des cellules n'ayant pas pu \u00eatre converties en valeur num\u00e9rique ont \u00e9t\u00e9 import\u00e9es comme valeur syst\u00e8me manquante.
kTM1_Process_Has_Minor_Errors.LABEL=L'ex\u00e9cution du processus a partiellement \u00e9chou\u00e9. V\u00e9rifiez le message d'erreur sur le serveur TM1.

#JVM error
kTM1_Open_JVM_Fail.LABEL=Erreur interne. Impossible d'ouvrir Java VM.
kTM1_Close_JVM_Fail.LABEL=Erreur interne. Echec de fermeture de la machine virtuelle Java.
kTM1_Invalid_Class_Path.LABEL=Erreur interne. Chemin de classe sp\u00e9cifi\u00e9 non valide.
kTM1_Miss_Classloader.LABEL=Erreur interne. Impossible de trouver le chargeur de classe requis.
kTM1_Load_Classloader_Fail.LABEL=Erreur interne. \u00c9chec du chargement du chargeur de classe.
kTM1_Init_Classloader_Fail.LABEL=Erreur interne. Echec de l'initialisation du chargeur de classe.
kTM1_Miss_Java_Interface.LABEL=Erreur interne. Impossible de trouver l'interface Java requise.
kTM1_Load_Java_Interface_Fail.LABEL=Erreur interne. \u00c9chec du chargement de l'interface Java.
kTM1_Init_Java_Interface_Fail.LABEL=Erreur interne. \u00c9chec de l'initialisation de l'interface Java.
kTM1_Miss_Interface_Method.LABEL=Erreur interne. La m\u00e9thode {0} est introuvable.
kTM1_Miss_Diminfo_Interface.LABEL=Erreur interne. Echec du chargement de l'interface DimensionInfo.
kTM1_Miss_Dimelement_Interface.LABEL=Erreur interne. Echec du chargement de l'interface ElementInfo.
kTM1_Miss_Diminfo_Method.LABEL=Erreur interne. Impossible de trouver la m\u00e9thode DimensionInfo.{0}.
kTM1_Get_DimName_Failed.LABEL=Erreur interne. Impossible d'obtenir le nom de la dimension.
kTM1_Get_DimElements_Failed.LABEL=Erreur interne. Impossible d'obtenir les \u00e9l\u00e9ments de la dimension.
kTM1_Miss_DimElement_Method.LABEL=Erreur interne. Impossible de trouver la m\u00e9thode ElementInfo.{0}.
kTM1_Get_ElementName_Failed.LABEL=Erreur interne. Impossible d'obtenir le nom de l'\u00e9l\u00e9ment.

kTM1_System_Exception.LABEL=Erreur interne. D\u00e9tails de l'erreur : {0}
kTM1_Unknow.LABEL=Erreur inconnue. D\u00e9tails de l'erreur : {0}
