#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2009, 2013
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

npar=Pruebas no param\u00e9tricas
unknownErrorMsg.LABEL=Error interno (desconocido)
initErrMsg.LABEL=Fall\u00f3 la inicializaci\u00f3n
inputErrMsg.LABEL=Error al leer los datos de entrada
internalErrMsg.LABEL=Error interno
invalidMetadataErrMsg.LABEL=Los metadatos (en campos de entrada/salida) no son v\u00e1lidos
fileNotExistErrorMsg.LABEL=El archivo de datos no existe
storageNotSupportErrorMsg.LABEL=La integraci\u00f3n no admite este tipo de almacenamiento de datos
invalidTargetErrorMsg.LABEL=Ajuste de campo de objetivo no v\u00e1lido
invalidTarResponseErrorMsg.LABEL=Ajuste de respuesta de objetivo no v\u00e1lido
predictorsEmptyErrMsg.LABEL=El ajuste de los predictores no puede estar vac\u00edo
targetAsInputErrorMsg.LABEL=El campo de objetivo no puede ser una entrada
invalidFrequencyErrorMsg.LABEL=El campo de frecuencia no puede ser una entrada
invalidTargetResponseErrorMsg.LABEL=El campo de respuesta de objetivo no puede ser una entrada
invlidResponseCatErrorMsg.LABEL=El campo de respuesta de objetivo debe ser una marca
noFrequencyErrorMsg.LABEL=No se ha seleccionado un campo de frecuencia
noTargetErrorMsg.LABEL=No se ha especificado ning\u00fan valor de campo de objetivo
invalidtarValueMsg.LABEL=Valor de campo de objetivo no v\u00e1lido especificado
getfilePathMsg.LABEL=Error interno (obtener archivo)
creationAlgorithmMsg.LABEL=Error interno (algoritmo)
buildModelErrorMsg.LABEL=Error interno (creaci\u00f3n de componente)
assessModelErrorMsg.LABEL=Error interno (evaluaci\u00f3n de componente)
exportPMLLErrorMsg.LABEL=Error interno (exportaci\u00f3n PMML de componente)
getDataFieldErrorMsg.LABEL=Error interno (obtener modelo de datos)
tarResIsSameErrorMsg.LABEL=El objetivo, la respuesta de objetivo, la ponderaci\u00f3n y los campos de partici\u00f3n deben ser diferentes
NoTargetFieldErrorMsg.LABEL=No se ha seleccionado ning\u00fan campo objetivo.
NoTargetResFieldErrorMsg.LABEL=No se ha seleccionado ning\u00fan campo de respuesta de objetivo.
targetResTrueErrorMsg.LABEL=El valor verdadero de la respuesta de objetivo no es v\u00e1lido
PMMLNotExistErrorMsg.LABEL=Error interno (PMML perdido)
PMMLIsInvalidErrorMsg.LABEL=Error interno (PMML no v\u00e1lido)
NoPredVarInPMMLErrorMsg.LABEL=Error interno (no existe el campo predictor en el archivo PMML)
PMMLNotMatchDataErrorMsg.LABEL=Error interno (directorio PMML)
getDataSourceErrorMsg.LABEL=Error interno (obtener origen de datos)
dataFileISValidErrorMsg.LABEL=Los datos de entrada no incluyen los campos de predictor que requiere el modelo.
TarFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen el campo de objetivo que requiere el modelo.
TRFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen el campo de respuesta de objetivo que requiere el modelo.
FreFieldNOTMatchErrMsg.LABEL=Los datos de entrada no incluyen el campo de frecuencia que requiere el modelo.
InputFieldNOTMatchMsg.LABEL=Los datos de entrada no incluyen los campos que requiere el modelo.
NoValidRecordsMsg.LABEL=No hay ning\u00fan registro v\u00e1lido para la creaci\u00f3n de modelos
NoRecordsScoringMsg.LABEL=No hay registros v\u00e1lidos para la puntuaci\u00f3n
PartionInValidMsg.LABEL=El campo de partici\u00f3n debe ser diferente del resto de campos predictivos
InputFieldConstantMsg.LABEL=Uno de los campos de predictor s\u00f3lo contiene un valor
InvalidSettingsErrorMsg.LABEL=Ajustes de algoritmo de componente no v\u00e1lido
NoValidFieldValuesErrorMsg.LABEL=Los campos de metadatos no defin\u00edan valores v\u00e1lidos
kNPAR_NoTestCreated.LABEL=No se ha creado ninguna prueba
kNPAR_AllocatingBufferFault.LABEL=No se puede asignar el nuevo almacenamiento intermedio
kNPAR_NoValidRecords.LABEL=El origen de datos no tiene registros v\u00e1lidos
kNPAR_InValidMultiPassRecordIter.LABEL=Se ha especificado un iterador de datos no v\u00e1lido
kNPAR_OneVarSpecifiedForBothFrenquentVarAndOthers.LABEL=Se ha especificado un campo como la ponderaci\u00f3n de frecuencia y tambi\u00e9n como otro campo de prueba
kNPAR_HasIndependentVarsNotGroupVar.LABEL=El usuario ha especificado campos de prueba, pero no un campo de prueba para la prueba de muestras independientes
kNPAR_NotSpecifiedAnyVariables.LABEL=No se han especificado campos
kNPAR_SpecifiedVarNotInDataModule.LABEL=El usuario especificado no existe en los metadatos
kNPAR_MemoryLimitExceeded.LABEL= Se ha sobrepasado el l\u00edmite de memoria
kNPAR_RelatedTestContVarNotUsed.LABEL=Las variables de escala {0} no se pueden aplicar a las pruebas RELATED especificadas
kNPAR_RelatedTestOrdinalVarNotUsed.LABEL=Las variables ordinales {0} no se pueden aplicar a las pruebas RELATED especificadas
kNPAR_RelatedTestNominalVarNotUsed.LABEL=Las variables nominales {0} no se pueden aplicar a las pruebas RELATED especificadas
kNPAR_RelatedTestContVarNumNotSuitable.LABEL=Las pruebas relacionadas {0} no se pueden aplicar a las variables de escala puesto que el n\u00famero de variables de escala no cumple los requisitos de las pruebas
kNPAR_RelatedTestOrdinalVarNumNotSuitable.LABEL=Las pruebas relacionadas {0} no se pueden aplicar a variables ordinales porque el n\u00famero de variables ordinales no cumple los requisitos de las pruebas
kNPAR_RelatedTestNominalVarNumNotSuitable.LABEL=Las pruebas relacionadas {0} no se pueden aplicar a variables nominales porque el n\u00famero de variables nominales no cumple los requisitos de las pruebas
kNPAR_RelatedTestNoVarsForTheTests.LABEL=Las pruebas relacionadas {0} no se pueden aplicar porque no hay ninguna variable apropiada 
kNPAR_OneSampleContVarsForChisquare.LABEL=Las variables de escala {0} no se pueden aplicar para una prueba de chi-cuadrado de muestra
kNPAR_OneSampleNoVarsForTheTests.LABEL=No se puede aplicar pruebas de una muestra {0} porque no hay variables apropiadas
kNPAR_OneSampleCatVarsForTheContTests.LABEL=Las variables categ\u00f3ricas {0} no se pueden aplicar para pruebas de una muestra {1}
kNPAR_IndepTestNotCatGroupVar.LABEL=Las pruebas INDEPENDENT especificadas no se pueden aplicar porque la variable de grupo {0} no es una variable categ\u00f3rica
kNPAR_IndepTestCatVarsCantUse.LABEL=Las pruebas INDEPENDENT especificadas no se pueden aplicar en variables categ\u00f3ricas {0}
kNPAR_FreqWeightValueIsGreaterThanMaxVal.LABEL=Al menos un valor de la variable WEIGHT es demasiado grande para este procedimiento. El valor m\u00e1ximo permitido es 2147483647

