#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2009, 2012
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

adp=Pr\u00e9paration automatique des donn\u00e9es
unknownErrorMsg.LABEL=Erreur interne (inconnue)
initErrMsg.LABEL=\u00c9chec de l'initialisation
inputErrMsg.LABEL=Erreur lors de la lecture des donn\u00e9es d'entr\u00e9e
internalErrMsg.LABEL=Erreur interne
invalidMetadataErrMsg.LABEL=M\u00e9tadonn\u00e9es (dans les champs entr\u00e9e/sortie) non valides
fileNotExistErrorMsg.LABEL=Le fichier de donn\u00e9es n'existe pas
storageNotSupportErrorMsg.LABEL=L'int\u00e9gration ne prend pas en charge ce type de stockage de donn\u00e9es
invalidTargetErrorMsg.LABEL=Param\u00e8tre de variable cible non valide
invalidTarResponseErrorMsg.LABEL=Param\u00e8tre de variable de r\u00e9ponse cible non valide
predictorsEmptyErrMsg.LABEL=Le param\u00e8tre des pr\u00e9dicteurs ne doit pas \u00eatre vide
targetAsInputErrorMsg.LABEL=Le champ cible ne peut pas \u00eatre une entr\u00e9e.
invalidFrequencyErrorMsg.LABEL=Le champ de fr\u00e9quence ne peut pas \u00eatre une entr\u00e9e.
invalidTargetResponseErrorMsg.LABEL=Le champ de r\u00e9ponse cible ne peut pas \u00eatre une entr\u00e9e.
invlidResponseCatErrorMsg.LABEL=La variable de r\u00e9ponse cible doit \u00eatre un indicateur.
noFrequencyErrorMsg.LABEL=Aucun champ de fr\u00e9quence s\u00e9lectionn\u00e9
noTargetErrorMsg.LABEL=Aucune valeur de champ cible n'a \u00e9t\u00e9 sp\u00e9cifi\u00e9e
invalidtarValueMsg.LABEL=Valeur de champ cible sp\u00e9cifi\u00e9e non valide
getfilePathMsg.LABEL=Erreur interne (obtention du fichier)
creationAlgorithmMsg.LABEL=Erreur interne (algorithme)
buildModelErrorMsg.LABEL=Erreur interne (cr\u00e9ation du composant)
assessModelErrorMsg.LABEL=Erreur interne (\u00e9valuation du composant)
exportPMLLErrorMsg.LABEL=Erreur interne (exportation PMML du composant)
getDataFieldErrorMsg.LABEL=Erreur interne (obtention du mod\u00e8le de donn\u00e9es)
tarResIsSameErrorMsg.LABEL=La variable cible, la variable de r\u00e9ponse cible, la variable de pond\u00e9ration et la variable de partition doivent \u00eatre diff\u00e9rentes
NoTargetFieldErrorMsg.LABEL=Aucun champ cible s\u00e9lectionn\u00e9
NoTargetResFieldErrorMsg.LABEL=Aucun champ de r\u00e9ponse cible s\u00e9lectionn\u00e9
targetResTrueErrorMsg.LABEL=La valeur vraie du param\u00e8tre de r\u00e9ponse cible n\u2019est pas valide
PMMLNotExistErrorMsg.LABEL=Erreur interne (PMML manquant)
PMMLIsInvalidErrorMsg.LABEL=Erreur interne (PMML non valide)
NoPredVarInPMMLErrorMsg.LABEL=Erreur interne (aucune variable de pr\u00e9dicteur dans le fichier PMML)
PMMLNotMatchDataErrorMsg.LABEL=Erreur interne (R\u00e9pertoire PMML)
getDataSourceErrorMsg.LABEL=Erreur interne (Obtention de la source de donn\u00e9es)
dataFileISValidErrorMsg.LABEL=Les donn\u00e9es d'entr\u00e9e n'incluent pas les champs pr\u00e9dicteurs requis par le mod\u00e8le
TarFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d'entr\u00e9e n'incluent pas le champ cible requis par le mod\u00e8le
TRFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d'entr\u00e9e n'incluent pas le champ de r\u00e9ponse cible requis par le mod\u00e8le
FreFieldNOTMatchErrMsg.LABEL=Les donn\u00e9es d'entr\u00e9e n'incluent pas le champ d'effectif requis par le mod\u00e8le
InputFieldNOTMatchMsg.LABEL=Les donn\u00e9es d'entr\u00e9es n'incluent pas les champs requis par le mod\u00e8le
NoValidRecordsMsg.LABEL=Il n\u2019y a pas d'enregistrement valide pour la cr\u00e9ation du mod\u00e8le
NoRecordsScoringMsg.LABEL=Il n\u2019y a pas d'enregistrement valide pour le scoring
PartionInValidMsg.LABEL=Le champ de partition doit \u00eatre diff\u00e9rent des autres champs pr\u00e9dictifs
InputFieldConstantMsg.LABEL=Un des champs pr\u00e9dicteurs contient une seule valeur.
InvalidSettingsErrorMsg.LABEL=Param\u00e8tres d\u2019algorithme du composant non valides
NoValidFieldValuesErrorMsg.LABEL=Les champs des m\u00e9tadonn\u00e9es n'ont pas d\u00e9fini de valeurs valides
PreparedDataHandleMsg.LABEL=Pr\u00e9paration du traitement des donn\u00e9es termin\u00e9e
HandleDataProcessMsg.LABEL=Processus de traitement des donn\u00e9es\u00a0: {0 } %
HandleDataProcessEndMsg.LABEL=Processus de traitement des donn\u00e9es\u00a0termin\u00e9
ExportPmmlProgressMsg.LABEL=Exportation du mod\u00e8le vers le fichier PMML termin\u00e9e
kMCCANCEL.LABEL=L'analyse a \u00e9t\u00e9 abandonn\u00e9e suite \u00e0 une demande d'annulation
kMC_IO_ERROR.LABEL=Une erreur E/S s'est produite.
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=La limite de m\u00e9moire a \u00e9t\u00e9 d\u00e9pass\u00e9e.
kMC_INVALID_SAVE_STATE.LABEL=La commande saveState() a \u00e9t\u00e9 lanc\u00e9e \u00e0 un moment o\u00f9 elle ne pouvait pas \u00eatre ex\u00e9cut\u00e9e. Essayez de la lancer \u00e0 un meilleur moment.
kMC_FAILED_RESTART.LABEL=Le red\u00e9marrage a \u00e9chou\u00e9 pour une raison inconnue. Impossible d'effectuer une action quelconque pour le moment
kMC_WRONG_STATE.LABEL=Une commande (autre que saveState) a \u00e9t\u00e9 lanc\u00e9e \u00e0 un moment inappropri\u00e9. Ce n'est g\u00e9n\u00e9ralement pas fatal. Essayez de lancer les commandes dans le bon ordre.
kADP_NoValidRecords.LABEL=La source de donn\u00e9es n'a pas d'enregistrements valides.
kADP_NoValidTestRecords.LABEL=La source de donn\u00e9es de test n'a pas d'enregistrements valides.
kADP_InValidMultiRawPassRecordIter.LABEL=Un it\u00e9rateur de donn\u00e9es brutes non valide est sp\u00e9cifi\u00e9.
kADP_MaxIterationIsReached.LABEL=Le nombre maximal d'it\u00e9rations pour l'apprentissage des probabilit\u00e9s a \u00e9t\u00e9 atteint.
kADP_OperationTypeIsWrong.LABEL=Le type d'op\u00e9ration est d\u00e9fini de mani\u00e8re incorrecte dans l'algorithme ADP
kADP_NullPointer.LABEL=Pointeur nul dans l'algorithme ADP
kADP_DynamicCastPointerFailed.LABEL=Echec de l'op\u00e9ration de transtypage dynamique vers la sous-classe.
kADP_WrongStorageTypeForFrequencyWeightVar.LABEL=La variable de pond\u00e9ration de fr\u00e9quence a un type de stockage incorrect
kADP_WrongStorageTypeForAnalysisWeightVar.LABEL=La variable de pond\u00e9ration d'analyse a un type de stockage incorrect
kADP_WrongStorageType.LABEL=Un champ a un type de stockage incorrect
kADP_InvalidUnivariateStatisticsInfo.LABEL=Les informations des statistiques univari\u00e9es ne sont pas valides.
kADP_TargetIsExcluded.LABEL=La cible a \u00e9t\u00e9 exclue
kADP_AllFeaturesAreExcluded.LABEL=Toutes les fonctions ont \u00e9t\u00e9 exclues Aucune entr\u00e9e ne sera fournie pour la g\u00e9n\u00e9ration de mod\u00e8le.
kADP_InvalidParametersPassed.LABEL=Erreur interne\u00a0: param\u00e8tres transmis non valides
kADP_FailedCalculateStatistics.LABEL=Impossible de calculer les statistiques
kADP_InvalidBivariateStatisticsInfo.LABEL=Les statistiques bivari\u00e9es ne sont pas valides.
kADP_ComputationError.LABEL=Une erreur s'est produite pendant le calcul
kADP_NoValidRecastThresholdParam.LABEL=La valeur de MINVALCONTINUOUS doit \u00eatre inf\u00e9rieure \u00e0 celle de MAXVALORDINAL.
kADP_MinValShouldLessThanMaxVal.LABEL=La valeur minimale doit \u00eatre inf\u00e9rieure \u00e0 la valeur maximale.
kADP_CutOffValOrSDValNotGreaterThanZero.LABEL=La valeur de c\u00e9sure ou l'\u00e9cart type (SD) doivent \u00eatre positifs
kADP_NoValidPVal.LABEL=Valeur p non valide
kADP_NoValidWeightVariable.LABEL=La variable de pond\u00e9ration n'est pas valide
kADP_NotSupportTimestamp.LABEL=Le format DATETIME n'est pas pris en charge par la proc\u00e9dure ADP
kADP_NotSupportUnknownStorageType.LABEL=Actuellement seul le format cha\u00eene,entier,r\u00e9el,date et heure est pris en charge par la proc\u00e9dure ADP
kADP_NoMapOfMissingValueOutputPMML.LABEL=La carte des valeurs manquantes n'\u00e9tait pas disponible
kADP_UnknownStepActionID.LABEL=Un ID d'action ou d'\u00e9tape inconnu est sp\u00e9cifi\u00e9.
kADP_InvalidVarIndx.LABEL=L'index de variable n'est pas valide
kADP_EmptyReorderValues.LABEL=Le vecteur de valeurs est vide apr\u00e8s la r\u00e9organisation.
kADP_OneVarSpecifiedMoreThanOnceForDifferentRoles.LABEL=Un champ ne peut \u00eatre sp\u00e9cifi\u00e9 qu'avec un des mots cl\u00e9s TARGET, INPUT ou ANALYSISWEIGHT.
kADP_MoreThanOneVarsSpecifiedForTarget.LABEL=Plus d'un champ est sp\u00e9cifi\u00e9 comme champ cible
kADP_NotSpecifiedAnyInputVariables.LABEL=Aucun champ d'entr\u00e9e n'est sp\u00e9cifi\u00e9
kADP_ExtensionNameHasBlank.LABEL=Au moins un espace est pr\u00e9sent dans le nom d'extension sp\u00e9cifi\u00e9 par l'utilisateur
kADP_ReorderTargetNoNominalTarget.LABEL=La r\u00e9organisation de la cat\u00e9gorie cible n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9e car il n'existe pas de cible nominale.
kADP_RescaleTargetNoScaleTarget.LABEL=La remise \u00e0 l'\u00e9chelle de la cible n'a pas \u00e9t\u00e9 r\u00e9alis\u00e9 car il n'existe pas de cible continue.
kADP_RescaleFeatureNoScaleFeature.LABEL=La remise \u00e0 l'\u00e9chelle des entr\u00e9es n'a pas \u00e9t\u00e9 effectu\u00e9e car il n'existe pas d'entr\u00e9es continues.
kADP_SupervisedBinningNoCatTarget.LABEL=La cr\u00e9ation de classes supervis\u00e9e n'est pas r\u00e9alis\u00e9e car il n'y a pas de cible qualitative.
kADP_SupervisedBinningNoScaleFeature.LABEL=La cr\u00e9ation de classes supervis\u00e9e n'est pas r\u00e9alis\u00e9e car il n'y a pas d'entr\u00e9es continues.
kADP_FeatureSelectionNoTarget.LABEL=La s\u00e9lection de fonctions n'a pas \u00e9t\u00e9 effectu\u00e9e car il n'y a pas de cible.
kADP_FeatureSelectionCatTargetWithoutCatFeature.LABEL=La s\u00e9lection de fonctions n'a pas \u00e9t\u00e9 effectu\u00e9e car il n'existe pas d'entr\u00e9es cat\u00e9gorielles pour la cible cat\u00e9gorielle.
kADP_FeatureSelectionScaleTargetWithoutScaleFeature.LABEL=La s\u00e9lection de fonctions n'est pas r\u00e9alis\u00e9e car il n'y a pas d'entr\u00e9es continues pour la cible d'\u00e9chelle.
kADP_FeatureConstructionNoScaleFeature.LABEL=La construction de fonctions n'a pas \u00e9t\u00e9 effectu\u00e9e car il n'existe pas d'entr\u00e9es continues.
kADP_ReorderNominalFeatureNoNominalFeature.LABEL=Les cat\u00e9gories de fonction n'ont pas pu \u00eatre r\u00e9organis\u00e9es car il n'y a pas de fonctions nominales.
kADP_SupervisedMergingNoTarget.LABEL=La fusion supervis\u00e9e n'est pas r\u00e9alis\u00e9e car il n'y a pas de cible.
kADP_SupervisedMergingNoCatFeature.LABEL=La fusion supervis\u00e9e n'est pas r\u00e9alis\u00e9e car il n'y a pas d'entr\u00e9es qualitatives.
kADP_UnsupervisedMergingNoCatFeature.LABEL=La fusion non supervis\u00e9e n'a pas \u00e9t\u00e9 effectu\u00e9e car il n'existe pas d'entr\u00e9es cat\u00e9gorielles.
kADP_NoPredictorsRecommended.LABEL=Aucune fonction n'est recommand\u00e9e pour une utilisation en mod\u00e9lisation.
kADP_OneVarSpecifiedMoreThanOnce.LABEL=Un champ a \u00e9t\u00e9 sp\u00e9cifi\u00e9 plusieurs fois
kADP_UnsupervisedMergingWithTarget.LABEL=La fusion non supervis\u00e9e n'a pas \u00e9t\u00e9 effectu\u00e9e car une cible existe.
kADP_EmptySuffix.LABEL=Aucune extension de nom n'est sp\u00e9cifi\u00e9e pour les variables transform\u00e9es ou construites
kADP_OneVarSpecifiedMoreThanOnceForTheSameRole.LABEL=Un champ est sp\u00e9cifi\u00e9 plusieurs fois pour le m\u00eame r\u00f4le, par exemple deux fois en tant que champ cible.
InvalidXmlCharError.LABEL=V\u00e9rifiez que les donn\u00e9es de cha\u00eene ne contiennent pas de caract\u00e8res de contr\u00f4le
