#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2009, 2012
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

adp=Preparazione dati automatica
unknownErrorMsg.LABEL=Errore interno (sconosciuto)
initErrMsg.LABEL=Inizializzazione non riuscita
inputErrMsg.LABEL=Errore di lettura dei dati di input
internalErrMsg.LABEL=Errore interno
invalidMetadataErrMsg.LABEL=Metadati non validi (su campi di input/output)
fileNotExistErrorMsg.LABEL=Il file di dati non esiste
storageNotSupportErrorMsg.LABEL=L'integrazione non supporta questo tipo di archiviazione dati
invalidTargetErrorMsg.LABEL=Impostazione variabile obiettivo non valida
invalidTarResponseErrorMsg.LABEL=Impostazione variabile di risposta obiettivo non valida
predictorsEmptyErrMsg.LABEL=L'impostazione per i predittori non deve essere vuota
targetAsInputErrorMsg.LABEL=Il campo obiettivo non pu\u00f2 essere un input
invalidFrequencyErrorMsg.LABEL=Il campo frequenza non pu\u00f2 essere un input
invalidTargetResponseErrorMsg.LABEL=Il campo di risposta obiettivo non pu\u00f2 essere un input
invlidResponseCatErrorMsg.LABEL=La variabile di risposta obiettivo dovrebbe essere un indicatore
noFrequencyErrorMsg.LABEL=Nessun campo frequenza selezionato
noTargetErrorMsg.LABEL=Nessun valore campo destinazione specificato
invalidtarValueMsg.LABEL=\u00c8 stato specificato un valore campo obiettivo non valido
getfilePathMsg.LABEL=Errore interno (ottieni file)
creationAlgorithmMsg.LABEL=Errore interno (algoritmo)
buildModelErrorMsg.LABEL=Errore interno (build componente)
assessModelErrorMsg.LABEL=Errore interno (valutazione componente)
exportPMLLErrorMsg.LABEL=Errore interno (Esportazione PMML componente)
getDataFieldErrorMsg.LABEL=Errore interno (ottieni modello dati)
tarResIsSameErrorMsg.LABEL=La variabile obiettivo, la variabile risposta obiettivo, la variabile del peso e la variabile di partizione devono essere diverse
NoTargetFieldErrorMsg.LABEL=Nessun campo obiettivo selezionato
NoTargetResFieldErrorMsg.LABEL=Nessun campo di risposta obiettivo selezionato
targetResTrueErrorMsg.LABEL=L'impostazione del valore vero di risposta obiettivo non \u00e8 valida
PMMLNotExistErrorMsg.LABEL=Errore interno (PMML mancante)
PMMLIsInvalidErrorMsg.LABEL=Errore interno (PMML non valido)
NoPredVarInPMMLErrorMsg.LABEL=Errore interno (nessuna variabile predittore nel file PMML)
PMMLNotMatchDataErrorMsg.LABEL=Errore interno (Directory PMML)
getDataSourceErrorMsg.LABEL=Errore interno (Ottenimento origine dati)
dataFileISValidErrorMsg.LABEL=I dati di input non includono i campi predittori richiesti dal modello
TarFieldNOTMatchErrMsg.LABEL=I dati di input non includono il campo obiettivo richiesto dal modello
TRFieldNOTMatchErrMsg.LABEL=I dati di input non includono il campo risposta obiettivo richiesto dal modello
FreFieldNOTMatchErrMsg.LABEL=I dati di input non contengono il campo frequenza richiesto dal modello
InputFieldNOTMatchMsg.LABEL=I dati di input non contengono i campi richiesti dal modello
NoValidRecordsMsg.LABEL=Non esistono record validi per la creazione del modello
NoRecordsScoringMsg.LABEL=Non esistono record validi per il calcolo del punteggio
PartionInValidMsg.LABEL=Il campo partizione deve essere diverso dagli altri campi predittivi
InputFieldConstantMsg.LABEL=Uno dei campi predittori contiene solo un valore
InvalidSettingsErrorMsg.LABEL=Impostazioni algoritmo componente non valide
NoValidFieldValuesErrorMsg.LABEL=I campi dei metadati non definivano valori validi
PreparedDataHandleMsg.LABEL=Handle di preparazione dati completato
HandleDataProcessMsg.LABEL=Processo di gestione dati : {0 } %
HandleDataProcessEndMsg.LABEL=Processo dati handle completato
ExportPmmlProgressMsg.LABEL=Esportazione del modello nel file PMML completata
kMCCANCEL.LABEL=L'analisi \u00e8 stata abbandonata in seguito a una richiesta di cancellazione
kMC_IO_ERROR.LABEL=Si \u00e8 verificato un errore di I/O
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Limite di memoria superato
kMC_INVALID_SAVE_STATE.LABEL=Il comando saveState() \u00e8 stato dato in un momento in cui non poteva essere eseguito. Riprovare in un momento pi\u00f9 indicato.
kMC_FAILED_RESTART.LABEL=Riavvio non riuscito per qualche motivo. Impossibile fare qualcosa al momento
kMC_WRONG_STATE.LABEL=\u00c8 stato dato un comando (diverso da saveState) in un momento non appropriato. Solitamente non si tratta di un errore irreversibile. Provare a immettere i comandi nell'ordine appropriato.
kADP_NoValidRecords.LABEL=La origine dati non ha record validi
kADP_NoValidTestRecords.LABEL=La origine dati di test non ha record validi
kADP_InValidMultiRawPassRecordIter.LABEL=\u00c8 stato specificato un iteratore di dati grezzi non valido
kADP_MaxIterationIsReached.LABEL=\u00c8 stato raggiunto il numero massimo di iterazioni per l'apprendimento della probabilit\u00e0
kADP_OperationTypeIsWrong.LABEL=Il tipo di operazione nell'algoritmo ADP \u00e8 impostato erroneamente
kADP_NullPointer.LABEL=Puntatore null in algoritmo ADP
kADP_DynamicCastPointerFailed.LABEL=Operazione di cast dinamico in sottoclasse non riuscita
kADP_WrongStorageTypeForFrequencyWeightVar.LABEL=La variabile peso della frequenza ha un tipo di archiviazione non corretto
kADP_WrongStorageTypeForAnalysisWeightVar.LABEL=La variabile del peso di analisi ha un tipo di archiviazione non corretto
kADP_WrongStorageType.LABEL=Un campo ha un tipo di archiviazione non esatto
kADP_InvalidUnivariateStatisticsInfo.LABEL=Le informazioni sulle statistiche univariate non sono valide
kADP_TargetIsExcluded.LABEL=L'obiettivo \u00e8 stato escluso
kADP_AllFeaturesAreExcluded.LABEL=Tutte le funzioni sono state escluse. Non verr\u00e0 fornito alcun input per la creazione del modello.
kADP_InvalidParametersPassed.LABEL=Errore interno: sono stati passati parametri non validi
kADP_FailedCalculateStatistics.LABEL=Impossibile calcolare le statistiche
kADP_InvalidBivariateStatisticsInfo.LABEL=Le statistiche bivariate non sono valide
kADP_ComputationError.LABEL=Si \u00e8 verificato un errore durante il calcolo
kADP_NoValidRecastThresholdParam.LABEL=MINVALCONTINUOUS deve essere inferiore a MAXVALORDINAL.
kADP_MinValShouldLessThanMaxVal.LABEL=Il valore minimo deve essere inferiore al valore massimo
kADP_CutOffValOrSDValNotGreaterThanZero.LABEL=Il valore di interruzione o DS deve essere positivo
kADP_NoValidPVal.LABEL=Valore P non valido
kADP_NoValidWeightVariable.LABEL=La variabile del peso non \u00e8 valida
kADP_NotSupportTimestamp.LABEL=Il formato DATETIME attualmente non \u00e8 supportato dalla procedura ADP
kADP_NotSupportUnknownStorageType.LABEL=Attualmente, la procedura ADP supporta solo i formati stringa, intero, reale, data e ora.
kADP_NoMapOfMissingValueOutputPMML.LABEL=La mappa dei valori mancanti non era disponibile
kADP_UnknownStepActionID.LABEL=Sono stati specificati una fase o un ID azione sconosciuti
kADP_InvalidVarIndx.LABEL=L'indice della variabile non \u00e8 valido
kADP_EmptyReorderValues.LABEL=Il vettore di valori \u00e8 vuoto dopo il riordinamento
kADP_OneVarSpecifiedMoreThanOnceForDifferentRoles.LABEL=Un campo pu\u00f2 essere specificato solo in una delle parole chiave TARGET, INPUT o ANALYSISWEIGHT.
kADP_MoreThanOneVarsSpecifiedForTarget.LABEL=\u00c8 stato specificato pi\u00f9 di un campo come obiettivo
kADP_NotSpecifiedAnyInputVariables.LABEL=Non sono stati specificati campi di input
kADP_ExtensionNameHasBlank.LABEL=Il nome dell'estensione specificata dall'utente contiene almeno uno spazio
kADP_ReorderTargetNoNominalTarget.LABEL=Il riordino della categoria obiettivo non viene eseguito perch\u00e9 non vi \u00e8 alcun obiettivo nominale.
kADP_RescaleTargetNoScaleTarget.LABEL=La modifica di scala dell'obiettivo non viene eseguita perch\u00e9 non vi \u00e8 alcun obiettivo continuo.
kADP_RescaleFeatureNoScaleFeature.LABEL=La modifica di scala dell'input non viene eseguita perch\u00e9 non vi \u00e8 alcun input continuo.
kADP_SupervisedBinningNoCatTarget.LABEL=La raccolta supervisionata non viene eseguita perch\u00e9 non vi \u00e8 alcun obiettivo categoriale.
kADP_SupervisedBinningNoScaleFeature.LABEL=La raccolta supervisionata non viene eseguita perch\u00e9 non vi \u00e8 alcun input continuo.
kADP_FeatureSelectionNoTarget.LABEL=La selezione delle funzioni non viene eseguita perch\u00e9 non vi \u00e8 alcun obiettivo.
kADP_FeatureSelectionCatTargetWithoutCatFeature.LABEL=La selezione delle funzioni non viene eseguita perch\u00e9 non vi \u00e8 alcun input categoriale per l'obiettivo categoriale.
kADP_FeatureSelectionScaleTargetWithoutScaleFeature.LABEL=La selezione delle funzioni non viene eseguita perch\u00e9 non vi \u00e8 alcun input continuo per l'obiettivo di scala.
kADP_FeatureConstructionNoScaleFeature.LABEL=La creazione delle funzioni non viene eseguita in quanto non \u00e8 presente alcun input continuo.
kADP_ReorderNominalFeatureNoNominalFeature.LABEL=Impossibile riordinare le categorie di funzioni in quanto non esistono funzioni nominali
kADP_SupervisedMergingNoTarget.LABEL=L'unione supervisionata non viene eseguita perch\u00e9 non vi \u00e8 alcun obiettivo.
kADP_SupervisedMergingNoCatFeature.LABEL=L'unione supervisionata non viene eseguita in quanto non \u00e8 presente alcun input categoriale.
kADP_UnsupervisedMergingNoCatFeature.LABEL=L'unione non supervisionata non viene eseguita in quanto non \u00e8 presente alcun input categoriale.
kADP_NoPredictorsRecommended.LABEL=Nessuna funzione consigliata per l'utilizzo nella modellazione
kADP_OneVarSpecifiedMoreThanOnce.LABEL=Un campo \u00e8 stato specificato pi\u00f9 di una volta
kADP_UnsupervisedMergingWithTarget.LABEL=L'unione non supervisionata non viene eseguita perch\u00e9 \u00e8 presente un obiettivo.
kADP_EmptySuffix.LABEL=Non sono state specificate le estensioni dei nomi per le variabili trasformate o create
kADP_OneVarSpecifiedMoreThanOnceForTheSameRole.LABEL=Un campo \u00e8 stato specificato pi\u00f9 di una volta per lo stesso ruolo (ad es. specificato due volte come campo di input)
InvalidXmlCharError.LABEL=Controllare che i dati stringa non contengano caratteri di controllo
