#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2009, 2012
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

adp=Automatyczne przygotowanie danych
unknownErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (nieznany)
initErrMsg.LABEL=Inicjowanie nie powiod\u0142o si\u0119
inputErrMsg.LABEL=B\u0142\u0105d podczas odczytywania danych wej\u015bciowych
internalErrMsg.LABEL=B\u0142\u0105d wewn\u0119trzny
invalidMetadataErrMsg.LABEL=Metadane (dla zmiennych wej\u015bciowych/wyj\u015bciowych) s\u0105 nieprawid\u0142owe
fileNotExistErrorMsg.LABEL=Plik z danymi nie istnieje
storageNotSupportErrorMsg.LABEL=Integracja nie obs\u0142uguje tego typu sk\u0142adowania danych
invalidTargetErrorMsg.LABEL=Nieprawid\u0142owe ustawienie zmiennej przewidywanej
invalidTarResponseErrorMsg.LABEL=Nieprawid\u0142owe ustawienie zmiennej przewidywanej odpowiedzi
predictorsEmptyErrMsg.LABEL=Ustawienie predyktor\u00f3w nie mo\u017ce by\u0107 puste
targetAsInputErrorMsg.LABEL=Zmienna przewidywana nie mo\u017ce by\u0107 dan\u0105 wej\u015bciow\u0105
invalidFrequencyErrorMsg.LABEL=Zmienna cz\u0119sto\u015bci nie mo\u017ce by\u0107 zmienn\u0105 wej\u015bciow\u0105
invalidTargetResponseErrorMsg.LABEL=Zmienna przewidywanej odpowiedzi nie mo\u017ce by\u0107 zmienn\u0105 wej\u015bciow\u0105
invlidResponseCatErrorMsg.LABEL=Zmienna przewidywanej odpowiedzi powinna by\u0107 typu flaga
noFrequencyErrorMsg.LABEL=Nie wybrano zmiennej cz\u0119sto\u015bci
noTargetErrorMsg.LABEL=Nie okre\u015blono warto\u015bci zmiennej przewidywanej
invalidtarValueMsg.LABEL=Okre\u015blono nieprawid\u0142ow\u0105 warto\u015b\u0107 zmiennej przewidywanej
getfilePathMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (pobierz plik)
creationAlgorithmMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (algorytm)
buildModelErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (budowanie sk\u0142adnika)
assessModelErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (oszacowanie sk\u0142adnika)
exportPMLLErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (eksport sk\u0142adnika PMML)
getDataFieldErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (pobierz model danych)
tarResIsSameErrorMsg.LABEL=Zmienna przewidywana, zmienna przewidywanej odpowiedzi, zmienna wa\u017c\u0105ca i zmienna dziel\u0105ca na podzbiory powinny by\u0107 r\u00f3\u017cne
NoTargetFieldErrorMsg.LABEL=Nie wybrano zmiennej przewidywanej
NoTargetResFieldErrorMsg.LABEL=Nie wybrano zmiennej przewidywanej odpowiedzi
targetResTrueErrorMsg.LABEL=Ustawienie warto\u015bci prawda dla przewidywanej odpowiedzi jest nieprawid\u0142owe
PMMLNotExistErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (brak PMML)
PMMLIsInvalidErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (nieprawid\u0142owy PMML)
NoPredVarInPMMLErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (brak zmiennej predyktora w pliku PMML)
PMMLNotMatchDataErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (katalog PMML)
getDataSourceErrorMsg.LABEL=B\u0142\u0105d wewn\u0119trzny (pobierz \u017ar\u00f3d\u0142o danych)
dataFileISValidErrorMsg.LABEL=Dane wej\u015bciowe nie zawieraj\u0105 zmiennych predykcyjnych wymaganych przez model.
TarFieldNOTMatchErrMsg.LABEL=Dane wej\u015bciowe nie zawieraj\u0105 zmiennej przewidywanej wymaganej przez model.
TRFieldNOTMatchErrMsg.LABEL=Dane wej\u015bciowe nie zawieraj\u0105 zmiennej przewidywanej odpowiedzi wymaganej przez model.
FreFieldNOTMatchErrMsg.LABEL=Dane wej\u015bciowe nie zawieraj\u0105 zmiennej cz\u0119sto\u015bci wymaganej przez model.
InputFieldNOTMatchMsg.LABEL=Dane wej\u015bciowe nie zawieraj\u0105 zmiennych wymaganych przez model.
NoValidRecordsMsg.LABEL=Brak prawid\u0142owych rekord\u00f3w do budowy modelu
NoRecordsScoringMsg.LABEL=Brak prawid\u0142owych rekord\u00f3w do oceny
PartionInValidMsg.LABEL=Zmienna dziel\u0105ca na podzbiory powinna by\u0107 inna ni\u017c pozosta\u0142e zmienne predykcyjne
InputFieldConstantMsg.LABEL=Jedna ze zmiennych przewidywanych zawiera tylko jedn\u0105 warto\u015b\u0107
InvalidSettingsErrorMsg.LABEL=Nieprawid\u0142owe ustawienia dla sk\u0142adnika algorytmu
NoValidFieldValuesErrorMsg.LABEL=Zmienne metadanych nie definiuj\u0105 prawid\u0142owych warto\u015bci
PreparedDataHandleMsg.LABEL=Przygotowanie obs\u0142ugi danych zosta\u0142o zako\u0144czone
HandleDataProcessMsg.LABEL=Proces obs\u0142ugi danych : {0 }%
HandleDataProcessEndMsg.LABEL=Proces obs\u0142ugi danych zosta\u0142 zako\u0144czony
ExportPmmlProgressMsg.LABEL=Eksportowanie modelu do pliku PMML zosta\u0142o zako\u0144czone
kMCCANCEL.LABEL=Zaniechano kontynuacji analizy po \u017c\u0105daniu jej anulowania
kMC_IO_ERROR.LABEL=Wyst\u0105pi\u0142 b\u0142\u0105d We/Wy
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Przekroczono warto\u015b\u0107 graniczn\u0105 dla pami\u0119ci
kMC_INVALID_SAVE_STATE.LABEL=Komenda saveState() zosta\u0142a wydana w czasie, gdy nie mog\u0142a zosta\u0107 wykonana. Spr\u00f3buj ponownie p\u00f3\u017aniej.
kMC_FAILED_RESTART.LABEL=Ponowne uruchomienie nie powiod\u0142o si\u0119. W tej chwili nic nie mo\u017cna zrobi\u0107.
kMC_WRONG_STATE.LABEL=Komenda (inna ni\u017c saveState) zosta\u0142a wydana w nieprawid\u0142owym czasie. Zazwyczaj nie jest to krytyczne. Spr\u00f3buj wydawa\u0107 komendy w prawid\u0142owej kolejno\u015bci.
kADP_NoValidRecords.LABEL=\u0179r\u00f3d\u0142o danych nie zawiera prawid\u0142owych rekord\u00f3w
kADP_NoValidTestRecords.LABEL=\u0179r\u00f3d\u0142o danych testowych nie zawiera prawid\u0142owych rekord\u00f3w
kADP_InValidMultiRawPassRecordIter.LABEL=Okre\u015blono nieprawid\u0142owy iterator danych surowych
kADP_MaxIterationIsReached.LABEL=Zosta\u0142a osi\u0105gni\u0119ta maksymalna liczba iteracji zapami\u0119tywania prawdopodobie\u0144stwa
kADP_OperationTypeIsWrong.LABEL=Typ operacji w algorytmie ADP jest ustawiony nieprawid\u0142owo
kADP_NullPointer.LABEL=Wska\u017anik typu null w algorytmie ADP
kADP_DynamicCastPointerFailed.LABEL=Operacja dynamicznego rzutowania na podklas\u0119 nie powiod\u0142a si\u0119
kADP_WrongStorageTypeForFrequencyWeightVar.LABEL=Zmienna wagi liczebno\u015bci ma nieprawid\u0142owy typ sk\u0142adowania
kADP_WrongStorageTypeForAnalysisWeightVar.LABEL=Zmienna wagi analizy ma nieprawid\u0142owy typ sk\u0142adowania
kADP_WrongStorageType.LABEL=Zmienna ma nieprawid\u0142owy typ sk\u0142adowania
kADP_InvalidUnivariateStatisticsInfo.LABEL=Informacje statystyk jednej zmiennej s\u0105 nieprawid\u0142owe
kADP_TargetIsExcluded.LABEL=Zmienna przewidywana zosta\u0142a wy\u0142\u0105czona
kADP_AllFeaturesAreExcluded.LABEL=Wszystkie predyktory zosta\u0142y wykluczone. Nie zostan\u0105 wprowadzone \u017cadne dane do budowania modelu.
kADP_InvalidParametersPassed.LABEL=B\u0142\u0105d wewn\u0119trzny: przekazano nieprawid\u0142owe parametry
kADP_FailedCalculateStatistics.LABEL=Nie mo\u017cna wyliczy\u0107 statystyk
kADP_InvalidBivariateStatisticsInfo.LABEL=Statystyki dwumianowe s\u0105 nieprawid\u0142owe
kADP_ComputationError.LABEL=Wyst\u0105pi\u0142 b\u0142\u0105d podczas obliczania
kADP_NoValidRecastThresholdParam.LABEL=Warto\u015b\u0107 MINVALCONTINUOUS musi by\u0107 mniejsza ni\u017c warto\u015b\u0107 MAXVALORDINAL.
kADP_MinValShouldLessThanMaxVal.LABEL=Warto\u015b\u0107 minimalna powinna by\u0107 mniejsza ni\u017c warto\u015b\u0107 maksymalna
kADP_CutOffValOrSDValNotGreaterThanZero.LABEL=Warto\u015b\u0107 punktu odci\u0119cia lub odchylenia standardowego musi by\u0107 dodatnia
kADP_NoValidPVal.LABEL=Nieprawid\u0142owa warto\u015b\u0107 p
kADP_NoValidWeightVariable.LABEL=Zmienna wagi jest nieprawid\u0142owa
kADP_NotSupportTimestamp.LABEL=Format DATETIME nie jest obecnie obs\u0142ugiwany przez procedur\u0119 ADP
kADP_NotSupportUnknownStorageType.LABEL=Procedura ADP obs\u0142uguje obecnie tylko \u0142a\u0144cuch, liczb\u0119 ca\u0142kowit\u0105, liczb\u0119 rzeczywist\u0105 i format daty i godziny
kADP_NoMapOfMissingValueOutputPMML.LABEL=Mapa brakuj\u0105cych warto\u015bci by\u0142a niedost\u0119pna
kADP_UnknownStepActionID.LABEL=Okre\u015blono nieznany identyfikator kroku lub operacji
kADP_InvalidVarIndx.LABEL=Indeks zmiennej jest nieprawid\u0142owy
kADP_EmptyReorderValues.LABEL=Po zmianie kolejno\u015bci wektor warto\u015bci jest pusty
kADP_OneVarSpecifiedMoreThanOnceForDifferentRoles.LABEL=Zmienna mo\u017ce by\u0107 okre\u015blona tylko w jednym ze s\u0142\u00f3w kluczowych TARGET, INPUT lub ANALYSISWEIGHT.
kADP_MoreThanOneVarsSpecifiedForTarget.LABEL=Istnieje wi\u0119cej ni\u017c jedna zmienna okre\u015blona jako zmienna przewidywana
kADP_NotSpecifiedAnyInputVariables.LABEL=Brak okre\u015blonych zmiennych wej\u015bciowych
kADP_ExtensionNameHasBlank.LABEL=W nazwie rozszerzenia zdefiniowanej przez u\u017cytkownika istnieje co najmniej jedna spacja
kADP_ReorderTargetNoNominalTarget.LABEL=Uporz\u0105dkowanie kategorii zmiennej przewidywanej nie nie jest wykonywane, poniewa\u017c nie ma nominalnej zmiennej przewidywanej.
kADP_RescaleTargetNoScaleTarget.LABEL=Przeskalowanie zmiennej przewidywanej nie jest wykonywane, poniewa\u017c nie ma ilo\u015bciowej zmiennej przewidywanej.
kADP_RescaleFeatureNoScaleFeature.LABEL=Przeskalowanie zmiennej wej\u015bciowej nie jest wykonywane, poniewa\u017c nie ma ilo\u015bciowych zmiennych wej\u015bciowych.
kADP_SupervisedBinningNoCatTarget.LABEL=Nadzorowana kategoryzacja nie jest wykonywana, poniewa\u017c nie ma jako\u015bciowej zmiennej przewidywanej.
kADP_SupervisedBinningNoScaleFeature.LABEL=Nadzorowana kategoryzacja nie jest wykonywana, poniewa\u017c nie ma ilo\u015bciowych zmiennych wej\u015bciowych.
kADP_FeatureSelectionNoTarget.LABEL=Wyb\u00f3r predyktor\u00f3w nie jest wykonywany, poniewa\u017c nie ma zmiennej przewidywanej.
kADP_FeatureSelectionCatTargetWithoutCatFeature.LABEL=Wyb\u00f3r predyktor\u00f3w nie jest wykonywany, poniewa\u017c dla przewidywanej zmiennej jako\u015bciowej nie ma jako\u015bciowych zmiennych wej\u015bciowych.
kADP_FeatureSelectionScaleTargetWithoutScaleFeature.LABEL=Wyb\u00f3r predyktor\u00f3w nie jest wykonywany, poniewa\u017c dla ilo\u015bciowej zmiennej przewidywanej nie ma ilo\u015bciowych zmiennych wej\u015bciowych.
kADP_FeatureConstructionNoScaleFeature.LABEL=Konstrukcja predyktor\u00f3w nie jest wykonywana, poniewa\u017c nie ma ilo\u015bciowych zmiennych wej\u015bciowych.
kADP_ReorderNominalFeatureNoNominalFeature.LABEL=Zmiana kolejno\u015bci predyktor\u00f3w jako\u015bciowych nie by\u0142a mo\u017cliwa, poniewa\u017c nie wyst\u0119puj\u0105 predyktory nominalne
kADP_SupervisedMergingNoTarget.LABEL=Nadzorowane scalanie nie jest wykonywane, poniewa\u017c nie ma zmiennej przewidywanej.
kADP_SupervisedMergingNoCatFeature.LABEL=Nadzorowane scalanie nie jest wykonywane, poniewa\u017c nie ma jako\u015bciowych zmiennych wej\u015bciowych.
kADP_UnsupervisedMergingNoCatFeature.LABEL=Nienadzorowane scalanie nie jest wykonywane, poniewa\u017c nie ma jako\u015bciowych zmiennych wej\u015bciowych.
kADP_NoPredictorsRecommended.LABEL=\u017badne predyktory nie s\u0105 zalecane do wykorzystania w modelowaniu
kADP_OneVarSpecifiedMoreThanOnce.LABEL=Zmienna zosta\u0142a okre\u015blona wi\u0119cej ni\u017c raz
kADP_UnsupervisedMergingWithTarget.LABEL=Nienadzorowane scalanie nie jest wykonywane, poniewa\u017c istnieje zmienna przewidywana.
kADP_EmptySuffix.LABEL=Nie okre\u015blono rozszerze\u0144 nazw dla zmiennych przekszta\u0142conych lub utworzonych
kADP_OneVarSpecifiedMoreThanOnceForTheSameRole.LABEL=Jedna zmienna zosta\u0142a okre\u015blona wi\u0119cej ni\u017c raz dla tej samej roli (np. zosta\u0142a okre\u015blona dwukrotnie jako zmienna wej\u015bciowa).
InvalidXmlCharError.LABEL=Prosz\u0119 zweryfikowa\u0107, czy dane \u0142a\u0144cuchowe nie zawieraj\u0105 znak\u00f3w steruj\u0105cych
