#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2019
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

glmm=Modelos lineales mixtos generalizados

# GLMM error and warning messages
kGLMM_NullPointer.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n. 
kGLMM_VarInFixedEffectCanNotBeTargetOrTrials.LABEL=No se puede especificar un campo como {0} y parte de un efecto fijo.
kGLMM_VarInRandomEffectCanNotBeTargetOrTrials.LABEL=No se puede especificar un campo como {0} y parte de un efecto aleatorio.
kGLMM_DuplicatedEffectInFixed.LABEL=Se ha encontrado al menos un efecto {0} duplicado. Todos los efectos duplicados se ignorar\u00e1n.
kGLMM_VarInSomeRolesCanNotBeTargetOrTrials.LABEL=No se puede especificar un campo como {0} y {1}.
kGLMM_OffsetCanNotBeSomeOtherRole.LABEL=No se puede especificar un campo como desplazamiento y {0}.
kGLMM_DuplicatedVarInRepeatedSubjectAndMeasure.LABEL=No se pueden especificar los campos como sujetos y medidas repetidas.
kGLMM_AnalysisWeightCanNotBeSomeOtherRole.LABEL=Un campo no se puede especificada como una ponderaci\u00f3n de an\u00e1lisis y {0}.
kGLMM_RepeatedMeasureAsSubjectInRandom.LABEL=No se pueden especificar los campos como sujetos y medidas repetidas.
kGLMM_RandomSubjectNotInRepeated.LABEL=Al menos un campo de sujeto de efectos aleatorios no se ha especificado como campo de sujeto en la especificaci\u00f3n de la estructura de datos.
kGLMM_NoSubjectInRepeated.LABEL=Se requiere la palabra clave SUBJECT cuando se utiliza el subcomando DATA_STRUCTURE.
kGLMM_DuplicatedEffectInRandoms.LABEL=Se ha encontrado al menos un efecto {0} duplicado. Todos los efectos duplicados se ignorar\u00e1n.
kGLMM_NoEffectsInRandom.LABEL=No se han especificado efectos aleatorios en al menos un bloque de efectos aleatorios.
kGLMM_GroupingOnRandEffIsNotSupportedForMultinomial.LABEL=No se admiten agrupaciones en bloques de efectos aleatorios para la distribuci\u00f3n de probabilidad multinomial.
kGLMM_UnmatchedDistributionAndLink.LABEL=Se ha especificado una combinaci\u00f3n no v\u00e1lida de ajuste de distribuci\u00f3n y de enlace.
kGLMM_InsufficientMemory.LABEL=Memoria insuficiente. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_NoValidCase.LABEL=No hay registros v\u00e1lidos.
kGLMM_DuplicatedRepeatedLevels.LABEL=Los niveles del efecto de medidas repetidas no son diferentes para cada caso en un sujeto repetido.
kGLMM_DuplicatedRepeatedLevelForCaseWeight.LABEL=Debido a que algunas ponderaciones de frecuencia v\u00e1lidas son superiores a 1, los niveles del efecto de medidas repetidas no son diferentes para cada caso en un sujeto repetido.
kGLMM_UndistinctDependentDataInBinomial.LABEL=El destino debe tener dos valores de datos v\u00e1lidos distintos cuando se utiliza la distribuci\u00f3n binomial.
kGLMM_IllegalDependentValInGammaOrIGauss.LABEL=Los valores de datos de destino para la distribuci\u00f3n de probabilidad {0} deben ser positivos.
kGLMM_IllegalDependentValInNebinomialOrPoisson.LABEL=Los valores de datos de destino para la distribuci\u00f3n de probabilidad {0} deben ser enteros no negativos.
kGLMM_InvalidInitialValue.LABEL=Error: La lista o el archivo de valores iniciales contiene datos no v\u00e1lidos o insuficientes. Se deben proporcionar valores iniciales para todos los par\u00e1metros (incluyendo los par\u00e1metros redundantes si el modelo es un modelo lineal generalizado). El orden de los valores iniciales debe corresponder al orden de los par\u00e1metros del modelo utilizados en el procedimiento.
kGLMM_IterationTerminatedButNoConv.LABEL=La iteraci\u00f3n ha concluido pero no se ha conseguido la convergencia. Se muestran los resultados de la \u00faltima iteraci\u00f3n. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_ConvButHessianNotPositive.LABEL=La matriz Hessiana final no es definida positiva aunque se han cumplido todos los criterios de convergencia. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_QuasiCompleteSeparation.LABEL=Es posible que haya una separaci\u00f3n casi completa en los datos. Las estimaciones de m\u00e1xima verosimilitud no existen. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_InvalidCaseInLastIteration.LABEL=Hay al menos un registro no v\u00e1lido en la \u00faltima iteraci\u00f3n. Un registro es no v\u00e1lido si existen errores al calcular la funci\u00f3n de enlace {0} inversa, el logaritmo de verosimilitud, el gradiente o la matriz Hessiana en el proceso iterativo. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_FrequencyWeightVarInCovariate.LABEL=La ponderaci\u00f3n de frecuencia no se puede utilizar en ning\u00fan otro rol.
kGLMM_VarInFixedEffectCanNotBeAnalysisWeightOrOffset.LABEL=No se puede especificar un campo como parte de un efecto fijo y {0}.
kGLMM_VarInRandomEffectCanNotBeAnalysisWeightOrOffset.LABEL=No se puede especificar un campo como parte de un efecto aleatorio y {0}.
kGLMM_DuplicatedFactorInEffect.LABEL=Un campo categ\u00f3rico se ha especificado m\u00e1s de una vez en el efecto. Se puede especificar una sola vez.
kGLMM_InternalError.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n. 
kGLMM_TargetIsNotCatForMultinomial.LABEL=El destino debe tener un nivel de medici\u00f3n categ\u00f3rico si se especifica la distribuci\u00f3n de probabilidad multinomial.
kGLMM_TargetIsNotContForSomeDistribution.LABEL=El destino debe tener un nivel de medici\u00f3n continuo si se especifica la distribuci\u00f3n de probabilidad {0}
kGLMM_RegWeightFieldIsNotNumeric.LABEL=La ponderaci\u00f3n de an\u00e1lisis debe ser num\u00e9rica.
kGLMM_OffsetFieldIsNotContinuous.LABEL=El desplazamiento debe tener un nivel de medici\u00f3n continuo.
kGLMM_FreWeightFieldIsNotNumeric.LABEL=El campo de ponderaci\u00f3n de frecuencia debe ser num\u00e9rico.
kGLMM_EMMeansEffectIsNotInFixedEffect.LABEL=Todos los t\u00e9rminos de las medias marginales estimadas tambi\u00e9n deben ser efectos fijos.
kGLMM_EMMeansCovariateIsNotInCovariates.LABEL=Al menos un campo especificado como control de medias marginales estimadas no se ha especificado tambi\u00e9n como una covariable en el modelo.
kGLMM_NumericalProblemInEstimation.LABEL=El modelo no se puede crear porque se ha producido un error de c\u00e1lculo durante la estimaci\u00f3n. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_TargetIsNotCont4BinomialEventTrials.LABEL=El destino debe tener un nivel de medici\u00f3n continuo si se especifica un campo de ensayos.
kGLMM_ConstantTarget.LABEL=El destino debe tener al menos dos valores de datos v\u00e1lidos distintos cuando se utiliza la distribuci\u00f3n multinomial.
kGLMM_ResGroupingWhileNoRepMeasure.LABEL=Se ha especificado ning\u00fan campo de medidas repetidas, por lo que no se ha creado ninguna parte de medidas repetidas del modelo.
kGLMM_EMMeansHasContinuousFieldInEffect.LABEL=Todos los t\u00e9rminos de medias marginales estimadas deben ser campos categ\u00f3ricos.
kGLMM_EMMeansEffectIsMoreThan3Ways.LABEL=No se pueden especificar m\u00e1s de tres campos en un solo t\u00e9rmino de medias marginales estimadas.
kGLMM_EMMeansContrastFieldIsNotInEffect.LABEL=El campo de contraste debe ser tambi\u00e9n un t\u00e9rmino en la especificaci\u00f3n de medias marginales estimadas.
kGLMM_EMMeansContrastFieldGoAgainstNestingRules.LABEL=El campo de contraste no es adecuado en un efecto anidado en la especificaci\u00f3n de medias marginales estimadas.
kGLMM_TargetReferenceValueIsNotInDataSet.LABEL=No se puede encontrar el valor de referencia para el destino en el conjunto de datos.
kGLMM_NoValidCasesForSpecifiedLinkFunction.LABEL=No hay registros v\u00e1lidos para la funci\u00f3n de enlace {0}. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_RMatrixIsNotPositiveInIteProcess.LABEL=La matriz de covarianzas de los residuos no es definida positiva en el proceso iterativo. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_NumericalOverflowByLargeCovariateValue.LABEL=No se puede crear el modelo porque se ha producido un desbordamiento num\u00e9rico debido a valores de covariable de gran tama\u00f1o. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_DuplicateRandomEffectBlockFound.LABEL=Se ha encontrado al menos un bloque de efectos aleatorios duplicado. Se ignorar\u00e1n todos los bloques de efectos aleatorios duplicados.
kGLMM_DuplicateEMMeansSpecFound.LABEL=Se ha encontrado al menos una especificaci\u00f3n de medias marginales estimadas duplicada. Se ignorar\u00e1n todas las especificaciones de medias marginales estimadas duplicadas.
kGLMM_ContFieldHaveAnotherEffectNestedInIt.LABEL=Un campo continuo no puede tener otro efecto anidado dentro de \u00e9l.
kGLMM_MaxIterReachedButNotConv.LABEL=Se ha alcanzado el n\u00famero m\u00e1ximo de iteraciones pero no se ha conseguido la convergencia. Se muestran los resultados de la \u00faltima iteraci\u00f3n. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_GMatrIsNotPositive.LABEL=La matriz de covarianzas estimada de los efectos aleatorios (la matriz G) no es definida positiva. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_CompleteSeparation4BinomialAndNominal.LABEL=Es posible que haya una separaci\u00f3n completa en los datos. Las estimaciones de m\u00e1xima verosimilitud no existen. El procedimiento contin\u00faa a pesar de este aviso. Los resultados subsiguientes producidos se basan en la \u00faltima iteraci\u00f3n. La validez del ajuste de modelo es incierta.
kGLMM_RecordsFoundWithNonPositiveAnalysisWeightValue.LABEL=Los valores de datos de ponderaci\u00f3n de an\u00e1lisis deben ser positivos.
kGLMM_InvalidOrMissingRecordsAreFiltered.LABEL=Uno o m\u00e1s registros no se utilizan en el an\u00e1lisis porque contienen uno o m\u00e1s campos con valores que faltan o que no son v\u00e1lidos.
kGLMM_InvalidEventTrialsRecordsAreFiltered.LABEL=Los valores v\u00e1lidos para variables de eventos (destino) y ensayos son enteros no negativos y positivos respectivamente, y el n\u00famero de ensayos no puede ser inferior al n\u00famero de eventos. 
kGLMM_SubjectWithContField.LABEL=Todos los campos de sujetos deben tener un nivel de medici\u00f3n categ\u00f3rico.
kGLMM_GroupInRandomWithContField.LABEL=Todos los campos de agrupaci\u00f3n deben tener un nivel de medici\u00f3n categ\u00f3rico.
kGLMM_AllCasesWithNegativeMu.LABEL=Todos los valores predichos se han convertido en negativos durante el proceso iterativo. Los valores negativos no son v\u00e1lidos para la distribuci\u00f3n de probabilidad {0}. No se mostrar\u00e1 ning\u00fan resultado.
kGLMM_SpatialFieldIsNotInMetadata.LABEL= El campo "{0}" especificado como un campo espacial no se ha encontrado en el origen de datos.
kGLMM_SpatialFieldIsNotCon.LABEL=El campo "{0}" especificado como un campo espacial no es continuo.  Todos los campos espaciales deben ser campos continuos.
kGLMM_SpatialFieldIsNotDefinedForSpatialCovariance.LABEL=Los campos espaciales no est\u00e1n definidos para el tipo de covarianza espacial "{0}". Es necesario al menos un campo espacial continuo para el tipo de covarianza espacial seleccionado.
kGLMM_RepeatMeasureIsNotDefinedForSpatialCovariance.LABEL=Los campos de medidas repetidas no est\u00e1n definidos para el tipo de covarianza espacial "{0}". Es necesario al menos un campo de medidas repetidas para el tipo de covarianza espacial. En realidad el proceso utiliza el tipo de covarianza "ID".
kGLMM_ZeroDistancesInCorSpatial.LABEL=Existe un valor de distancia cero en la matriz espacial. Podr\u00eda estar provocado por un mismo valor de lista c para un registro diferente.
kGLMM_OneRecordInOneCombinationOfSubjectAndGroup.LABEL=Existe solo un registro en una combinaci\u00f3n de asunto y grupo en los datos.
kGLMM_CovStructChangeToUnstructureAsRepeatedBEffHasOneLevel.LABEL=La estructura de covarianzas se ha modificado a sin estructura porque la variable repetida B solo tiene un nivel.
kGLMM_CovStructChangeToUnstructureAsRepeatedNotEqualTwo.LABEL=La estructura de covarianzas se ha cambiado a sin estructura porque el n\u00famero de variables repetidas no es igual a 2.
kGLMM_RobustChangeModelAsRepeatedKR.LABEL=Puesto que se ha seleccionado el m\u00e9todo Kenward-Roger, el m\u00e9todo de covarianza s\u00f3lida se ha modificado al m\u00e9todo de covarianza basada en modelo.
kGLMM_CovStructChangeToUnstructureAsOnlyReppeatedOrKroneck.LABEL =La estructura de covarianzas se ha modificado a sin estructura porque las variables de medida Kronecker no se han especificado.
kGLMM_SameReppeatedandKronecker.LABEL=Las listas Medida repetida y Medida Kronecker son las mismas para la estructura de covarianzas seleccionada. El ajuste del modelo podr\u00eda no ser apropiado.
kGLMM_ErrorInSettingForKroneckerType.LABEL=Las medidas Repetida y Kronecker se han especificado ambas, pero el tipo de covarianza "{0}" no es el tipo Kronecker.

# Common error message
kMCCANCEL.LABEL=Se cancel\u00f3 el an\u00e1lisis tras una solicitud de cancelaci\u00f3n.
kMC_IO_ERROR.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n. 
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Memoria insuficiente. No se mostrar\u00e1 ning\u00fan resultado.
kMC_WRONG_STATE.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.
kMC_CREATE_OR_WRITE_TEMPORARY_FILE_ERROR.LABEL=Hay un problema al crear o escribir un archivo temporal. Aseg\u00farese de que la ruta del directorio temporal es v\u00e1lida, que dispone de acceso de escritura al directorio y que el disco tiene suficiente espacio libre.
kMCCom_BadVarIndex.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCCom_NoMetadataForVar.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_InternalError.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_DataSourceError.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_NoRecordsFound.LABEL=No se han encontrado registros en el origen de datos.
kMCRegr_RecordTooShort.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_InvalidRecordValue.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_LMatrixEmpty.LABEL=No se puede calcular porque hay cero grados de libertad.
kMCRegr_LMatrixNCols.LABEL=Ha ocurrido un error interno durante la ejecuci\u00f3n.  
kMCRegr_GEFMatrixEmpty.LABEL=No se puede calcular porque hay cero grados de libertad.

# Process report
PreparedDataHandleMsg.LABEL=Preparaci\u00f3n de gesti\u00f3n de datos completada
HandleDataProcessMsg.LABEL=Proceso de datos de identificaci\u00f3n : {0} %
HandleDataProcessEndMsg.LABEL=Proceso de gesti\u00f3n de datos completado
ExportPmmlProgressMsg.LABEL=Exportaci\u00f3n de modelo a archivo PMML completado

# Saved field labels
kGLMM_PredictedValue_0=Valor predicho
kGLMM_PredictedProbability_2=Probabilidad predicha para {0} = {1}
kGLMM_CumulativePredictedProbability_2=Probabilidad acumulada predicha para {0} = {1}
kGLMM_ConfidencePP_0=Confianza en el valor predicho (Probabilidad predicha)
kGLMM_ConfidencePI_0=Confianza en el valor predicho (Mejora de probabilidad)
kGLMM_CILower_0=L\u00edmite inferior de CI para el valor predicho
kGLMM_CILower_2=L\u00edmite inferior de CI para la probabilidad predicha para {0} = {1}
kGLMM_CumulativeCILower_2=L\u00edmite inferior de CI para la probabilidad acumulada predicha para {0} = {1}
kGLMM_CIUpper_0=L\u00edmite superior de CI para el valor predicho
kGLMM_CIUpper_2=L\u00edmite superior de CI para la probabilidad predicha para {0} = {1}
kGLMM_CumulativeCIUpper_2=L\u00edmite superior de CI para la probabilidad acumulada predicha para {0} = {1}
kGLMM_PearsonResidual_0=Residuo de Pearson

# Parameters in some messages
CLOGLOG=CLOGLOG
IDENTITY=IDENTITY
LOG=LOG
LOGC=LOGC
LOGIT=LOGIT
NLOGLOG=NLOGLOG
POWER=POTENCIA
PROBIT=PROBIT
fixed=fijo
random=aleatorio
gamma=gamma
inverse_Gaussian=De Gauss inversa
negative_binomial=binomial negativa
Poisson=Poisson

# mcpeer error message
kMCPeerErr_InvalidFrequencyWeight.LABEL=El campo de ponderaci\u00f3n de frecuencia debe ser num\u00e9rico
