#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2019
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

glmm=Modelli lineari generalizzati misti

# GLMM error and warning messages
kGLMM_NullPointer.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione. 
kGLMM_VarInFixedEffectCanNotBeTargetOrTrials.LABEL=Un campo non pu\u00f2 essere specificato come {0} e come parte di un effetto fisso.
kGLMM_VarInRandomEffectCanNotBeTargetOrTrials.LABEL=Un campo non pu\u00f2 essere specificato come {0} e come parte di un effetto casuale.
kGLMM_DuplicatedEffectInFixed.LABEL=\u00c8 stato trovato almeno un effetto {0} duplicato. Tutti gli effetti duplicati verranno ignorati.
kGLMM_VarInSomeRolesCanNotBeTargetOrTrials.LABEL=Un campo non pu\u00f2 essere specificato come {0} e come {1}.
kGLMM_OffsetCanNotBeSomeOtherRole.LABEL=Un campo non pu\u00f2 essere specificato come offset e come {0}.
kGLMM_DuplicatedVarInRepeatedSubjectAndMeasure.LABEL=I campi non possono essere specificati come soggetti e misure ripetute.
kGLMM_AnalysisWeightCanNotBeSomeOtherRole.LABEL=Un campo non pu\u00f2 essere specificato come peso dell'analisi e come {0}.
kGLMM_RepeatedMeasureAsSubjectInRandom.LABEL=I campi non possono essere specificati come soggetti e misure ripetute.
kGLMM_RandomSubjectNotInRepeated.LABEL=Almeno un campo soggetto effetto casuale non \u00e8 specificato come un campo soggetto nella specifica della struttura di dati.
kGLMM_NoSubjectInRepeated.LABEL=La parola chiave SUBJECT \u00e8 richiesta quando si utilizza il sottocomando DATA_STRUCTURE.
kGLMM_DuplicatedEffectInRandoms.LABEL=\u00c8 stato trovato almeno un effetto {0} duplicato. Tutti gli effetti duplicati verranno ignorati.
kGLMM_NoEffectsInRandom.LABEL=Non \u00e8 stato specificato alcun effetto casuale in almeno un blocco di effetti casuali.
kGLMM_GroupingOnRandEffIsNotSupportedForMultinomial.LABEL=I raggruppamenti nei blocchi di effetti casuali non sono supportati per la distribuzione della probabilit\u00e0 multinomiale.
kGLMM_UnmatchedDistributionAndLink.LABEL=\u00c8 stata specificata una combinazione non valida di impostazione collegamento e  distribuzione.
kGLMM_InsufficientMemory.LABEL=Memoria insufficiente. Non verr\u00e0 visualizzato alcun output.
kGLMM_NoValidCase.LABEL=Non vi sono record validi.
kGLMM_DuplicatedRepeatedLevels.LABEL=I livelli dell'effetto delle misure ripetute non sono differenti per ogni caso  all'interno di un soggetto ripetuto.
kGLMM_DuplicatedRepeatedLevelForCaseWeight.LABEL=Poich\u00e9 alcuni pesi della frequenza validi sono maggiori di 1, i livelli dell'effetto delle misure ripetute non sono differenti per ogni caso  all'interno di un soggetto ripetuto.
kGLMM_UndistinctDependentDataInBinomial.LABEL=L'obiettivo deve avere due valori di dati validi distinti quando si utilizza la distribuzione binomiale.
kGLMM_IllegalDependentValInGammaOrIGauss.LABEL=I valori dei dati obiettivo per la distribuzione della probabilit\u00e0 {0} devono essere positivi.
kGLMM_IllegalDependentValInNebinomialOrPoisson.LABEL=I valori dei dati obiettivo per la distribuzione della probabilit\u00e0 {0} devono essere interi non negativi.
kGLMM_InvalidInitialValue.LABEL=Errore: il file o elenco di valori iniziali contiene dati non validi o insufficienti. Devono essere forniti valori iniziali per tutti i parametri (inclusi i parametri ridondanti, se si tratta di un modello lineare generalizzato). L'ordine dei valori iniziali deve corrispondere a quello dei parametri del modello utilizzati dalla procedura.
kGLMM_IterationTerminatedButNoConv.LABEL=L'iterazione \u00e8 stata terminata, ma la convergenza non \u00e8 stata ottenuta. Viene visualizzato l'output dell'ultima iterazione. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_ConvButHessianNotPositive.LABEL=La matrice hessiana finale non \u00e8 definita positiva bench\u00e9 tutti i criteri di convergenza siano soddisfatti. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_QuasiCompleteSeparation.LABEL=Potrebbe esistere una separazione quasi completa nei dati. Non esistono stime di verosimiglianza massima. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_InvalidCaseInLastIteration.LABEL=Esiste almeno un record non valido nell'ultima iterazione. Un record non \u00e8 valido se sono presenti errori nel calcolo della funzione di collegamento {0} inversa, della verosimiglianza logaritmica, del gradiente o della matrice hessiana nel processo iterativo. Non verr\u00e0 visualizzato alcun output.
kGLMM_FrequencyWeightVarInCovariate.LABEL=Il peso della frequenza non pu\u00f2 essere utilizzato in altri ruoli.
kGLMM_VarInFixedEffectCanNotBeAnalysisWeightOrOffset.LABEL=Un campo non pu\u00f2 essere specificato come parte di un effetto fisso e come {0}.
kGLMM_VarInRandomEffectCanNotBeAnalysisWeightOrOffset.LABEL=Un campo non pu\u00f2 essere specificato come parte di un effetto casuale e come {0}.
kGLMM_DuplicatedFactorInEffect.LABEL=Un campo categoriale \u00e8 stato specificato pi\u00f9 di una volta nell'effetto. Pu\u00f2 essere specificato una sola volta.
kGLMM_InternalError.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione. 
kGLMM_TargetIsNotCatForMultinomial.LABEL=L'obiettivo deve avere un livello di misurazione categoriale se si specifica la distribuzione della probabilit\u00e0 multinomiale.
kGLMM_TargetIsNotContForSomeDistribution.LABEL=L'obiettivo deve avere un livello di misurazione continuo se si specifica la distribuzione della probabilit\u00e0 {0}
kGLMM_RegWeightFieldIsNotNumeric.LABEL=Il peso dell'analisi deve essere numerico.
kGLMM_OffsetFieldIsNotContinuous.LABEL=L'offset deve avere un livello di misurazione continuo.
kGLMM_FreWeightFieldIsNotNumeric.LABEL=Il campo peso della frequenza deve essere numerico.
kGLMM_EMMeansEffectIsNotInFixedEffect.LABEL=Tutti i termini delle medie marginali stimate devono essere anche effetti fissi.
kGLMM_EMMeansCovariateIsNotInCovariates.LABEL=Almeno un campo specificato come controllo delle medie marginali stimate non \u00e8 stato specificato anche come una covariata nel modello.
kGLMM_NumericalProblemInEstimation.LABEL=Il modello non pu\u00f2 essere creato perch\u00e9 si \u00e8 verificato un errore di calcolo durante la stima. Non verr\u00e0 visualizzato alcun output.
kGLMM_TargetIsNotCont4BinomialEventTrials.LABEL=L'obiettivo deve avere un livello di misurazione continuo se si specifica un campo Prove.
kGLMM_ConstantTarget.LABEL=L'obiettivo deve avere almeno due valori di dati validi distinti quando si utilizza la distribuzione multinomiale.
kGLMM_ResGroupingWhileNoRepMeasure.LABEL=Non \u00e8 stato specificato alcun campo misure ripetute, quindi non \u00e8 stata creata alcuna sezione misure ripetute del modello.
kGLMM_EMMeansHasContinuousFieldInEffect.LABEL=Tutti i termini delle medie marginali stimate devono essere campi categoriali.
kGLMM_EMMeansEffectIsMoreThan3Ways.LABEL=Non \u00e8 possibile specificare pi\u00f9 di tre campi in un unico termine delle medie marginali stimate.
kGLMM_EMMeansContrastFieldIsNotInEffect.LABEL=Anche il campo contrasto deve essere un termine nella specifica delle medie marginali stimate.
kGLMM_EMMeansContrastFieldGoAgainstNestingRules.LABEL=Il campo contrasto non \u00e8 appropriato in un effetto nidificato sulla specifica delle medie marginali stimate.
kGLMM_TargetReferenceValueIsNotInDataSet.LABEL=Impossibile trovare il valore di riferimento per l'obiettivo nel dataset.
kGLMM_NoValidCasesForSpecifiedLinkFunction.LABEL=Non vi sono record validi per la funzione di collegamento {0}. Non verr\u00e0 visualizzato alcun output.
kGLMM_RMatrixIsNotPositiveInIteProcess.LABEL=La matrice di covarianza dei residui non \u00e8 definita positiva nel processo iterativo. Non verr\u00e0 visualizzato alcun output.
kGLMM_NumericalOverflowByLargeCovariateValue.LABEL=Il modello non pu\u00f2 essere creato a causa dell'overflow numerico dovuto a valori di covariata elevati. Non verr\u00e0 visualizzato alcun output.
kGLMM_DuplicateRandomEffectBlockFound.LABEL=\u00c8 stato trovato almeno un blocco di effetti casuali duplicato. Tutti i blocchi di effetti casuali duplicati verranno ignorati.
kGLMM_DuplicateEMMeansSpecFound.LABEL=\u00c8 stata trovata almeno una specifica delle medie marginali stimate duplicata. Tutte le specifiche delle medie marginali stimate duplicate verranno ignorate.
kGLMM_ContFieldHaveAnotherEffectNestedInIt.LABEL=Un campo continuo non pu\u00f2 avere un altro effetto nidificato al suo interno.
kGLMM_MaxIterReachedButNotConv.LABEL=\u00c8 stato raggiunto il numero massimo di iterazioni, ma non \u00e8 stata ottenuta la convergenza. Viene visualizzato l'output dell'ultima iterazione. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_GMatrIsNotPositive.LABEL=La matrice di covarianza stimata degli effetti casuali (la matrice G) non \u00e8 definita positiva. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_CompleteSeparation4BinomialAndNominal.LABEL=Potrebbe esistere una separazione completa nei dati. Non esistono stime di verosimiglianza massima. La procedura continua nonostante questo avviso. I risultati successivi prodotti si basano sull'ultima iterazione. La validit\u00e0 dell'adattamento del modello \u00e8 incerta.
kGLMM_RecordsFoundWithNonPositiveAnalysisWeightValue.LABEL=I valori dei dati del peso dell'analisi devono essere positivi.
kGLMM_InvalidOrMissingRecordsAreFiltered.LABEL=Uno o pi\u00f9 record non sono utilizzati nell'analisi perch\u00e9 hanno uno o pi\u00f9 campi con valori non validi o mancanti.
kGLMM_InvalidEventTrialsRecordsAreFiltered.LABEL=I valori validi per variabili eventi (obiettivo) e prove sono rispettivamente interi non negativi e positivi, e il numero di prove non pu\u00f2 essere inferiore al numero di eventi. 
kGLMM_SubjectWithContField.LABEL=Tutti i campi dei soggetti devono avere un livello di misurazione categoriale.
kGLMM_GroupInRandomWithContField.LABEL=Tutti i campi di raggruppamento devono avere un livello di misurazione categoriale.
kGLMM_AllCasesWithNegativeMu.LABEL=Tutti i valori previsti sono diventati negativi durante il processo iterativo. I valori negativi non sono validi per la distribuzione della probabilit\u00e0 {0}. Non verr\u00e0 visualizzato alcun output.
kGLMM_SpatialFieldIsNotInMetadata.LABEL= Il campo "{0}" specificato come campo spaziale non \u00e8 stato trovato nell'origine dati.
kGLMM_SpatialFieldIsNotCon.LABEL=Il campo "{0}" specificato come campo spaziale non \u00e8 continuo.  Tutti i campi spaziali devono essere campi continui.
kGLMM_SpatialFieldIsNotDefinedForSpatialCovariance.LABEL=Campi spaziali non definiti per il tipo di covarianza spaziale "{0}". Per il tipo di covarianza spaziale selezionato \u00e8 richiesto almeno un campo spaziale continuo.
kGLMM_RepeatMeasureIsNotDefinedForSpatialCovariance.LABEL=Campi di misure ripetute non definiti per il tipo di covarianza spaziale "{0}". Per il tipo Covarianza spaziale \u00e8 richiesto almeno un campo Misure ripetute. Il processo attualmente utilizza il tipo di covarianza "ID".
kGLMM_ZeroDistancesInCorSpatial.LABEL=Esiste un valore relativo alla distanza pari a zero nella matrice spaziale. Tale valore pu\u00f2 essere causato dallo stesso valore c-list per differenti record.
kGLMM_OneRecordInOneCombinationOfSubjectAndGroup.LABEL=Nei dati esiste solo un record in una combinazione di soggetto e gruppo.
kGLMM_CovStructChangeToUnstructureAsRepeatedBEffHasOneLevel.LABEL=La struttura della covarianza \u00e8 stata modificata in Non strutturata perch\u00e9 la variabile ripetuta B ha un solo livello.
kGLMM_CovStructChangeToUnstructureAsRepeatedNotEqualTwo.LABEL=La struttura della covarianza \u00e8 stata modificata in Non strutturata perch\u00e9 il numero delle variabili ripetute non equivale a 2.
kGLMM_RobustChangeModelAsRepeatedKR.LABEL=Poich\u00e9 \u00e8 selezionato il metodo Kenward-Roger, il metodo di covarianza robusta viene modificato nel metodo di covarianza basata sul modello.
kGLMM_CovStructChangeToUnstructureAsOnlyReppeatedOrKroneck.LABEL =La struttura della covarianza \u00e8 stata modificata in Non strutturata perch\u00e9 le variabili di misura di Kronecker non sono specificate.
kGLMM_SameReppeatedandKronecker.LABEL=Gli elenchi delle misure ripeture e di Kronecker sono uguali per la struttura di covarianza selezionata. L'adattamento del modello potrebbe non essere appropriato.
kGLMM_ErrorInSettingForKroneckerType.LABEL=Le misure ripetute e di Kronecker sono entrambe specificate ma il tipo di covarianza "{0}" non \u00e8 di tipo Kronecker.

# Common error message
kMCCANCEL.LABEL=L'analisi \u00e8 stata interrotta in seguito a una richiesta di annullamento.
kMC_IO_ERROR.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione. 
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Memoria insufficiente. Non verr\u00e0 visualizzato alcun output.
kMC_WRONG_STATE.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.
kMC_CREATE_OR_WRITE_TEMPORARY_FILE_ERROR.LABEL=Problema nella creazione o scrittura di un file temporaneo. Verificare che il percorso della directory temporanea sia valido, che si disponga di accesso in scrittura alla directory e che sul disco sia disponibile spazio sufficiente.
kMCCom_BadVarIndex.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCCom_NoMetadataForVar.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_InternalError.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_DataSourceError.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_NoRecordsFound.LABEL=Nessun record trovato nell'origine dati.
kMCRegr_RecordTooShort.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_InvalidRecordValue.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_LMatrixEmpty.LABEL=Impossibile eseguire il calcolo perch\u00e9 esistono zero gradi di libert\u00e0.
kMCRegr_LMatrixNCols.LABEL=Si \u00e8 verificato un errore interno durante l'esecuzione.  
kMCRegr_GEFMatrixEmpty.LABEL=Impossibile eseguire il calcolo perch\u00e9 esistono zero gradi di libert\u00e0.

# Process report
PreparedDataHandleMsg.LABEL=Preparazione dell'handle di dati completata
HandleDataProcessMsg.LABEL=Processo handle di dati: {0} %
HandleDataProcessEndMsg.LABEL=Processo handle di dati completato
ExportPmmlProgressMsg.LABEL=Esportazione del modello nel file PMML completata

# Saved field labels
kGLMM_PredictedValue_0=Valore previsto
kGLMM_PredictedProbability_2=Probabilit\u00e0 prevista per {0} = {1}
kGLMM_CumulativePredictedProbability_2=Probabilit\u00e0 cumulativa prevista per {0} = {1}
kGLMM_ConfidencePP_0=Confidenza nel valore previsto (probabilit\u00e0 prevista)
kGLMM_ConfidencePI_0=Confidenza nel valore previsto (miglioramento probabilit\u00e0)
kGLMM_CILower_0=Limite inferiore di CI per il valore previsto
kGLMM_CILower_2=Limite inferiore di CI per la probabilit\u00e0 prevista per {0} = {1}
kGLMM_CumulativeCILower_2=Limite inferiore di CI per la probabilit\u00e0 cumulativa prevista per {0} = {1}
kGLMM_CIUpper_0=Limite superiore di CI per il valore previsto
kGLMM_CIUpper_2=Limite superiore di CI per la probabilit\u00e0 prevista per {0} = {1}
kGLMM_CumulativeCIUpper_2=Limite superiore di CI per la probabilit\u00e0 cumulativa prevista per {0} = {1}
kGLMM_PearsonResidual_0=Residuo di Pearson

# Parameters in some messages
CLOGLOG=CLOGLOG
IDENTITY=IDENTITY
LOG=LOG
LOGC=LOGC
LOGIT=LOGIT
NLOGLOG=NLOGLOG
POWER=POWER
PROBIT=PROBIT
fixed=fisso
random=casuale
gamma=gamma
inverse_Gaussian=gaussiana inversa
negative_binomial=binomiale negativa
Poisson=Poisson

# mcpeer error message
kMCPeerErr_InvalidFrequencyWeight.LABEL=Il campo peso della frequenza deve essere numerico
