#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2019
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

glmm=\u5e7f\u4e49\u7ebf\u6027\u6df7\u5408\u6a21\u578b

# GLMM error and warning messages
kGLMM_NullPointer.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kGLMM_VarInFixedEffectCanNotBeTargetOrTrials.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a {0} \u548c\u56fa\u5b9a\u6548\u5e94\u7684\u4e00\u90e8\u5206\u3002
kGLMM_VarInRandomEffectCanNotBeTargetOrTrials.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a {0} \u548c\u968f\u673a\u6548\u5e94\u7684\u4e00\u90e8\u5206\u3002
kGLMM_DuplicatedEffectInFixed.LABEL=\u81f3\u5c11\u627e\u5230\u4e86\u4e00\u4e2a\u91cd\u590d\u7684 {0} \u6548\u5e94\u3002\u5c06\u5ffd\u7565\u6240\u6709\u91cd\u590d\u6548\u5e94\u3002
kGLMM_VarInSomeRolesCanNotBeTargetOrTrials.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a {0} \u548c {1}\u3002
kGLMM_OffsetCanNotBeSomeOtherRole.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u504f\u79fb\u91cf\u548c {0}\u3002
kGLMM_DuplicatedVarInRepeatedSubjectAndMeasure.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u4e3b\u4f53\u548c\u91cd\u590d\u6d4b\u91cf\u3002
kGLMM_AnalysisWeightCanNotBeSomeOtherRole.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u5206\u6790\u6743\u91cd\u548c {0}\u3002
kGLMM_RepeatedMeasureAsSubjectInRandom.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u4e3b\u4f53\u548c\u91cd\u590d\u6d4b\u91cf\u3002
kGLMM_RandomSubjectNotInRepeated.LABEL=\u81f3\u5c11\u6709\u4e00\u4e2a\u968f\u673a\u6548\u5e94\u4e3b\u4f53\u5b57\u6bb5\u6ca1\u6709\u6307\u5b9a\u4e3a\u6570\u636e\u7ed3\u6784\u89c4\u8303\u4e2d\u7684\u4e3b\u4f53\u5b57\u6bb5\u3002
kGLMM_NoSubjectInRepeated.LABEL=\u5f53\u4f7f\u7528 DATA_STRUCTURE \u5b50\u547d\u4ee4\u65f6\u9700\u8981 SUBJECT \u5173\u952e\u5b57\u3002
kGLMM_DuplicatedEffectInRandoms.LABEL=\u81f3\u5c11\u627e\u5230\u4e86\u4e00\u4e2a\u91cd\u590d\u7684 {0} \u6548\u5e94\u3002\u5c06\u5ffd\u7565\u6240\u6709\u91cd\u590d\u6548\u5e94\u3002
kGLMM_NoEffectsInRandom.LABEL=\u81f3\u5c11\u5728\u4e00\u4e2a\u968f\u673a\u6548\u5e94\u5757\u4e0a\u6ca1\u6709\u6307\u5b9a\u968f\u673a\u6548\u5e94\u3002
kGLMM_GroupingOnRandEffIsNotSupportedForMultinomial.LABEL=\u4e0d\u652f\u6301\u5c06\u968f\u673a\u6548\u5e94\u5757\u5206\u7ec4\u7528\u4e8e\u591a\u9879\u6982\u7387\u5206\u5e03\u3002
kGLMM_UnmatchedDistributionAndLink.LABEL=\u6307\u5b9a\u4e86\u65e0\u6548\u7684\u5206\u5e03\u548c\u94fe\u63a5\u8bbe\u7f6e\u7ec4\u5408\u3002
kGLMM_InsufficientMemory.LABEL=\u5185\u5b58\u4e0d\u8db3\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_NoValidCase.LABEL=\u4e0d\u5b58\u5728\u6709\u6548\u8bb0\u5f55\u3002
kGLMM_DuplicatedRepeatedLevels.LABEL=\u5728\u91cd\u590d\u4e3b\u4f53\u4e2d\uff0c\u6bcf\u79cd\u60c5\u51b5\u7684\u91cd\u590d\u6d4b\u91cf\u6548\u5e94\u7ea7\u522b\u90fd\u4e0d\u76f8\u540c\u3002
kGLMM_DuplicatedRepeatedLevelForCaseWeight.LABEL=\u7531\u4e8e\u67d0\u4e9b\u6709\u6548\u9891\u7387\u6743\u91cd\u5927\u4e8e 1\uff0c\u56e0\u6b64\u91cd\u590d\u4e3b\u4f53\u4e2d\u6bcf\u79cd\u60c5\u51b5\u7684\u91cd\u590d\u6d4b\u91cf\u6548\u5e94\u7ea7\u522b\u90fd\u4e0d\u76f8\u540c\u3002
kGLMM_UndistinctDependentDataInBinomial.LABEL=\u5f53\u4f7f\u7528\u4e8c\u9879\u5206\u5e03\u65f6\uff0c\u76ee\u6807\u5fc5\u987b\u5177\u6709\u4e24\u4e2a\u4e0d\u540c\u7684\u6709\u6548\u6570\u636e\u503c\u3002
kGLMM_IllegalDependentValInGammaOrIGauss.LABEL={0} \u6982\u7387\u5206\u5e03\u7684\u76ee\u6807\u6570\u636e\u503c\u5fc5\u987b\u4e3a\u6b63\u6570\u3002
kGLMM_IllegalDependentValInNebinomialOrPoisson.LABEL={0} \u6982\u7387\u5206\u5e03\u7684\u76ee\u6807\u6570\u636e\u503c\u5fc5\u987b\u4e3a\u975e\u8d1f\u6574\u6570\u3002
kGLMM_InvalidInitialValue.LABEL=\u9519\u8bef\uff1a\u521d\u59cb\u503c\u5217\u8868\u6216\u6587\u4ef6\u5305\u542b\u65e0\u6548\u6570\u636e\u6216\u6570\u636e\u4e0d\u8db3\u3002\u5fc5\u987b\u4e3a\u6240\u6709\u53c2\u6570\uff08\u5305\u62ec\u4f7f\u7528\u5e7f\u4e49\u7ebf\u6027\u6a21\u578b\u65f6\u7684\u5197\u4f59\u53c2\u6570\uff09\u63d0\u4f9b\u521d\u59cb\u503c\u3002\u521d\u59cb\u503c\u6392\u5e8f\u5e94\u5bf9\u5e94\u4e8e\u8fc7\u7a0b\u4f7f\u7528\u7684\u6a21\u578b\u53c2\u6570\u7684\u6392\u5e8f\u3002
kGLMM_IterationTerminatedButNoConv.LABEL=\u8fed\u4ee3\u5df2\u7ec8\u6b62\uff0c\u4f46\u5c1a\u672a\u8fbe\u5230\u6536\u655b\u3002\u5c06\u663e\u793a\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u7684\u8f93\u51fa\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_ConvButHessianNotPositive.LABEL=\u867d\u7136\u6ee1\u8db3\u6240\u6709\u6536\u655b\u6807\u51c6\uff0c\u4f46\u6700\u7ec8\u7684\u6d77\u68ee\u77e9\u9635\u5e76\u975e\u6b63\u5b9a\u77e9\u9635\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_QuasiCompleteSeparation.LABEL=\u6570\u636e\u4e2d\u53ef\u80fd\u5b58\u5728\u51c6\u5b8c\u5168\u5206\u79bb\u3002\u6781\u5927\u4f3c\u7136\u4f30\u8ba1\u4e0d\u5b58\u5728\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_InvalidCaseInLastIteration.LABEL=\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u4e2d\u81f3\u5c11\u5b58\u5728\u4e00\u6761\u65e0\u6548\u8bb0\u5f55\u3002\u5982\u679c\u5728\u8fed\u4ee3\u5f0f\u8fc7\u7a0b\u4e2d\u8ba1\u7b97\u9006 {0} \u5173\u8054\u51fd\u6570\u3001\u5bf9\u6570\u4f3c\u7136\u3001\u68af\u5ea6\u6216\u6d77\u68ee\u77e9\u9635\u65f6\u53d1\u751f\u9519\u8bef\uff0c\u90a3\u4e48\u8bb0\u5f55\u65e0\u6548\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_FrequencyWeightVarInCovariate.LABEL=\u9891\u7387\u6743\u91cd\u4e0d\u80fd\u5728\u4efb\u4f55\u5176\u4ed6\u89d2\u8272\u4e2d\u4f7f\u7528\u3002
kGLMM_VarInFixedEffectCanNotBeAnalysisWeightOrOffset.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u56fa\u5b9a\u6548\u5e94\u7684\u4e00\u90e8\u5206\u548c {0}\u3002
kGLMM_VarInRandomEffectCanNotBeAnalysisWeightOrOffset.LABEL=\u5b57\u6bb5\u4e0d\u80fd\u6307\u5b9a\u4e3a\u968f\u673a\u6548\u5e94\u7684\u4e00\u90e8\u5206\u548c {0}\u3002
kGLMM_DuplicatedFactorInEffect.LABEL=\u5728\u6548\u5e94\u4e2d\u591a\u6b21\u6307\u5b9a\u4e86\u67d0\u4e2a\u5206\u7c7b\u5b57\u6bb5\u3002\u53ea\u80fd\u6307\u5b9a\u4e00\u6b21\u3002
kGLMM_InternalError.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kGLMM_TargetIsNotCatForMultinomial.LABEL=\u5982\u679c\u6307\u5b9a\u4e86\u591a\u9879\u6982\u7387\u5206\u5e03\uff0c\u90a3\u4e48\u76ee\u6807\u5fc5\u987b\u5177\u6709\u5206\u7c7b\u6d4b\u91cf\u7ea7\u522b\u3002
kGLMM_TargetIsNotContForSomeDistribution.LABEL=\u5982\u679c\u6307\u5b9a\u4e86 {0} \u6982\u7387\u5206\u5e03\uff0c\u90a3\u4e48\u76ee\u6807\u5fc5\u987b\u5177\u6709\u8fde\u7eed\u6d4b\u91cf\u7ea7\u522b
kGLMM_RegWeightFieldIsNotNumeric.LABEL=\u5206\u6790\u6743\u91cd\u5fc5\u987b\u662f\u6570\u5b57\u3002
kGLMM_OffsetFieldIsNotContinuous.LABEL=\u504f\u79fb\u91cf\u5fc5\u987b\u5177\u6709\u8fde\u7eed\u6d4b\u91cf\u7ea7\u522b\u3002
kGLMM_FreWeightFieldIsNotNumeric.LABEL=\u9891\u7387\u6743\u91cd\u5b57\u6bb5\u5fc5\u987b\u662f\u6570\u5b57\u3002
kGLMM_EMMeansEffectIsNotInFixedEffect.LABEL=\u6240\u6709\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u9879\u4e5f\u5fc5\u987b\u662f\u56fa\u5b9a\u6548\u5e94\u3002
kGLMM_EMMeansCovariateIsNotInCovariates.LABEL=\u81f3\u5c11\u6709\u4e00\u4e2a\u6307\u5b9a\u4e3a\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u63a7\u5236\u7684\u5b57\u6bb5\u6ca1\u6709\u540c\u65f6\u6307\u5b9a\u4e3a\u6a21\u578b\u4e2d\u7684\u534f\u53d8\u91cf\u3002
kGLMM_NumericalProblemInEstimation.LABEL=\u65e0\u6cd5\u6784\u5efa\u6a21\u578b\uff0c\u56e0\u4e3a\u4f30\u8ba1\u671f\u95f4\u53d1\u751f\u8ba1\u7b97\u9519\u8bef\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_TargetIsNotCont4BinomialEventTrials.LABEL=\u5982\u679c\u6307\u5b9a\u4e86\u8bd5\u9a8c\u5b57\u6bb5\uff0c\u90a3\u4e48\u76ee\u6807\u5fc5\u987b\u5177\u6709\u8fde\u7eed\u6d4b\u91cf\u7ea7\u522b\u3002
kGLMM_ConstantTarget.LABEL=\u5f53\u4f7f\u7528\u591a\u9879\u5206\u5e03\u65f6\uff0c\u76ee\u6807\u5fc5\u987b\u81f3\u5c11\u5177\u6709\u4e24\u4e2a\u4e0d\u540c\u7684\u6709\u6548\u6570\u636e\u503c\u3002
kGLMM_ResGroupingWhileNoRepMeasure.LABEL=\u672a\u6307\u5b9a\u4efb\u4f55\u91cd\u590d\u6d4b\u91cf\u5b57\u6bb5\uff0c\u56e0\u6b64\u6ca1\u6709\u6784\u5efa\u6a21\u578b\u7684\u91cd\u590d\u6d4b\u91cf\u90e8\u5206\u3002
kGLMM_EMMeansHasContinuousFieldInEffect.LABEL=\u6240\u6709\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u9879\u5fc5\u987b\u662f\u5206\u7c7b\u5b57\u6bb5\u3002
kGLMM_EMMeansEffectIsMoreThan3Ways.LABEL=\u5355\u4e2a\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u9879\u4e2d\u6700\u591a\u53ef\u4ee5\u6307\u5b9a\u4e09\u4e2a\u5b57\u6bb5\u3002
kGLMM_EMMeansContrastFieldIsNotInEffect.LABEL=\u5bf9\u6bd4\u5b57\u6bb5\u8fd8\u5fc5\u987b\u662f\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u89c4\u8303\u4e2d\u7684\u9879\u3002
kGLMM_EMMeansContrastFieldGoAgainstNestingRules.LABEL=\u5bf9\u6bd4\u5b57\u6bb5\u4e0d\u9002\u7528\u4e8e\u4f30\u8ba1\u7684\u8fb9\u9645\u5747\u503c\u89c4\u8303\u4e2d\u7684\u5d4c\u5957\u6548\u5e94\u3002
kGLMM_TargetReferenceValueIsNotInDataSet.LABEL=\u5728\u6570\u636e\u96c6\u4e2d\u627e\u4e0d\u5230\u76ee\u6807\u7684\u53c2\u8003\u503c\u3002
kGLMM_NoValidCasesForSpecifiedLinkFunction.LABEL=\u4e0d\u5b58\u5728 {0} \u5173\u8054\u51fd\u6570\u7684\u6709\u6548\u8bb0\u5f55\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_RMatrixIsNotPositiveInIteProcess.LABEL=\u6b8b\u5dee\u7684\u534f\u65b9\u5dee\u77e9\u9635\u5728\u8fed\u4ee3\u5f0f\u8fc7\u7a0b\u4e2d\u5e76\u975e\u6b63\u5b9a\u77e9\u9635\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_NumericalOverflowByLargeCovariateValue.LABEL=\u7531\u4e8e\u5927\u91cf\u534f\u53d8\u91cf\u503c\u5bfc\u81f4\u6570\u5b57\u6ea2\u51fa\uff0c\u56e0\u6b64\u65e0\u6cd5\u6784\u5efa\u6a21\u578b\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_DuplicateRandomEffectBlockFound.LABEL=\u81f3\u5c11\u627e\u5230\u4e86\u4e00\u4e2a\u91cd\u590d\u7684\u968f\u673a\u6548\u5e94\u5757\u3002\u5c06\u5ffd\u7565\u6240\u6709\u91cd\u590d\u7684\u968f\u673a\u6548\u5e94\u5757\u3002
kGLMM_DuplicateEMMeansSpecFound.LABEL=\u81f3\u5c11\u627e\u5230\u4e86\u4e00\u4e2a\u91cd\u590d\u7684\u4f30\u8ba1\u8fb9\u9645\u5747\u503c\u89c4\u8303\u3002\u5c06\u5ffd\u7565\u6240\u6709\u91cd\u590d\u7684\u4f30\u8ba1\u8fb9\u9645\u5747\u503c\u89c4\u8303\u3002
kGLMM_ContFieldHaveAnotherEffectNestedInIt.LABEL=\u8fde\u7eed\u5b57\u6bb5\u4e0d\u80fd\u5c06\u5176\u4ed6\u6548\u5e94\u5d4c\u5957\u5176\u4e2d\u3002
kGLMM_MaxIterReachedButNotConv.LABEL=\u8fbe\u5230\u4e86\u6700\u5927\u8fed\u4ee3\u6b21\u6570\uff0c\u4f46\u6ca1\u6709\u8fbe\u5230\u6536\u655b\u3002\u5c06\u663e\u793a\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u7684\u8f93\u51fa\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_GMatrIsNotPositive.LABEL=\u4f30\u8ba1\u7684\u968f\u673a\u6548\u5e94\u534f\u65b9\u5dee\u77e9\u9635\uff08G \u77e9\u9635\uff09\u4e0d\u662f\u6b63\u5b9a\u77e9\u9635\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_CompleteSeparation4BinomialAndNominal.LABEL=\u6570\u636e\u4e2d\u53ef\u80fd\u5b58\u5728\u5b8c\u5168\u5206\u79bb\u3002\u6781\u5927\u4f3c\u7136\u4f30\u8ba1\u4e0d\u5b58\u5728\u3002\u5c3d\u7ba1\u51fa\u73b0\u6b64\u8b66\u544a\uff0c\u8be5\u8fc7\u7a0b\u4ecd\u7ee7\u7eed\u3002\u4ea7\u751f\u7684\u540e\u7eed\u7ed3\u679c\u57fa\u4e8e\u6700\u540e\u4e00\u6b21\u8fed\u4ee3\u3002\u6a21\u578b\u62df\u5408\u5ea6\u7684\u6709\u6548\u6027\u4e0d\u786e\u5b9a\u3002
kGLMM_RecordsFoundWithNonPositiveAnalysisWeightValue.LABEL=\u5206\u6790\u6743\u91cd\u6570\u636e\u503c\u5fc5\u987b\u662f\u6b63\u6570\u3002
kGLMM_InvalidOrMissingRecordsAreFiltered.LABEL=\u5206\u6790\u4e2d\u6ca1\u6709\u4f7f\u7528\u4e00\u6761\u6216\u591a\u6761\u8bb0\u5f55\uff0c\u56e0\u4e3a\u5b83\u4eec\u5305\u542b\u5177\u6709\u65e0\u6548\u6216\u7f3a\u5931\u503c\u7684\u4e00\u4e2a\u6216\u591a\u4e2a\u5b57\u6bb5\u3002
kGLMM_InvalidEventTrialsRecordsAreFiltered.LABEL=\u4e8b\u4ef6\uff08\u76ee\u6807\uff09\u548c\u8bd5\u9a8c\u53d8\u91cf\u7684\u6709\u6548\u503c\u5206\u522b\u4e3a\u975e\u8d1f\u6b63\u6570\u548c\u6b63\u6574\u6570\uff0c\u8bd5\u9a8c\u6b21\u6570\u4e0d\u80fd\u5c0f\u4e8e\u4e8b\u4ef6\u6570\u91cf\u3002
kGLMM_SubjectWithContField.LABEL=\u6240\u6709\u4e3b\u4f53\u5b57\u6bb5\u90fd\u5fc5\u987b\u5177\u6709\u5206\u7c7b\u6d4b\u91cf\u7ea7\u522b\u3002
kGLMM_GroupInRandomWithContField.LABEL=\u6240\u6709\u5206\u7ec4\u5b57\u6bb5\u90fd\u5fc5\u987b\u5177\u6709\u5206\u7c7b\u6d4b\u91cf\u7ea7\u522b\u3002
kGLMM_AllCasesWithNegativeMu.LABEL=\u5728\u8fed\u4ee3\u5f0f\u8fc7\u7a0b\u4e2d\uff0c\u6240\u6709\u9884\u6d4b\u503c\u90fd\u53d8\u4e3a\u8d1f\u503c\u3002\u8d1f\u503c\u5bf9\u4e8e {0} \u6982\u7387\u5206\u5e03\u65e0\u6548\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kGLMM_SpatialFieldIsNotInMetadata.LABEL= \u5728\u6570\u636e\u6e90\u4e2d\u6ca1\u6709\u627e\u5230\u6307\u5b9a\u4e3a\u7a7a\u95f4\u5b57\u6bb5\u7684\u5b57\u6bb5\u201c{0}\u201d\u3002
kGLMM_SpatialFieldIsNotCon.LABEL=\u6307\u5b9a\u4e3a\u7a7a\u95f4\u5b57\u6bb5\u7684\u5b57\u6bb5\u201c{0}\u201d\u4e0d\u662f\u8fde\u7eed\u7684\u3002\u6240\u6709\u7a7a\u95f4\u5b57\u6bb5\u90fd\u5e94\u662f\u8fde\u7eed\u5b57\u6bb5\u3002
kGLMM_SpatialFieldIsNotDefinedForSpatialCovariance.LABEL=\u6ca1\u6709\u4e3a\u7a7a\u95f4\u534f\u65b9\u5dee\u7c7b\u578b\u201c{0}\u201d\u5b9a\u4e49\u7a7a\u95f4\u5b57\u6bb5\u3002\u6240\u9009\u7a7a\u95f4\u534f\u65b9\u5dee\u7c7b\u578b\u9700\u8981\u81f3\u5c11\u4e00\u4e2a\u8fde\u7eed\u7a7a\u95f4\u5b57\u6bb5\u3002
kGLMM_RepeatMeasureIsNotDefinedForSpatialCovariance.LABEL=\u6ca1\u6709\u4e3a\u7a7a\u95f4\u534f\u65b9\u5dee\u7c7b\u578b\u201c{0}\u201d\u5b9a\u4e49\u91cd\u590d\u7684\u6d4b\u91cf\u5b57\u6bb5\u3002\u7a7a\u95f4\u534f\u65b9\u5dee\u7c7b\u578b\u9700\u8981\u81f3\u5c11\u4e00\u4e2a\u91cd\u590d\u5ea6\u91cf\u5b57\u6bb5\u3002\u8be5\u8fc7\u7a0b\u5b9e\u9645\u4f7f\u7528\u201c\u6807\u8bc6\u201d\u534f\u65b9\u5dee\u7c7b\u578b\u3002
kGLMM_ZeroDistancesInCorSpatial.LABEL=\u201c\u7a7a\u95f4\u201d\u77e9\u9635\u4e2d\u5b58\u5728\u96f6\u8ddd\u79bb\u3002\u53ef\u80fd\u7531\u4e0d\u540c\u8bb0\u5f55\u7684\u76f8\u540c c \u5217\u8868\u503c\u6240\u5bfc\u81f4\u3002
kGLMM_OneRecordInOneCombinationOfSubjectAndGroup.LABEL=\u6570\u636e\u7684\u4e3b\u9898\u548c\u7ec4\u7ec4\u5408\u4e2d\u4ec5\u5b58\u5728\u4e00\u6761\u8bb0\u5f55\u3002
kGLMM_CovStructChangeToUnstructureAsRepeatedBEffHasOneLevel.LABEL=\u7531\u4e8e\u91cd\u590d\u53d8\u91cf B \u53ea\u6709\u4e00\u4e2a\u7ea7\u522b\uff0c\u56e0\u6b64\u534f\u65b9\u5dee\u7ed3\u6784\u66f4\u6539\u4e3a\u201c\u975e\u7ed3\u6784\u5316\u201d\u3002
kGLMM_CovStructChangeToUnstructureAsRepeatedNotEqualTwo.LABEL=\u7531\u4e8e\u91cd\u590d\u53d8\u91cf\u6570\u76ee\u4e0d\u7b49\u4e8e 2\uff0c\u56e0\u6b64\u534f\u65b9\u5dee\u7ed3\u6784\u66f4\u6539\u4e3a\u201c\u975e\u7ed3\u6784\u5316\u201d\u3002
kGLMM_RobustChangeModelAsRepeatedKR.LABEL=\u56e0\u4e3a\u9009\u62e9\u4e86 Kenward-Roger \u6cd5\uff0c\u7a33\u5065\u534f\u65b9\u5dee\u6cd5\u66f4\u6539\u4e3a\u57fa\u4e8e\u6a21\u578b\u7684\u534f\u65b9\u5dee\u6cd5\u3002
kGLMM_CovStructChangeToUnstructureAsOnlyReppeatedOrKroneck.LABEL =\u56e0\u4e3a\u672a\u6307\u5b9a Kronecker \u6d4b\u91cf\u53d8\u91cf\uff0c\u56e0\u6b64\u534f\u65b9\u5dee\u7ed3\u6784\u66f4\u6539\u4e3a\u201c\u975e\u7ed3\u6784\u5316\u201d\u3002
kGLMM_SameReppeatedandKronecker.LABEL=\u6240\u9009\u534f\u65b9\u5dee\u7ed3\u6784\u7684\u201c\u91cd\u590d\u6d4b\u91cf\u201d\u5217\u8868\u4e0e\u201cKronecker \u6d4b\u91cf\u201d\u5217\u8868\u76f8\u540c\u3002\u6a21\u578b\u62df\u5408\u53ef\u80fd\u4e0d\u9002\u7528\u3002
kGLMM_ErrorInSettingForKroneckerType.LABEL=\u540c\u65f6\u6307\u5b9a\u4e86\u91cd\u590d\u6d4b\u91cf\u548c Kronecker \u6d4b\u91cf\uff0c\u4f46\u662f\u534f\u65b9\u5dee\u7c7b\u578b\u201c{0}\u201d\u5e76\u975e Kronecker \u7c7b\u578b\u3002

# Common error message
kMCCANCEL.LABEL=\u5728\u53d6\u6d88\u8bf7\u6c42\u540e\u653e\u5f03\u4e86\u5206\u6790\u3002
kMC_IO_ERROR.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=\u5185\u5b58\u4e0d\u8db3\u3002\u5c06\u4e0d\u663e\u793a\u4efb\u4f55\u8f93\u51fa\u3002
kMC_WRONG_STATE.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kMC_CREATE_OR_WRITE_TEMPORARY_FILE_ERROR.LABEL=\u521b\u5efa\u6216\u5199\u5165\u4e34\u65f6\u6587\u4ef6\u65f6\u53d1\u751f\u95ee\u9898\u3002\u8bf7\u786e\u4fdd\u4e34\u65f6\u76ee\u5f55\u8def\u5f84\u6709\u6548\uff0c\u60a8\u5177\u6709\u8be5\u76ee\u5f55\u7684\u5199\u8bbf\u95ee\u6743\uff0c\u5e76\u4e14\u78c1\u76d8\u5177\u6709\u8db3\u591f\u7684\u53ef\u7528\u7a7a\u95f4\u3002
kMCCom_BadVarIndex.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002

kMCCom_NoMetadataForVar.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kMCRegr_InternalError.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002

kMCRegr_DataSourceError.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002
kMCRegr_NoRecordsFound.LABEL=\u672a\u5728\u6570\u636e\u6e90\u4e2d\u53d1\u73b0\u8bb0\u5f55\u3002
kMCRegr_RecordTooShort.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002

kMCRegr_InvalidRecordValue.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002

kMCRegr_LMatrixEmpty.LABEL=\u7531\u4e8e\u81ea\u7531\u5ea6\u672a\u96f6\u800c\u65e0\u6cd5\u8ba1\u7b97\u3002
kMCRegr_LMatrixNCols.LABEL=\u6267\u884c\u671f\u95f4\u53d1\u751f\u5185\u90e8\u9519\u8bef\u3002

kMCRegr_GEFMatrixEmpty.LABEL=\u7531\u4e8e\u81ea\u7531\u5ea6\u672a\u96f6\u800c\u65e0\u6cd5\u8ba1\u7b97\u3002

# Process report
PreparedDataHandleMsg.LABEL=\u51c6\u5907\u6570\u636e\u5904\u7406\u5b8c\u6210
HandleDataProcessMsg.LABEL=\u5904\u7406\u6570\u636e\u8fc7\u7a0b\uff1a{0}%
HandleDataProcessEndMsg.LABEL=\u5904\u7406\u6570\u636e\u8fc7\u7a0b\u5b8c\u6210
ExportPmmlProgressMsg.LABEL=\u5bfc\u51fa\u6a21\u578b\u5230 PMML \u6587\u4ef6\u5b8c\u6210

# Saved field labels
kGLMM_PredictedValue_0=\u9884\u6d4b\u503c
kGLMM_PredictedProbability_2={0} \u7684\u9884\u6d4b\u6982\u7387 = {1}
kGLMM_CumulativePredictedProbability_2={0} \u7684\u9884\u6d4b\u7d2f\u79ef\u6982\u7387 = {1}
kGLMM_ConfidencePP_0=\u9884\u6d4b\u503c\u7f6e\u4fe1\u5ea6\uff08\u9884\u6d4b\u6982\u7387\uff09
kGLMM_ConfidencePI_0=\u9884\u6d4b\u503c\u7f6e\u4fe1\u5ea6\uff08\u6982\u7387\u6539\u8fdb\uff09
kGLMM_CILower_0=\u9884\u6d4b\u503c\u7684 CI \u4e0b\u9650
kGLMM_CILower_2={0} \u7684\u9884\u6d4b\u6982\u7387 CI \u4e0b\u9650 = {1}
kGLMM_CumulativeCILower_2={0} \u7684\u9884\u6d4b\u7d2f\u79ef\u6982\u7387 CI \u4e0b\u9650 = {1}
kGLMM_CIUpper_0=\u9884\u6d4b\u503c\u7684 CI \u4e0a\u9650
kGLMM_CIUpper_2={0} \u7684\u9884\u6d4b\u6982\u7387 CI \u4e0a\u9650 = {1}
kGLMM_CumulativeCIUpper_2={0} \u7684\u9884\u6d4b\u7d2f\u79ef\u6982\u7387 CI \u4e0a\u9650 = {1}
kGLMM_PearsonResidual_0=Pearson \u6b8b\u5dee
# Parameters in some messages
CLOGLOG=CLOGLOG
IDENTITY=IDENTITY
LOG=LOG
LOGC=LOGC
LOGIT=LOGIT
NLOGLOG=NLOGLOG
POWER=POWER
PROBIT=PROBIT
fixed=\u56fa\u5b9a
random=\u968f\u673a
gamma=\u4f3d\u739b
inverse_Gaussian=\u9006\u9ad8\u65af
negative_binomial=\u8d1f\u4e8c\u9879\u5f0f
Poisson=\u6cca\u677e
# mcpeer error message
kMCPeerErr_InvalidFrequencyWeight.LABEL=\u9891\u7387\u6743\u91cd\u5b57\u6bb5\u5fc5\u987b\u662f\u6570\u5b57
