#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2019
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

glmm=\u5ee3\u7fa9\u7dda\u6027\u6df7\u5408\u6a21\u578b

# GLMM error and warning messages
kGLMM_NullPointer.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kGLMM_VarInFixedEffectCanNotBeTargetOrTrials.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba {0} \u53ca\u90e8\u5206\u56fa\u5b9a\u6548\u679c\u3002
kGLMM_VarInRandomEffectCanNotBeTargetOrTrials.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba {0} \u53ca\u90e8\u5206\u96a8\u6a5f\u6548\u679c\u3002
kGLMM_DuplicatedEffectInFixed.LABEL=\u627e\u5230\u81f3\u5c11\u4e00\u500b\u91cd\u8907\u7684 {0} \u6548\u679c\u3002\u5c07\u5ffd\u7565\u6240\u6709\u91cd\u8907\u6548\u679c\u3002
kGLMM_VarInSomeRolesCanNotBeTargetOrTrials.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba {0} \u53ca {1}\u3002
kGLMM_OffsetCanNotBeSomeOtherRole.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u504f\u79fb\u53ca {0}\u3002
kGLMM_DuplicatedVarInRepeatedSubjectAndMeasure.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u53d7\u8a66\u8005\u53ca\u91cd\u8907\u6e2c\u91cf\u3002
kGLMM_AnalysisWeightCanNotBeSomeOtherRole.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u5206\u6790\u52a0\u6b0a\u53ca {0}\u3002
kGLMM_RepeatedMeasureAsSubjectInRandom.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u53d7\u8a66\u8005\u53ca\u91cd\u8907\u6e2c\u91cf\u3002
kGLMM_RandomSubjectNotInRepeated.LABEL=\u81f3\u5c11\u4e00\u500b\u96a8\u6a5f\u6548\u679c\u53d7\u8a66\u8005\u6b04\u4f4d\u672a\u5728\u8cc7\u6599\u7d50\u69cb\u6307\u5b9a\u4e2d\u6307\u5b9a\u70ba\u53d7\u8a66\u8005\u6b04\u4f4d\u3002
kGLMM_NoSubjectInRepeated.LABEL=\u4f7f\u7528 DATA_STRUCTURE \u6b21\u6307\u4ee4\u6642\uff0c\u9700\u8981 SUBJECT \u95dc\u9375\u5b57\u3002
kGLMM_DuplicatedEffectInRandoms.LABEL=\u627e\u5230\u81f3\u5c11\u4e00\u500b\u91cd\u8907\u7684 {0} \u6548\u679c\u3002\u5c07\u5ffd\u7565\u6240\u6709\u91cd\u8907\u6548\u679c\u3002
kGLMM_NoEffectsInRandom.LABEL=\u5728\u81f3\u5c11\u4e00\u500b\u96a8\u6a5f\u6548\u679c\u5340\u584a\u4e0a\u672a\u6307\u5b9a\u4efb\u4f55\u96a8\u6a5f\u6548\u679c\u3002
kGLMM_GroupingOnRandEffIsNotSupportedForMultinomial.LABEL=\u91dd\u5c0d\u591a\u9805\u5f0f\u6a5f\u7387\u5206\u914d\uff0c\u4e0d\u652f\u63f4\u5728\u96a8\u6a5f\u6548\u679c\u5340\u584a\u4e0a\u5206\u7d44\u3002
kGLMM_UnmatchedDistributionAndLink.LABEL=\u6307\u5b9a\u7684\u5206\u914d\u53ca\u9023\u7d50\u8a2d\u5b9a\u7d44\u5408\u7121\u6548\u3002
kGLMM_InsufficientMemory.LABEL=\u8a18\u61b6\u9ad4\u4e0d\u8db3\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_NoValidCase.LABEL=\u6c92\u6709\u6709\u6548\u7684\u8a18\u9304\u3002
kGLMM_DuplicatedRepeatedLevels.LABEL=\u5728\u91cd\u8907\u7684\u53d7\u8a66\u8005\u5167\u91dd\u5c0d\u6bcf\u4e00\u500b\u6848\u4f8b\u7684\u91cd\u8907\u6e2c\u91cf\u6548\u679c\u7684\u5c64\u6b21\u4e26\u975e\u4e0d\u540c\u3002
kGLMM_DuplicatedRepeatedLevelForCaseWeight.LABEL=\u56e0\u70ba\u90e8\u5206\u6709\u6548\u7684\u6b21\u6578\u52a0\u6b0a\u5927\u65bc 1\uff0c\u6240\u4ee5\u5728\u91cd\u8907\u7684\u53d7\u8a66\u8005\u5167\u91dd\u5c0d\u6bcf\u4e00\u500b\u6848\u4f8b\u7684\u91cd\u8907\u6e2c\u91cf\u6548\u679c\u7684\u5c64\u6b21\u4e26\u975e\u4e0d\u540c\u3002
kGLMM_UndistinctDependentDataInBinomial.LABEL=\u4f7f\u7528\u4e8c\u9805\u5f0f\u5206\u914d\u6642\uff0c\u76ee\u6a19\u5fc5\u9808\u5177\u6709\u5169\u500b\u76f8\u7570\u7684\u6709\u6548\u8cc7\u6599\u503c\u3002
kGLMM_IllegalDependentValInGammaOrIGauss.LABEL={0} \u6a5f\u7387\u5206\u914d\u7684\u76ee\u6a19\u8cc7\u6599\u503c\u5fc5\u9808\u70ba\u6b63\u6578\u3002
kGLMM_IllegalDependentValInNebinomialOrPoisson.LABEL={0} \u6a5f\u7387\u5206\u914d\u7684\u76ee\u6a19\u8cc7\u6599\u503c\u5fc5\u9808\u70ba\u975e\u8ca0\u6574\u6578\u3002
kGLMM_InvalidInitialValue.LABEL=\u932f\u8aa4\uff1a\u8d77\u59cb\u503c\u6e05\u55ae\u6216\u6a94\u6848\u5305\u542b\u7684\u8cc7\u6599\u7121\u6548\u6216\u4e0d\u8db3\u3002\u5fc5\u9808\u91dd\u5c0d\u6240\u6709\u53c3\u6578\uff08\u5982\u679c\u6a21\u578b\u70ba\u6982\u5316\u7dda\u6027\u6a21\u578b\uff0c\u5247\u5305\u62ec\u5197\u9918\u53c3\u6578\uff09\u63d0\u4f9b\u8d77\u59cb\u503c\u3002\u8d77\u59cb\u503c\u7684\u6392\u5e8f\u61c9\u5c0d\u61c9\u65bc\u7a0b\u5e8f\u6240\u4f7f\u7528\u7684\u6a21\u578b\u53c3\u6578\u6392\u5e8f\u3002
kGLMM_IterationTerminatedButNoConv.LABEL=\u758a\u4ee3\u5df2\u7d42\u6b62\uff0c\u4f46\u5c1a\u672a\u9054\u5230\u6536\u6582\u3002\u6703\u986f\u793a\u524d\u6b21\u758a\u4ee3\u7684\u8f38\u51fa\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_ConvButHessianNotPositive.LABEL=\u5118\u7ba1\u6240\u6709\u6536\u6582\u6e96\u5247\u90fd\u5df2\u6eff\u8db3\uff0c\u4f46\u6700\u7d42 Hessian \u77e9\u9663\u4e0d\u662f\u6b63\u5b9a\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_QuasiCompleteSeparation.LABEL=\u8cc7\u6599\u4e2d\u53ef\u80fd\u6709\u8fd1\u4f3c\u5b8c\u6574\u8cc7\u6599\u5206\u9694\u3002\u6982\u4f3c\u4f30\u8a08\u503c\u4e0a\u9650\u4e0d\u5b58\u5728\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_InvalidCaseInLastIteration.LABEL=\u5728\u524d\u6b21\u758a\u4ee3\u4e2d\u81f3\u5c11\u6709\u4e00\u500b\u8a18\u9304\u7121\u6548\u3002\u5982\u679c\u5728\u758a\u4ee3\u904e\u7a0b\u4e2d\u8a08\u7b97\u53cd\u5411 {0} \u9023\u7d50\u51fd\u6578\u3001\u5c0d\u6578\u6982\u4f3c\u3001\u6f38\u5c64\u6216 Hessian \u77e9\u9663\u6642\u767c\u751f\u932f\u8aa4\uff0c\u5247\u8a18\u9304\u7121\u6548\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_FrequencyWeightVarInCovariate.LABEL=\u5728\u4efb\u4f55\u5176\u4ed6\u89d2\u8272\u4e2d\u4e0d\u53ef\u4f7f\u7528\u6b21\u6578\u52a0\u6b0a\u3002
kGLMM_VarInFixedEffectCanNotBeAnalysisWeightOrOffset.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u90e8\u5206\u56fa\u5b9a\u6548\u679c\u53ca {0}\u3002
kGLMM_VarInRandomEffectCanNotBeAnalysisWeightOrOffset.LABEL=\u6b04\u4f4d\u4e0d\u53ef\u6307\u5b9a\u70ba\u90e8\u5206\u96a8\u6a5f\u6548\u679c\u53ca {0}\u3002
kGLMM_DuplicatedFactorInEffect.LABEL=\u5728\u6548\u679c\u4e2d\u591a\u6b21\u6307\u5b9a\u7a2e\u985e\u6b04\u4f4d\u3002\u50c5\u53ef\u6307\u5b9a\u4e00\u6b21\u3002
kGLMM_InternalError.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kGLMM_TargetIsNotCatForMultinomial.LABEL=\u5982\u679c\u6307\u5b9a\u4e86\u591a\u9805\u5f0f\u6a5f\u7387\u5206\u914d\uff0c\u5247\u76ee\u6a19\u5fc5\u9808\u6709\u7a2e\u985e\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_TargetIsNotContForSomeDistribution.LABEL=\u5982\u679c\u6307\u5b9a\u4e86 {0} \u6a5f\u7387\u5206\u914d\uff0c\u5247\u76ee\u6a19\u5fc5\u9808\u6709\u9023\u7e8c\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_RegWeightFieldIsNotNumeric.LABEL=\u5206\u6790\u52a0\u6b0a\u4e00\u5b9a\u662f\u6578\u503c\u3002
kGLMM_OffsetFieldIsNotContinuous.LABEL=\u504f\u79fb\u5fc5\u9808\u6709\u9023\u7e8c\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_FreWeightFieldIsNotNumeric.LABEL=\u6b21\u6578\u52a0\u6b0a\u6b04\u4f4d\u5fc5\u9808\u70ba\u6578\u503c\u3002
kGLMM_EMMeansEffectIsNotInFixedEffect.LABEL=\u6240\u6709\u4f30\u8a08\u7684\u908a\u969b\u5e73\u5747\u6578\u9805\u76ee\u4e5f\u5fc5\u9808\u70ba\u56fa\u5b9a\u6548\u679c\u3002
kGLMM_EMMeansCovariateIsNotInCovariates.LABEL=\u81f3\u5c11\u4e00\u500b\u6307\u5b9a\u70ba\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u63a7\u5236\u9805\u7684\u6b04\u4f4d\u4e5f\u6c92\u6709\u6307\u5b9a\u70ba\u6a21\u578b\u4e2d\u7684\u5171\u8b8a\u6578\u3002
kGLMM_NumericalProblemInEstimation.LABEL=\u7121\u6cd5\u5efa\u7f6e\u6a21\u578b\uff0c\u56e0\u70ba\u5728\u4f30\u8a08\u671f\u9593\u767c\u751f\u4e86\u8a08\u7b97\u932f\u8aa4\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_TargetIsNotCont4BinomialEventTrials.LABEL=\u5982\u679c\u6307\u5b9a\u4e86\u8a66\u7528\u6578\u6b04\u4f4d\uff0c\u5247\u76ee\u6a19\u5fc5\u9808\u6709\u9023\u7e8c\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_ConstantTarget.LABEL=\u4f7f\u7528\u591a\u9805\u5f0f\u5206\u914d\u6642\uff0c\u76ee\u6a19\u5fc5\u9808\u5177\u6709\u81f3\u5c11\u5169\u500b\u76f8\u7570\u7684\u6709\u6548\u8cc7\u6599\u503c\u3002
kGLMM_ResGroupingWhileNoRepMeasure.LABEL=\u672a\u6307\u5b9a\u91cd\u8907\u6e2c\u91cf\u6b04\u4f4d\uff0c\u56e0\u6b64\u672a\u5efa\u7f6e\u6a21\u578b\u7684\u91cd\u8907\u6e2c\u91cf\u90e8\u5206\u3002
kGLMM_EMMeansHasContinuousFieldInEffect.LABEL=\u6240\u6709\u4f30\u8a08\u7684\u908a\u969b\u5e73\u5747\u6578\u9805\u76ee\u5fc5\u9808\u70ba\u7a2e\u985e\u6b04\u4f4d\u3002
kGLMM_EMMeansEffectIsMoreThan3Ways.LABEL=\u53ef\u5728\u55ae\u4e00\u7684\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u9805\u76ee\u4e2d\u6307\u5b9a\u7684\u6b04\u4f4d\u4e0d\u8d85\u904e\u4e09\u500b\u3002
kGLMM_EMMeansContrastFieldIsNotInEffect.LABEL=\u5c0d\u6bd4\u6b04\u4f4d\u4e5f\u5fc5\u9808\u662f\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u6307\u5b9a\u4e2d\u7684\u9805\u76ee\u3002
kGLMM_EMMeansContrastFieldGoAgainstNestingRules.LABEL=\u5728\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u6307\u5b9a\u4e2d\uff0c\u5de2\u72c0\u6548\u679c\u4e2d\u7684\u5c0d\u6bd4\u6b04\u4f4d\u4e0d\u9069\u7576\u3002
kGLMM_TargetReferenceValueIsNotInDataSet.LABEL=\u76ee\u6a19\u7684\u53c3\u7167\u503c\u5728\u8cc7\u6599\u96c6\u4e2d\u627e\u4e0d\u5230\u3002
kGLMM_NoValidCasesForSpecifiedLinkFunction.LABEL={0} \u9023\u7d50\u51fd\u6578\u6c92\u6709\u6709\u6548\u7684\u8a18\u9304\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_RMatrixIsNotPositiveInIteProcess.LABEL=\u5728\u758a\u4ee3\u904e\u7a0b\u4e2d\uff0c\u6b98\u5dee\u7684\u5171\u8b8a\u6578\u77e9\u9663\u4e0d\u662f\u6b63\u5b9a\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_NumericalOverflowByLargeCovariateValue.LABEL=\u56e0\u70ba\u8f03\u5927\u7684\u5171\u8b8a\u6578\u503c\u5c0e\u81f4\u6578\u503c\u6ea2\u4f4d\uff0c\u6240\u4ee5\u7121\u6cd5\u5efa\u7f6e\u6a21\u578b\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_DuplicateRandomEffectBlockFound.LABEL=\u627e\u5230\u81f3\u5c11\u4e00\u500b\u91cd\u8907\u7684\u96a8\u6a5f\u6548\u679c\u5340\u584a\u3002\u5c07\u5ffd\u7565\u6240\u6709\u91cd\u8907\u7684\u96a8\u6a5f\u6548\u679c\u5340\u584a\u3002
kGLMM_DuplicateEMMeansSpecFound.LABEL=\u627e\u5230\u81f3\u5c11\u4e00\u500b\u91cd\u8907\u7684\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u6307\u5b9a\u3002\u5c07\u5ffd\u7565\u6240\u6709\u91cd\u8907\u7684\u4f30\u8a08\u908a\u969b\u5e73\u5747\u6578\u6307\u5b9a\u3002
kGLMM_ContFieldHaveAnotherEffectNestedInIt.LABEL=\u9023\u7e8c\u6b04\u4f4d\u4e2d\u4e0d\u5f97\u6709\u5176\u4ed6\u5d4c\u5957\u7684\u6548\u679c\u3002
kGLMM_MaxIterReachedButNotConv.LABEL=\u9054\u5230\u758a\u4ee3\u6578\u4e0a\u9650\uff0c\u4f46\u672a\u9054\u5230\u6536\u6582\u3002\u6703\u986f\u793a\u524d\u6b21\u758a\u4ee3\u7684\u8f38\u51fa\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_GMatrIsNotPositive.LABEL=\u96a8\u6a5f\u6548\u679c\u7684\u4f30\u8a08\u5171\u8b8a\u6578\u77e9\u9663\uff08G \u77e9\u9663\uff09\u4e0d\u662f\u6b63\u5b9a\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_CompleteSeparation4BinomialAndNominal.LABEL=\u8cc7\u6599\u4e2d\u53ef\u80fd\u6709\u5b8c\u6574\u8cc7\u6599\u5206\u9694\u3002\u6982\u4f3c\u4f30\u8a08\u503c\u4e0a\u9650\u4e0d\u5b58\u5728\u3002\u5118\u7ba1\u51fa\u73fe\u6b64\u8b66\u544a\uff0c\u4f46\u7a0b\u5e8f\u4ecd\u7136\u7e7c\u7e8c\u3002\u7522\u751f\u7684\u5f8c\u7e8c\u7d50\u679c\u57fa\u65bc\u524d\u6b21\u758a\u4ee3\u3002\u6a21\u578b\u64ec\u5408\u7684\u6709\u6548\u6027\u4e0d\u78ba\u5b9a\u3002
kGLMM_RecordsFoundWithNonPositiveAnalysisWeightValue.LABEL=\u5206\u6790\u52a0\u6b0a\u8cc7\u6599\u503c\u5fc5\u9808\u70ba\u6b63\u6578\u3002
kGLMM_InvalidOrMissingRecordsAreFiltered.LABEL=\u5728\u5206\u6790\u4e2d\u4e0d\u6703\u4f7f\u7528\u4e00\u6216\u591a\u500b\u8a18\u9304\uff0c\u56e0\u70ba\u5b83\u5011\u7684\u4e00\u6216\u591a\u500b\u6b04\u4f4d\u7684\u503c\u7121\u6548\u6216\u907a\u6f0f\u3002
kGLMM_InvalidEventTrialsRecordsAreFiltered.LABEL=\u4e8b\u4ef6\uff08\u76ee\u6a19\uff09\u53ca\u8a66\u7528\u8b8a\u6578\u7684\u6709\u6548\u503c\u5206\u5225\u70ba\u975e\u8ca0\u6574\u6578\u548c\u6b63\u6574\u6578\uff0c\u4e14\u8a66\u7528\u6578\u4e0d\u80fd\u5c0f\u65bc\u4e8b\u4ef6\u6578\u3002
kGLMM_SubjectWithContField.LABEL=\u6240\u6709\u53d7\u8a66\u8005\u6b04\u4f4d\u5fc5\u9808\u6709\u7a2e\u985e\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_GroupInRandomWithContField.LABEL=\u6240\u6709\u5206\u7d44\u6b04\u4f4d\u5fc5\u9808\u6709\u7a2e\u985e\u6e2c\u91cf\u5c64\u6b21\u3002
kGLMM_AllCasesWithNegativeMu.LABEL=\u5728\u758a\u4ee3\u904e\u7a0b\u4e2d\uff0c\u6240\u6709\u9810\u6e2c\u503c\u90fd\u5df2\u8b8a\u70ba\u8ca0\u6578\u3002\u91dd\u5c0d {0} \u6a5f\u7387\u5206\u914d\uff0c\u8ca0\u503c\u7121\u6548\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kGLMM_SpatialFieldIsNotInMetadata.LABEL= \u5728\u8cc7\u6599\u4f86\u6e90\u4e2d\u627e\u4e0d\u5230\u6307\u5b9a\u70ba\u7a7a\u9593\u6b04\u4f4d\u7684\u300c{0}\u300d\u7684\u6b04\u4f4d\u3002
kGLMM_SpatialFieldIsNotCon.LABEL=\u6307\u5b9a\u70ba\u7a7a\u9593\u6b04\u4f4d\u7684\u300c{0}\u300d\u7684\u6b04\u4f4d\u4e0d\u662f\u9023\u7e8c\u7684\u3002\u6240\u6709\u7a7a\u9593\u6b04\u4f4d\u61c9\u70ba\u9023\u7e8c\u6b04\u4f4d\u3002
kGLMM_SpatialFieldIsNotDefinedForSpatialCovariance.LABEL=\u7a7a\u9593\u5171\u8b8a\u6578\u985e\u578b\u300c{0}\u300d\u672a\u5b9a\u7fa9\u7a7a\u9593\u6b04\u4f4d\u3002\u91dd\u5c0d\u9078\u53d6\u7684\u7a7a\u9593\u5171\u8b8a\u6578\u985e\u578b\uff0c\u9700\u8981\u81f3\u5c11\u4e00\u500b\u9023\u7e8c\u7a7a\u9593\u6b04\u4f4d\u3002
kGLMM_RepeatMeasureIsNotDefinedForSpatialCovariance.LABEL=\u7a7a\u9593\u5171\u8b8a\u6578\u985e\u578b\u300c{0}\u300d\u672a\u5b9a\u7fa9\u91cd\u8907\u6e2c\u91cf\u6b04\u4f4d\u3002\u7a7a\u9593\u5171\u8b8a\u6578\u985e\u578b\u9700\u8981\u81f3\u5c11\u4e00\u500b\u91cd\u8907\u6e2c\u91cf\u6b04\u4f4d\u3002\u8655\u7406\u7a0b\u5e8f\u5be6\u969b\u4f7f\u7528\u7684\u662f "ID" \u5171\u8b8a\u6578\u985e\u578b\u3002
kGLMM_ZeroDistancesInCorSpatial.LABEL=\u300c\u7a7a\u9593\u300d\u77e9\u9663\u4e2d\u5b58\u5728\u96f6\u8ddd\u96e2\u3002\u9019\u53ef\u80fd\u662f\u7531\u65bc\u4e0d\u540c\u8a18\u9304\u5177\u6709\u76f8\u540c\u7684 c-list \u503c\u800c\u9020\u6210\u7684\u3002
kGLMM_OneRecordInOneCombinationOfSubjectAndGroup.LABEL=\u8cc7\u6599\u7684\u53d7\u8a66\u8005\u8207\u7fa4\u7d44\u7d44\u5408\u4e2d\u50c5\u5b58\u5728\u4e00\u7b46\u8a18\u9304\u3002
kGLMM_CovStructChangeToUnstructureAsRepeatedBEffHasOneLevel.LABEL=\u5171\u8b8a\u6578\u7d50\u69cb\u8b8a\u66f4\u70ba\u300c\u975e\u7d50\u69cb\u5316\u300d\uff0c\u56e0\u70ba\u91cd\u8907\u8b8a\u6578 B \u53ea\u6709\u4e00\u500b\u5c64\u6b21\u3002
kGLMM_CovStructChangeToUnstructureAsRepeatedNotEqualTwo.LABEL=\u5171\u8b8a\u6578\u7d50\u69cb\u8b8a\u66f4\u70ba\u300c\u975e\u7d50\u69cb\u5316\u300d\uff0c\u56e0\u70ba\u91cd\u8907\u8b8a\u6578\u7684\u6578\u91cf\u4e26\u975e\u7b49\u65bc 2\u3002
kGLMM_RobustChangeModelAsRepeatedKR.LABEL=\u56e0\u70ba\u5df2\u9078\u53d6 Kenward-Roger \u6cd5\uff0c\u5f37\u97cc\u5171\u8b8a\u6578\u65b9\u6cd5\u8b8a\u66f4\u70ba\u57fa\u65bc\u6a21\u578b\u7684\u5171\u8b8a\u6578\u65b9\u6cd5\u3002
kGLMM_CovStructChangeToUnstructureAsOnlyReppeatedOrKroneck.LABEL =\u5171\u8b8a\u6578\u7d50\u69cb\u8b8a\u66f4\u70ba\u300c\u975e\u7d50\u69cb\u5316\u300d\uff0c\u56e0\u70ba\u6c92\u6709\u6307\u5b9a Kronecker \u6e2c\u91cf\u8b8a\u6578\u3002
kGLMM_SameReppeatedandKronecker.LABEL=\u9078\u5b9a\u5171\u8b8a\u6578\u7d50\u69cb\u7684\u300c\u91cd\u8907\u6e2c\u91cf\u300d\u6e05\u55ae\u8207\u300cKronecker \u6e2c\u91cf\u300d\u6e05\u55ae\u76f8\u540c\u3002\u6a21\u578b\u914d\u9069\u53ef\u80fd\u4e0d\u9069\u7576\u3002
kGLMM_ErrorInSettingForKroneckerType.LABEL=\u540c\u6642\u6307\u5b9a\u6709\u91cd\u8907\u6e2c\u91cf\u8207 Kronecker \u6e2c\u91cf\uff0c\u4f46\u662f\u5171\u8b8a\u6578\u985e\u578b "{0}" \u4e26\u975e Kronecker \u985e\u578b\u3002

# Common error message
kMCCANCEL.LABEL=\u5728\u53d6\u6d88\u8981\u6c42\u5f8c\u653e\u68c4\u4e86\u5206\u6790\u3002
kMC_IO_ERROR.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=\u8a18\u61b6\u9ad4\u4e0d\u8db3\u3002\u4e0d\u6703\u986f\u793a\u4efb\u4f55\u8f38\u51fa\u3002
kMC_WRONG_STATE.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMC_CREATE_OR_WRITE_TEMPORARY_FILE_ERROR.LABEL=\u5efa\u7acb\u6216\u5beb\u5165\u66ab\u5b58\u6a94\u6642\u767c\u751f\u554f\u984c\u3002\u8acb\u78ba\u5b9a\u66ab\u5b58\u76ee\u9304\u8def\u5f91\u6709\u6548\u3001\u60a8\u5177\u6709\u76ee\u9304\u5beb\u5165\u6b0a\uff0c\u4ee5\u53ca\u78c1\u789f\u5177\u6709\u5145\u8db3\u7684\u53ef\u7528\u7a7a\u9593\u3002
kMCCom_BadVarIndex.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCCom_NoMetadataForVar.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002  
kMCRegr_InternalError.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCRegr_DataSourceError.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCRegr_NoRecordsFound.LABEL=\u8cc7\u6599\u4f86\u6e90\u4e2d\u627e\u4e0d\u5230\u8a18\u9304\u3002
kMCRegr_RecordTooShort.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCRegr_InvalidRecordValue.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCRegr_LMatrixEmpty.LABEL=\u56e0\u70ba\u81ea\u7531\u5ea6\u70ba\u96f6\uff0c\u6240\u4ee5\u7121\u6cd5\u8a08\u7b97\u3002
kMCRegr_LMatrixNCols.LABEL=\u57f7\u884c\u671f\u9593\u767c\u751f\u5167\u90e8\u932f\u8aa4\u3002
kMCRegr_GEFMatrixEmpty.LABEL=\u56e0\u70ba\u81ea\u7531\u5ea6\u70ba\u96f6\uff0c\u6240\u4ee5\u7121\u6cd5\u8a08\u7b97\u3002

# Process report
PreparedDataHandleMsg.LABEL=\u6e96\u5099\u8cc7\u6599\u8655\u7406\u5df2\u5b8c\u6210
HandleDataProcessMsg.LABEL=\u8655\u7406\u8cc7\u6599\u7a0b\u5e8f\uff1a{0} %
HandleDataProcessEndMsg.LABEL=\u8655\u7406\u8cc7\u6599\u7a0b\u5e8f\u5df2\u5b8c\u6210
ExportPmmlProgressMsg.LABEL=\u5c07\u6a21\u578b\u532f\u51fa\u81f3 PMML \u6a94\u6848\u5df2\u5b8c\u6210

# Saved field labels
kGLMM_PredictedValue_0=\u9810\u6e2c\u503c
kGLMM_PredictedProbability_2={0} \u7684\u9810\u6e2c\u6a5f\u7387 = {1}
kGLMM_CumulativePredictedProbability_2={0} \u7684\u9810\u6e2c\u7d2f\u7a4d\u6a5f\u7387 = {1}
kGLMM_ConfidencePP_0=\u5c0d\u9810\u6e2c\u503c\u7684\u4fe1\u8cf4\u5ea6\uff08\u9810\u6e2c\u6a5f\u7387\uff09
kGLMM_ConfidencePI_0=\u5c0d\u9810\u6e2c\u503c\u7684\u4fe1\u8cf4\u5ea6\uff08\u6a5f\u7387\u6539\u5584\uff09
kGLMM_CILower_0=\u9810\u6e2c\u503c\u7684 CI \u4e0b\u754c
kGLMM_CILower_2={0} \u7684\u9810\u6e2c\u6a5f\u7387\u7684 CI \u4e0b\u754c = {1}
kGLMM_CumulativeCILower_2={0} \u7684\u9810\u6e2c\u7d2f\u7a4d\u6a5f\u7387\u7684 CI \u4e0b\u754c = {1}
kGLMM_CIUpper_0=\u9810\u6e2c\u503c\u7684 CI \u4e0a\u754c
kGLMM_CIUpper_2={0} \u7684\u9810\u6e2c\u6a5f\u7387\u7684 CI \u4e0a\u754c = {1}
kGLMM_CumulativeCIUpper_2={0} \u7684\u9810\u6e2c\u7d2f\u7a4d\u6a5f\u7387\u7684 CI \u4e0a\u754c = {1}
kGLMM_PearsonResidual_0=\u76ae\u723e\u68ee (Pearson) \u6b98\u5dee

# Parameters in some messages
CLOGLOG=CLOGLOG
IDENTITY=IDENTITY
LOG=LOG
LOGC=LOGC
LOGIT=LOGIT
NLOGLOG=NLOGLOG
POWER=POWER
PROBIT=PROBIT
fixed=\u56fa\u5b9a
random=\u96a8\u6a5f
gamma=gamma
inverse_Gaussian=\u9006\u9ad8\u65af
negative_binomial=\u8ca0\u4e8c\u9805\u5f0f
Poisson=Poisson \u6a5f\u7387\u5206\u914d
# mcpeer error message
kMCPeerErr_InvalidFrequencyWeight.LABEL=\u6b21\u6578\u52a0\u6b0a\u6b04\u4f4d\u5fc5\u9808\u70ba\u6578\u503c
