#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2012 
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

alm=Modelagem Linear Autom\u00e1tica
unknownErrorMsg.LABEL=Erro interno (desconhecido)
initErrMsg.LABEL=A inicializa\u00e7\u00e3o falhou
inputErrMsg.LABEL=Erro ao ler os dados de entrada
internalErrMsg.LABEL=Erro interno
invalidMetadataErrMsg.LABEL=Metadados (sobre campos de entrada/sa\u00edda) n\u00e3o v\u00e1lidos
fileNotExistErrorMsg.LABEL=O arquivo de dados n\u00e3o existe
storageNotSupportErrorMsg.LABEL=A integra\u00e7\u00e3o n\u00e3o suporta este tipo de armazenamento de dados
invalidTargetErrorMsg.LABEL=Configura\u00e7\u00e3o de vari\u00e1vel de resposta inv\u00e1lida
invalidTarResponseErrorMsg.LABEL=Configura\u00e7\u00e3o de vari\u00e1vel de resposta de destino inv\u00e1lida
predictorsEmptyErrMsg.LABEL=A configura\u00e7\u00e3o dos preditores n\u00e3o deve ficar vazia
targetAsInputErrorMsg.LABEL=Um campo n\u00e3o pode ser especificado como o destino e o preditor 
invalidFrequencyErrorMsg.LABEL=Um campo n\u00e3o pode ser especificado como uma pondera\u00e7\u00e3o e um preditor
invalidTargetResponseErrorMsg.LABEL=O campo de resposta de destino n\u00e3o pode ser uma entrada
invlidResponseCatErrorMsg.LABEL=A vari\u00e1vel de resposta de destino deve ser uma flag
noFrequencyErrorMsg.LABEL=Nenhum campo de frequ\u00eancia selecionado
noTargetErrorMsg.LABEL=Nenhum valor de campo de resposta foi especificado
invalidtarValueMsg.LABEL=Valor de campo de resposta especificado inv\u00e1lido
getfilePathMsg.LABEL=Erro interno (obter arquivo)
creationAlgorithmMsg.LABEL=Erro interno (algoritmo)
buildModelErrorMsg.LABEL=Erro interno (constru\u00e7\u00e3o de componente)
assessModelErrorMsg.LABEL=Erro interno (avalia\u00e7\u00e3o de componente)
exportPMLLErrorMsg.LABEL=Erro interno (exporta\u00e7\u00e3o de PMML do componente)
getDataFieldErrorMsg.LABEL=Erro interno (obter datamodel)
tarResIsSameErrorMsg.LABEL=A vari\u00e1vel de resposta, a vari\u00e1vel de resposta de destino, a vari\u00e1vel de pondera\u00e7\u00e3o e a vari\u00e1vel de parti\u00e7\u00e3o devem ser diferentes
NoTargetFieldErrorMsg.LABEL=Nenhum campo de resposta selecionado
NoTargetResFieldErrorMsg.LABEL=Nenhum campo de resposta de destino selecionado
targetResTrueErrorMsg.LABEL=A configura\u00e7\u00e3o do valor verdadeiro de resposta de destino \u00e9 inv\u00e1lida
PMMLNotExistErrorMsg.LABEL=Erro interno (PMML omisso)
PMMLIsInvalidErrorMsg.LABEL=Erro interno (PMML inv\u00e1lido)
NoPredVarInPMMLErrorMsg.LABEL=Erro interno (nenhuma vari\u00e1vel preditora no arquivo PMML)
PMMLNotMatchDataErrorMsg.LABEL=Erro interno (diret\u00f3rio de PMML)
getDataSourceErrorMsg.LABEL=Erro interno (Obter origem de dados)
dataFileISValidErrorMsg.LABEL=Os dados de entrada n\u00e3o incluem os campos de preditor requeridos pelo modelo
TarFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de resposta requerido pelo modelo
TRFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de resposta de destino requerido pelo modelo
FreFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de frequ\u00eancia requerido pelo modelo
InputFieldNOTMatchMsg.LABEL=Os dados de entrada n\u00e3o incluem os campos requeridos pelo modelo
NoValidRecordsMsg.LABEL=N\u00e3o h\u00e1 registros v\u00e1lidos para a constru\u00e7\u00e3o de modelo
NoRecordsScoringMsg.LABEL=N\u00e3o h\u00e1 registros v\u00e1lidos para escoragem
PartionInValidMsg.LABEL=O campo de parti\u00e7\u00e3o deve ser diferente dos outros campos preditivos
InputFieldConstantMsg.LABEL=Um dos campos de preditor cont\u00e9m apenas um valor
InvalidSettingsErrorMsg.LABEL=Configura\u00e7\u00f5es de algoritmo de componente inv\u00e1lidas
NoValidFieldValuesErrorMsg.LABEL=Os campos nos metadados n\u00e3o definiram valores v\u00e1lidos
InvalidFrequencyWeightDataMsg.LABEL=A pondera\u00e7\u00e3o de frequ\u00eancia deve ser num\u00e9rica
WeightSpecifiedAsTargetMsg.LABEL=Um campo n\u00e3o pode ser especificado como pondera\u00e7\u00e3o e destino ao mesmo tempo
RecordIDSpecifiedAsTargetMsg.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e o destino
RecordIDSpecifiedAsPredictorMsg.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e um preditor
WeightSpecifiedAsRecordIDMsg.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e uma pondera\u00e7\u00e3o
PreparedDataHandleMsg.LABEL=Manipulador de dados de prepara\u00e7\u00e3o conclu\u00eddo
HandleDataProcessMsg.LABEL=Processo de Manipula\u00e7\u00e3o de Dados : {0} %
HandleDataProcessEndMsg.LABEL=Processo de Manipula\u00e7\u00e3o de dados Conclu\u00eddo
ExportPmmlProgressMsg.LABEL=Exporta\u00e7\u00e3o do modelo para o arquivo PMML conclu\u00edda
kMCCANCEL.LABEL=A an\u00e1lise foi abandonada ap\u00f3s uma solicita\u00e7\u00e3o de cancelamento
kMC_IO_ERROR.LABEL=Ocorreu um erro de E/S
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Limite de mem\u00f3ria excedido
kMC_INVALID_SAVE_STATE.LABEL=O comando saveState() foi fornecido em um momento em que n\u00e3o podia ser executado. Tente fornec\u00ea-lo em um melhor momento.
kMC_FAILED_RESTART.LABEL=A reinicializa\u00e7\u00e3o falhou por algum motivo. N\u00e3o \u00e9 poss\u00edvel fazer nada agora
kMC_WRONG_STATE.LABEL=Um comando (diferente de saveState) foi fornecido em um momento inadequado. Normalmente, isso n\u00e3o \u00e9 fatal. Tente fornecer comandos na ordem adequada.
kMCCom_BadVarIndex.LABEL=O \u00edndice de vari\u00e1vel est\u00e1 fora do limite da lista de vari\u00e1veis.
kMCCom_NoMetadataForVar.LABEL=A lista de vari\u00e1veis possui ponteiro zero para uma vari\u00e1vel com \u00edndice encontrada no datum discreto 0.
kMCCom_XML_MissReqAttr.LABEL=Um atributo necess\u00e1rio n\u00e3o est\u00e1 presente.
kMCCom_XML_InvalidAttrVal.LABEL=Um atributo possui um valor inv\u00e1lido.
kMCRegr_InternalError.LABEL=Ocorreu um erro interno, um m\u00e9todo recebeu par\u00e2metros incorretos.
kMCRegr_DataSourceError.LABEL=Erro na origem de dados: HasMore() era true, mas Next() retornou 0.
kMCRegr_NoRecordsFound.LABEL=Nenhum registro encontrado na origem de dados.
kMCRegr_RecordTooShort.LABEL=O registro \u00e9 curto demais para um \u00edndice de vari\u00e1vel especificado.
kMCRegr_InvalidRecordValue.LABEL=Um registro inv\u00e1lido foi encontrado devido a um valor inv\u00e1lido para uma vari\u00e1vel.
kALM_NullPointer.LABEL=Ponteiro nulo em algoritmo.
kALM_InternalError.LABEL=Erro interno em algoritmo.
kALM_NoValidCases.LABEL=N\u00e3o h\u00e1 casos v\u00e1lidos suficientes.
kALM_ModelNotBuilt.LABEL=Um m\u00e9todo que requer o modelo \u00e9 chamado antes da constru\u00e7\u00e3o do modelo.
kALM_VarIsNotInVarList.LABEL=A vari\u00e1vel n\u00e3o est\u00e1 em varList.
kALM_InvalidTargetField.LABEL=O campo de destino deve ter um n\u00edvel de medi\u00e7\u00e3o cont\u00ednuo.
kALM_TargetIsSpecifiedAsPredictor.LABEL=Um campo n\u00e3o pode ser especificado como um destino e um preditor.
kALM_NoPredictorWithoutIntercept.LABEL=Pelo menos um campo preditor \u00e9 necess\u00e1rio quando n\u00e3o h\u00e1 nenhum intercepto.
kALM_InvalidRegressionWeight.LABEL=A pondera\u00e7\u00e3o da an\u00e1lise deve ser num\u00e9rica.
kALM_InvalidFrequencyWeight.LABEL=A pondera\u00e7\u00e3o de frequ\u00eancia deve ser num\u00e9rica.
kALM_WeightSpecifiedAsTarget.LABEL=Um campo n\u00e3o pode ser especificado como uma pondera\u00e7\u00e3o e um destino.
kALM_WeghtSpecifiedAsPredictor.LABEL=Um campo n\u00e3o pode ser especificado como uma pondera\u00e7\u00e3o e como um preditor.
kALM_InvalidTolerance.LABEL=A toler\u00e2ncia de singularidade deve permanecer na amplitude inclusiva de 10e-12 at\u00e9 1.0.
kALM_POutNotLargerThanPIn.LABEL=A probabilidade de entrada deve ser menor ou igual \u00e0 probabilidade de remo\u00e7\u00e3o.
kALM_NoTargetVarInMetadata.LABEL=O campo de destino n\u00e3o est\u00e1 definido nos metadados.
kALM_ConflictFreqVarInSettingAndMetadata.LABEL=A defini\u00e7\u00e3o do campo de pondera\u00e7\u00e3o de Frequ\u00eancia est\u00e1 em conflito em configura\u00e7\u00f5es e metadados.
kALM_RecordIdUnDefinedInMetadata.LABEL=Um campo de ID de Registro est\u00e1 configurado nas configura\u00e7\u00f5es, mas n\u00e3o nos metadados.
kALM_ErrorInDataPass.LABEL=Foi detectado um erro n\u00e3o explicado durante a passagem de dados.
#kALM_LoopIterLargeMaxIter.LABEL=The number of iterations during estimation reached the maximum number of iterations.
kALM_NoMetadataForVar.LABEL=A vari\u00e1vel n\u00e3o possui informa\u00e7\u00f5es de metadados.
#kALM_NParamsMoreNCases.LABEL=The number of parameters is larger than number of cases.
kALM_NoFactorCategs.LABEL=Os fatores devem ter valores de categoria v\u00e1lidos.
kALM_InvalidCovarianceMatrix.LABEL=A matriz de covari\u00e2ncias fornecida para exporta\u00e7\u00e3o de PMML possui o tamanho errado.
#kALM_ReachMaxEffects.LABEL=Max effects reached during the stepwise method.
kALM_UserCancelProcessing.LABEL=O usu\u00e1rio cancelou a constru\u00e7\u00e3o de modelo.
kALM_SSEIsZero.LABEL=SSE \u00e9 zero, logo AICC, AIC e SBC estar\u00e3o omissos.
kALM_NMinusPStarIsZero.LABEL=N - pstar \u00e9 zero, logo fModelSumStats.fAdjRSquare estar\u00e1 omisso.
kALM_CantGetStringRecordId.LABEL=O componente n\u00e3o pode acessar os valores de ID de registro de sequ\u00eancia de caracteres.
kALM_ConstantTargetField.LABEL=O campo de destino n\u00e3o pode ser constante.
kALM_AllConstantPredictors.LABEL=Todos os preditores s\u00e3o constantes.
kALM_ASENoTestData.LABEL=O crit\u00e9rio ASE est\u00e1 selecionado, mas n\u00e3o h\u00e1 dados de teste especificados.
kALM_OnlyOneValidCase.LABEL=Somente um caso v\u00e1lido no conjunto de dados de treinamento.
#kALM_NoAllEffectsSelected.LABEL=Some effects are not selected in Entry method.
#kALM_PerfectFit.LABEL=Some related statistics cannot be computed because the model has perfect fit.
#kALM_ZeroOutlierofCooksDistance.LABEL=Zero outliers of cook\u2019s distance.
#kALM_TooManyEffectsForBestSubsets.LABEL=There are too many effects to perform.
kALM_AllExcludedByEffectEntryTolerance.LABEL=Todos os preditores s\u00e3o exclu\u00eddos pela toler\u00e2ncia de singularidade.
kALM_DuplicatedPredictors.LABEL=Encontrados Preditores duplicados.
kALM_InvalidSelectionMethod.LABEL=M\u00e9todo de sele\u00e7\u00e3o de modelo inv\u00e1lido.
kALM_InvalidSelectCriterion.LABEL=Crit\u00e9rios inv\u00e1lidos para entrada/remo\u00e7\u00e3o.
kALM_InvalidPIn.LABEL=Se um efeito for inclu\u00eddo, em seguida, seu valor-p dever\u00e1 ser menor que um limite que est\u00e1 na faixa exclusiva de 0 a 1.
kALM_InvalidPOut.LABEL=Se um efeito for removido, em seguida, seu valor-p dever\u00e1 ser menor que um limite que est\u00e1 na faixa exclusiva de 0 a 1.
kALM_InvalidMaxSteps.LABEL=O n\u00famero m\u00e1ximo de efeitos no modelo final deve ser maior que 0.
kALM_InvalidMaxEffects.LABEL=O MaxEffects deve ser maior que 0.
kALM_InvalidMaxEffectsForAllPossibleSubset.LABEL=O n\u00famero m\u00e1ximo de efeitos para todos os subconjuntos poss\u00edveis deve ser maior que 0.
kALM_InvalidNumOfTopN.LABEL=O n\u00famero de modelos N superiores deve permanecer na amplitude inclusiva de 1 a 100.
kALM_InvalidNumOfThreads.LABEL=O n\u00famero de encadeamentos deve permanecer na amplitude de 1 a 100, inclusivo.
kALM_InvalidCIn.LABEL=O n\u00edvel de confian\u00e7a deve permanecer na amplitude de 1 a 100 inclusiva.
kALM_RecordIDSpecifiedAsTarget.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e o destino ao mesmo tempo.
kALM_RecordIDSpecifiedAsPredictor.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e como um preditor.
kALM_WeghtSpecifiedAsRecordID.LABEL=Um campo n\u00e3o pode ser especificado como um ID de registro e como uma pondera\u00e7\u00e3o.
kALM_TooManyCategories4OneCategoricalVariable.LABEL=Pelo menos uma vari\u00e1vel categ\u00f3rica possui muitas categorias.
