#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2010, 2012 
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

alm=Modellazione lineare automatica
unknownErrorMsg.LABEL=Errore interno (sconosciuto)
initErrMsg.LABEL=Inizializzazione non riuscita
inputErrMsg.LABEL=Errore durante la lettura dei dati di input
internalErrMsg.LABEL=Errore interno
invalidMetadataErrMsg.LABEL=Metadati non validi (su campi di input/output)
fileNotExistErrorMsg.LABEL=Il file di dati non esiste
storageNotSupportErrorMsg.LABEL=L'integrazione non supporta questo tipo di archiviazione dati
invalidTargetErrorMsg.LABEL=Impostazione variabile obiettivo non valida
invalidTarResponseErrorMsg.LABEL=Impostazione variabile risposta obiettivo non valida
predictorsEmptyErrMsg.LABEL=L'impostazione per i predittori non deve essere vuota
targetAsInputErrorMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come obiettivo che come predittore 
invalidFrequencyErrorMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come peso che come predittore
invalidTargetResponseErrorMsg.LABEL=Il campo Risposta obiettivo non pu\u00f2 essere un input
invlidResponseCatErrorMsg.LABEL=La variabile risposta obiettivo deve essere un indicatore
noFrequencyErrorMsg.LABEL=Nessun campo frequenza selezionato
noTargetErrorMsg.LABEL=Non \u00e8 stato specificato alcun valore per il campo obiettivo
invalidtarValueMsg.LABEL=\u00c8 stato specificato un valore campo obiettivo non valido
getfilePathMsg.LABEL=Errore interno (acquisizione file)
creationAlgorithmMsg.LABEL=Errore interno (algoritmo)
buildModelErrorMsg.LABEL=Errore interno (creazione componente)
assessModelErrorMsg.LABEL=Errore interno (valutazione componente)
exportPMLLErrorMsg.LABEL=Errore interno (esportazione PMML componente)
getDataFieldErrorMsg.LABEL=Errore interno (acquisizione modello dati)
tarResIsSameErrorMsg.LABEL=La variabile obiettivo, la variabile risposta obiettivo, la variabile peso e la variabile partizione devono essere differenti
NoTargetFieldErrorMsg.LABEL=Nessun campo obiettivo selezionato
NoTargetResFieldErrorMsg.LABEL=Nessun campo di risposta obiettivo selezionato
targetResTrueErrorMsg.LABEL=L'impostazione del valore true della risposta obiettivo non \u00e8 valida
PMMLNotExistErrorMsg.LABEL=Errore interno (PMML mancante)
PMMLIsInvalidErrorMsg.LABEL=Errore interno (PMML non valido)
NoPredVarInPMMLErrorMsg.LABEL=Errore interno (nessuna variabile predittore nel file PMML)
PMMLNotMatchDataErrorMsg.LABEL=Errore interno (cartella PMML)
getDataSourceErrorMsg.LABEL=Errore interno (acquisizione origine dati)
dataFileISValidErrorMsg.LABEL=I dati di input non includono i campi predittore richiesti dal modello
TarFieldNOTMatchErrMsg.LABEL=I dati di input non includono il campo obiettivo richiesto dal modello
TRFieldNOTMatchErrMsg.LABEL=I dati di input non includono il campo risposta obiettivo richiesto dal modello
FreFieldNOTMatchErrMsg.LABEL=I dati di input non includono il campo frequenza richiesto dal modello
InputFieldNOTMatchMsg.LABEL=I dati di input non includono i campi richiesti dal modello
NoValidRecordsMsg.LABEL=Non vi sono record validi per la creazione del modello
NoRecordsScoringMsg.LABEL=Non vi sono record validi per il calcolo del punteggio
PartionInValidMsg.LABEL=Il campo partizione deve essere diverso dagli altri campi predittivi
InputFieldConstantMsg.LABEL=Uno dei campi predittore contiene un solo valore
InvalidSettingsErrorMsg.LABEL=Impostazioni dell'algoritmo del componente non valide
NoValidFieldValuesErrorMsg.LABEL=I campi nei metadati non definivano valori validi
InvalidFrequencyWeightDataMsg.LABEL=Il peso della frequenza deve essere numerico
WeightSpecifiedAsTargetMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come peso che come obiettivo
RecordIDSpecifiedAsTargetMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come ID record che come obiettivo
RecordIDSpecifiedAsPredictorMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come ID record che come predittore
WeightSpecifiedAsRecordIDMsg.LABEL=Un campo non pu\u00f2 essere specificato sia come ID record che come peso
PreparedDataHandleMsg.LABEL=Preparazione dell'handle di dati completata
HandleDataProcessMsg.LABEL=Processo handle di dati: {0} %
HandleDataProcessEndMsg.LABEL=Processo handle di dati completato
ExportPmmlProgressMsg.LABEL=Esportazione del modello nel file PMML completata
kMCCANCEL.LABEL=L'analisi \u00e8 stata interrotta in seguito a una richiesta di annullamento
kMC_IO_ERROR.LABEL=Si \u00e8 verificato un errore I/O
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Limite di memoria superato
kMC_INVALID_SAVE_STATE.LABEL=Il comando saveState() \u00e8 stato immesso in un momento in cui non poteva essere eseguito. Provare a immetterlo in un momento migliore.
kMC_FAILED_RESTART.LABEL=Riavvio non riuscito per qualche motivo. Ora non \u00e8 possibile eseguire alcuna operazione.
kMC_WRONG_STATE.LABEL=Un comando (diverso da saveState) \u00e8 stato immesso in un momento inappropriato. In genere, non si tratta di un errore irreversibile. Provare a immettere i comandi nell'ordine appropriato.
kMCCom_BadVarIndex.LABEL=L'indice variabile non \u00e8 compreso nei limiti dell'elenco di variabili.
kMCCom_NoMetadataForVar.LABEL=L'elenco variabili ha un puntatore zero per una variabile con indice trovato nel dato discreto 0.
kMCCom_XML_MissReqAttr.LABEL=Un attributo obbligatorio non \u00e8 presente.
kMCCom_XML_InvalidAttrVal.LABEL=Un attributo ha un valore non valido.
kMCRegr_InternalError.LABEL=Si \u00e8 verificato un errore interno, un metodo ha ricevuto parametri non corretti.
kMCRegr_DataSourceError.LABEL=Errore nell'origine dati: HasMore() era true, ma Next() ha restituito 0.
kMCRegr_NoRecordsFound.LABEL=Nessun record trovato nell'origine dati.
kMCRegr_RecordTooShort.LABEL=Il record \u00e8 troppo corto per un indice delle variabili specificato.
kMCRegr_InvalidRecordValue.LABEL=\u00c8 stato rilevato un record non valido dovuto a un valore non valido per una variabile.
kALM_NullPointer.LABEL=Puntatore nullo nell'algoritmo.
kALM_InternalError.LABEL=Errore interno nell'algoritmo.
kALM_NoValidCases.LABEL=Numero di casi validi insufficiente.
kALM_ModelNotBuilt.LABEL=Un metodo che richiede il modello \u00e8 stato richiamato prima della creazione del modello.
kALM_VarIsNotInVarList.LABEL=La variabile non \u00e8 presente nell'elenco variabili.
kALM_InvalidTargetField.LABEL=Il campo obiettivo deve avere un livello di misurazione continuo.
kALM_TargetIsSpecifiedAsPredictor.LABEL=Non \u00e8 possibile specificare un campo sia come obiettivo che come predittore.
kALM_NoPredictorWithoutIntercept.LABEL=\u00c8 richiesto almeno un campo predittore quando non vi \u00e8 alcuna intercetta.
kALM_InvalidRegressionWeight.LABEL=Il peso dell'analisi deve essere numerico.
kALM_InvalidFrequencyWeight.LABEL=Il peso della frequenza deve essere numerico.
kALM_WeightSpecifiedAsTarget.LABEL=Non \u00e8 possibile specificare un campo sia come peso che come obiettivo.
kALM_WeghtSpecifiedAsPredictor.LABEL=Non \u00e8 possibile specificare un campo sia come peso che come predittore.
kALM_InvalidTolerance.LABEL=La tolleranza della singolarit\u00e0 deve essere compresa nell'intervallo da 10e-12 a 1.0 inclusi.
kALM_POutNotLargerThanPIn.LABEL=La probabilit\u00e0 di inserimento deve essere inferiore o uguale alla probabilit\u00e0 di rimozione.
kALM_NoTargetVarInMetadata.LABEL=Il campo obiettivo non \u00e8 definito nei metadati.
kALM_ConflictFreqVarInSettingAndMetadata.LABEL=La definizione del campo Peso frequenza \u00e8 in conflitto nelle impostazioni e nei metadati.
kALM_RecordIdUnDefinedInMetadata.LABEL=Un campo ID record \u00e8 definito nelle impostazioni, ma non nei metadati.
kALM_ErrorInDataPass.LABEL=Durante il passaggio dei dati \u00e8 stato rilevato un errore non spiegato.
#kALM_LoopIterLargeMaxIter.LABEL=The number of iterations during estimation reached the maximum number of iterations.
kALM_NoMetadataForVar.LABEL=La variabile non ha informazioni sui metadati.
#kALM_NParamsMoreNCases.LABEL=The number of parameters is larger than number of cases.
kALM_NoFactorCategs.LABEL=I fattori devono avere valori di categoria validi.
kALM_InvalidCovarianceMatrix.LABEL=La matrice di covarianza fornita per l'esportazione PMML ha una dimensione errata.
#kALM_ReachMaxEffects.LABEL=Max effects reached during the stepwise method.
kALM_UserCancelProcessing.LABEL=Creazione del modello annullata dall'utente.
kALM_SSEIsZero.LABEL=SSE \u00e8 zero, pertanto AICC, AIC e SBC saranno mancanti.
kALM_NMinusPStarIsZero.LABEL=N - pstar \u00e8 zero, pertanto fModelSumStats.fAdjRSquare saranno mancanti.
kALM_CantGetStringRecordId.LABEL=Il componente non pu\u00f2 accedere ai valori ID record della stringa.
kALM_ConstantTargetField.LABEL=Il campo obiettivo non pu\u00f2 essere costante.
kALM_AllConstantPredictors.LABEL=Tutti i predittori sono costanti.
kALM_ASENoTestData.LABEL=Il criterio ASE \u00e8 selezionato ma non \u00e8 stato specificato alcun dato di test.
kALM_OnlyOneValidCase.LABEL=Il dataset di addestramento include un solo caso valido.
#kALM_NoAllEffectsSelected.LABEL=Some effects are not selected in Entry method.
#kALM_PerfectFit.LABEL=Some related statistics cannot be computed because the model has perfect fit.
#kALM_ZeroOutlierofCooksDistance.LABEL=Zero outliers of cook\u2019s distance.
#kALM_TooManyEffectsForBestSubsets.LABEL=There are too many effects to perform.
kALM_AllExcludedByEffectEntryTolerance.LABEL=Tutti i predittori sono esclusi dalla tolleranza della singolarit\u00e0.
kALM_DuplicatedPredictors.LABEL=Sono stati rilevati dei predittori duplicati.
kALM_InvalidSelectionMethod.LABEL=Metodo di selezione modello non valido.
kALM_InvalidSelectCriterion.LABEL=Criteri non validi per inserimento/rimozione.
kALM_InvalidPIn.LABEL=Se viene incluso un effetto, il suo valore p deve essere inferiore a una soglia che \u00e8 compresa nell'intervallo 0-1, esclusi.
kALM_InvalidPOut.LABEL=Se viene rimosso un effetto, il suo valore p deve essere inferiore a una soglia che \u00e8 compresa nell'intervallo 0-1, esclusi.
kALM_InvalidMaxSteps.LABEL=Il numero massimo di effetti nel modello finale deve essere maggiore di 0.
kALM_InvalidMaxEffects.LABEL=Il numero massimo di effetti deve essere maggiore di 0.
kALM_InvalidMaxEffectsForAllPossibleSubset.LABEL=Il numero massimo di effetti per tutti i possibili sottoinsiemi deve essere maggiore di 0.
kALM_InvalidNumOfTopN.LABEL=Il numero dei primi N modelli deve essere compreso nell'intervallo da 1 a 100 inclusi.
kALM_InvalidNumOfThreads.LABEL=Il numero di thread deve essere compreso nell'intervallo da 1 a 100 inclusi.
kALM_InvalidCIn.LABEL=Il livello di confidenza deve essere compreso nell'intervallo da 1 a 100 inclusi.
kALM_RecordIDSpecifiedAsTarget.LABEL=Non \u00e8 possibile specificare un campo sia come un ID record che come obiettivo.
kALM_RecordIDSpecifiedAsPredictor.LABEL=Un campo non pu\u00f2 essere specificato sia come ID record che come predittore.
kALM_WeghtSpecifiedAsRecordID.LABEL=Un campo non pu\u00f2 essere specificato sia come ID record che come peso.
kALM_TooManyCategories4OneCategoricalVariable.LABEL=Almeno una variabile categoriale ha troppe categorie.
