#/***********************************************************************
# * Licensed Materials - Property of IBM
# *
# * IBM SPSS Products: <Analytic Components>
# *
# * (C) Copyright IBM Corp. 2009, 2012
# *
# * US Government Users Restricted Rights - Use, duplication or disclosure
# * restricted by GSA ADP Schedule Contract with IBM Corp.
# ************************************************************************/
#NLS_ENCODING=UNICODE
#NLS_MESSAGEFORMAT_NONE

neuralnet=Rede neural
kMCCANCEL.LABEL=A an\u00e1lise foi abandonada ap\u00f3s uma solicita\u00e7\u00e3o de cancelamento
kMC_IO_ERROR.LABEL=Ocorreu um erro de E/S
kMC_MEMORY_LIMIT_EXCEEDED.LABEL=Limite de mem\u00f3ria excedido
kMC_INVALID_SAVE_STATE.LABEL=O comando saveState() foi fornecido em um momento em que n\u00e3o podia ser executado. Tente fornec\u00ea-lo em um melhor momento.
kMC_FAILED_RESTART.LABEL=A reinicializa\u00e7\u00e3o falhou por algum motivo. N\u00e3o \u00e9 poss\u00edvel fazer nada agora
kMC_WRONG_STATE.LABEL=Um comando (al\u00e9m de saveState) foi fornecido em um momento inadequado. Normalmente, isso n\u00e3o \u00e9 fatal. Tente fornecer comandos na ordem adequada.
kMC_FailedCreateNetwork.LABEL=Falha ao criar um modelo (possivelmente devido a um problema de Cluster).
kMC_TemporaryFile.LABEL=Falha ao abrir um arquivo tempor\u00e1rio.
kMC_InvalidCategory.LABEL=O valor de categoria \u00e9 negativo ou muito alto.
kMC_NoValidRecords.LABEL=Nenhum registro v\u00e1lido encontrado na fonte de dados.
kMC_InvalidSpecSensAnalysis.LABEL=Especifica\u00e7\u00f5es inv\u00e1lidas ou contradit\u00f3rias para An\u00e1lise de Sensibilidade.
kMC_FailedRestoreFromBinary.LABEL=Falha ao restaurar do estado salvo bin\u00e1rio.
kMC_FailedRestoreFromXML.LABEL=Falha ao restaurar do estado salvo XML.
kMC_EncodedDataError.LABEL=Detectados erros nos dados codificados.
kMC_InvalidVariableList.LABEL=\u00c9 necess\u00e1rio que haja pelo menos um preditor e um campo de destino. N\u00e3o s\u00e3o permitidas vari\u00e1veis constantes.
kMC_VarlistVsSettingsInputs.LABEL=A lista de vari\u00e1veis e configura\u00e7\u00f5es cont\u00eam informa\u00e7\u00f5es\n contradit\u00f3rias sobre vari\u00e1veis de entrada.
kMC_VarlistVsSettingsOutputs.LABEL=A lista de vari\u00e1veis e configura\u00e7\u00f5es cont\u00eam informa\u00e7\u00f5es\n contradit\u00f3rias sobre vari\u00e1veis de sa\u00edda.
kMC_NotPositiveNTrainRecs.LABEL=O n\u00famero de registros de treinamento nas configura\u00e7\u00f5es n\u00e3o \u00e9 positivo.
kMC_NotPositiveNTestRecs.LABEL=O n\u00famero de registros de teste nas configura\u00e7\u00f5es n\u00e3o \u00e9 positivo\n apesar de uma origem de dados de teste estar presente.
kMC_NoValidTrainRecords.LABEL=Nenhum registro v\u00e1lido encontrado na fonte de dados de treinamento.
kMC_NoValidTestRecords.LABEL=Nenhum registro v\u00e1lido encontrado na fonte de dados de teste.
kMC_CantReadFile.LABEL=N\u00e3o \u00e9 poss\u00edvel ler o fluxo de arquivo.
kMC_MustReadVarList.LABEL=O m\u00e9todo RestoreNNVarListFromBinary() ou RestoreNNVarListFromXML()\ndeve ser chamado antes do m\u00e9todo\nFinishRestoringAlgorithmFromBinary() ou\nFinishRestoringAlgorithmFromXML(), respectivamente.
kMC_MissingScoringInput.LABEL= Um valor omisso foi fornecido na solicita\u00e7\u00e3o para escoragem.\nO resultado da escoragem estar\u00e1 omisso.
kMCNN_NumberOfWeights.LABEL=O n\u00famero de pondera\u00e7\u00f5es especificadas para restaurar a rede\n n\u00e3o se ajusta \u00e0s configura\u00e7\u00f5es.
kMCNN_Invalid_InnerPartition.LABEL=Valor inv\u00e1lido para a porcentagem de conjunto de preven\u00e7\u00e3o ao super ajuste.
kMCNN_OneVarSpecifiedMoreThanOnceForTheSameRole.LABEL=Um campo foi especificado mais de uma vez para o mesma fun\u00e7\u00e3o (por exemplo, especificado duas vezes como um campo de entrada).
kMCNN_OneVarSpecifiedMoreThanOnceForDifferentRoles.LABEL=Um campo pode ser especificado somente para uma das palavras-chaves TARGET, INPUT ou ANALYSISWEIGHT.
kMCNN_NotSpecifiedInputVariable.LABEL=N\u00e3o h\u00e1 uma vari\u00e1vel especificada para a entrada.
kMCNN_NotSpecifiedTargetVariable.LABEL=N\u00e3o h\u00e1 uma vari\u00e1vel especificada para o destino.
kMCNN_NotSpecifiedFrequenceWeightVariable.LABEL=N\u00e3o h\u00e1 uma vari\u00e1vel especificada para a pondera\u00e7\u00e3o de frequ\u00eancia.
kMCNN_TrainingProcessCompletedAndTakingTime.LABEL=O processo de modelo de treinamento foi conclu\u00eddo, levou {0} minutos e {1} segundos.
unknownErrorMsg.LABEL=Erro interno (desconhecido)
initErrMsg.LABEL=A inicializa\u00e7\u00e3o falhou
inputErrMsg.LABEL=Erro ao ler os dados de entrada
internalErrMsg.LABEL=Erro interno
invalidMetadataErrMsg.LABEL=Metadados (sobre campos de entrada/sa\u00edda) n\u00e3o v\u00e1lidos
fileNotExistErrorMsg.LABEL=O arquivo de dados n\u00e3o existe
storageNotSupportErrorMsg.LABEL=A integra\u00e7\u00e3o n\u00e3o suporta este tipo de armazenamento de dados
invalidTargetErrorMsg.LABEL=Configura\u00e7\u00e3o de vari\u00e1vel de resposta inv\u00e1lida
invalidTarResponseErrorMsg.LABEL=Configura\u00e7\u00e3o de vari\u00e1vel de resposta de destino inv\u00e1lida
predictorsEmptyErrMsg.LABEL=A configura\u00e7\u00e3o dos preditores n\u00e3o deve ficar vazia
targetAsInputErrorMsg.LABEL=O campo de resposta n\u00e3o pode ser uma entrada
invalidFrequencyErrorMsg.LABEL=O campo de frequ\u00eancia n\u00e3o pode ser uma entrada
invalidTargetResponseErrorMsg.LABEL=O campo de resposta de destino n\u00e3o pode ser uma entrada
invlidResponseCatErrorMsg.LABEL=A vari\u00e1vel de resposta de destino deve ser uma flag
noFrequencyErrorMsg.LABEL=Nenhum campo de frequ\u00eancia selecionado
noTargetErrorMsg.LABEL=Nenhum valor de campo de resposta foi especificado
invalidtarValueMsg.LABEL=Valor de campo de resposta especificado inv\u00e1lido
getfilePathMsg.LABEL=Erro interno (obter arquivo)
creationAlgorithmMsg.LABEL=Erro interno (algoritmo)
buildModelErrorMsg.LABEL=Erro interno (constru\u00e7\u00e3o de componente)
assessModelErrorMsg.LABEL=Erro interno (avalia\u00e7\u00e3o de componente)
exportPMLLErrorMsg.LABEL=Erro interno (exporta\u00e7\u00e3o de PMML do componente)
getDataFieldErrorMsg.LABEL=Erro interno (obter datamodel)
tarResIsSameErrorMsg.LABEL=A vari\u00e1vel de resposta, a vari\u00e1vel de resposta de destino, a vari\u00e1vel de pondera\u00e7\u00e3o e a vari\u00e1vel de parti\u00e7\u00e3o devem ser diferentes
NoTargetFieldErrorMsg.LABEL=Nenhum campo de resposta selecionado
NoTargetResFieldErrorMsg.LABEL=Nenhum campo de resposta de destino selecionado
targetResTrueErrorMsg.LABEL=A configura\u00e7\u00e3o do valor verdadeiro de resposta de destino \u00e9 inv\u00e1lida
PMMLNotExistErrorMsg.LABEL=Erro interno (PMML omisso)
PMMLIsInvalidErrorMsg.LABEL=Erro interno (PMML inv\u00e1lido)
NoPredVarInPMMLErrorMsg.LABEL=Erro interno (nenhuma vari\u00e1vel preditora no arquivo PMML)
PMMLNotMatchDataErrorMsg.LABEL=Erro interno (diret\u00f3rio de PMML)
getDataSourceErrorMsg.LABEL=Erro interno (Obter origem de dados)
dataFileISValidErrorMsg.LABEL=Os dados de entrada n\u00e3o incluem os campos de preditor requeridos pelo modelo
TarFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de resposta requerido pelo modelo
TRFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de resposta de destino requerido pelo modelo
FreFieldNOTMatchErrMsg.LABEL=Os dados de entrada n\u00e3o incluem o campo de frequ\u00eancia requerido pelo modelo
InputFieldNOTMatchMsg.LABEL=Os dados de entrada n\u00e3o incluem os campos requeridos pelo modelo
NoValidRecordsMsg.LABEL=N\u00e3o h\u00e1 registros v\u00e1lidos para a constru\u00e7\u00e3o de modelo
NoRecordsScoringMsg.LABEL=N\u00e3o h\u00e1 registros v\u00e1lidos para escoragem
PartionInValidMsg.LABEL=O campo de parti\u00e7\u00e3o deve ser diferente dos outros campos preditivos
InputFieldConstantMsg.LABEL=Um dos campos de preditor cont\u00e9m apenas um valor
InvalidSettingsErrorMsg.LABEL=Configura\u00e7\u00f5es de algoritmo de componente inv\u00e1lidas
NoValidFieldValuesErrorMsg.LABEL=Os campos nos metadados n\u00e3o definiram valores v\u00e1lidos
